// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
Перем НеИспользуется_ТиповойМодуль;
Перем НеИспользуется_РежимУправляемыхФорм;

Перем Ядро;
Перем ОсновнойМодуль;
Перем ГенерацияXML;
Перем ПечатныеФормы;
Перем РаботаСМаркировкой;

Перем ОКСМ Экспорт; //Общероссийский классификатор стран мира
Перем _ЭтоБухгалтерияПредприятия;
Перем _ЭтоКомплекснаяАвтоматизация; // Модуль интеграции используется в конфигурации "Комплексная автоматизация"

Перем _СоответствиеСтавокНДС; // Кэш соответствия ставок НДС
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

//{		ИНИЦИАЛИЗАЦИЯ

Процедура ИнициализироватьМодуль(Модуль_Ядро, Модуль_ВызовыПМ, Модуль_ГенерацияXML, Модуль_ПечатныеФормы, Модуль_РаботаСМаркировкой) Экспорт
	
	Ядро = Модуль_Ядро;
	ОсновнойМодуль = Модуль_ВызовыПМ;
	ГенерацияXML = Модуль_ГенерацияXML;
	ПечатныеФормы = Модуль_ПечатныеФормы;
	РаботаСМаркировкой = Модуль_РаботаСМаркировкой;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМодуля() Экспорт
	
	Ядро = Неопределено;
	ОсновнойМодуль = Неопределено;
	ГенерацияXML = Неопределено;
	ПечатныеФормы = Неопределено;
	РаботаСМаркировкой = Неопределено;
	
КонецПроцедуры

//}		ИНИЦИАЛИЗАЦИЯ

//****************************************************************************
//{ СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ

// Основная точка входа в ПМ
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Obrabotat%27Sobytiye.html
	
	// В обработчиках событий ПМ, если требуется только обработка результата типового ИМ - используем код вида:
	//
	// Если Параметры.Свойство("Результат_ИМ") Тогда
	//		//АЛГОРИТМ_ОБРАБОТКИ_РЕЗУЛЬТАТА_СОБЫТИЯ
	//		Возврат Результат;
	// КонецЕсли;
	
	
	///////////// ОТПРАВКА ПАКЕТОВ /////////////
	
	Если ИмяСобытия = "ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов" Тогда
		
		Возврат ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьПакет" Тогда
		
		Возврат ПодготовитьПакет(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокумент" Тогда
		
		Возврат ПодготовитьЭлектронныйДокумент(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме" Тогда
		
		Возврат ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеПодготовкиПакета" Тогда
		
		Возврат ПослеПодготовкиПакета(Параметры);
				
	ИначеЕсли ИмяСобытия = "ПослеОтправкиПакета" Тогда
		
		Возврат ПослеОтправкиПакета(Параметры);
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьРеквизитыДокумента" Тогда
		
		Возврат ЗаполнитьРеквизитыДокумента(Параметры);

		
	///////////// ОБРАБОТКА ВХОДЯЩИХ /////////////
	
	ИначеЕсли ИмяСобытия = "НайтиСопоставлениеДокумента" Тогда
		
		Возврат НайтиСопоставлениеДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьЗаполненныйОбъектДокумента1С" Тогда
		
		Возврат ПолучитьЗаполненныйОбъектДокумента1С(Параметры);	
	
	ИначеЕсли ИмяСобытия = "ПровестиАнализДокумента" Тогда
		
		Возврат ПровестиАнализДокумента(Параметры);		
	
	ИначеЕсли ИмяСобытия = "ПослеАнализаПакета" Тогда
		
		Возврат ПослеАнализаПакета(Параметры);
			
	ИначеЕсли ИмяСобытия = "ВыполнитьТребуемоеДействие" Тогда
		
		Возврат ВыполнитьТребуемоеДействие(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПравилаСопоставленияДокумента" Тогда
		
		Возврат ПравилаСопоставленияДокумента(Параметры);
		
	ИначеЕсли ИмяСобытия = "СписокТиповДокументовДляСоздания" Тогда
		
		Возврат СписокТиповДокументовДляСоздания(Параметры);
		
		
	///////////// СОПОСТАВЛЕНИЕ НОМЕНКЛАТУРЫ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗаполнитьТаблицуСопоставленияНоменклатуры" Тогда
		
		Возврат ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПрочитатьСопоставлениеНоменклатуры" Тогда
		
		Возврат ПрочитатьСопоставлениеНоменклатуры(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОтборСопоставленияНоменклатуры" Тогда
		
		Возврат ОтборСопоставленияНоменклатуры(Параметры);
		
		
	///////////// КРИПТОГРАФИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ЗашифроватьДанные" Тогда
		
		Возврат ЗашифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "РасшифроватьДанные" Тогда
		
		Возврат РасшифроватьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьСертификатыДляШифрования" Тогда
		
		Возврат ПолучитьСертификатыДляШифрования(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПодписатьДанные" Тогда
		
		Возврат ПодписатьДанные(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПроверитьПодпись" Тогда
		
		Возврат ПроверитьПодпись(Параметры);	
			
		
	///////////// ПРОЧИЕ СОБЫТИЯ /////////////
	
	ИначеЕсли ИмяСобытия = "ПослеУстановкиСтатусаДокумента" Тогда
		
		Возврат ПослеУстановкиСтатусаДокумента(Параметры);
	
	ИначеЕсли ИмяСобытия = "ПолучитьНастройкиДополнительныхКолонокСпискаДокументов" Тогда
		
		Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбновленияСпискаДокументов" Тогда
		
		Возврат ПослеОбновленияСпискаДокументов(Параметры);	
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокДополнительныхКнопок" Тогда
		
		Возврат ЗаполнитьСписокДополнительныхКнопок(Параметры);
				
	ИначеЕсли ИмяСобытия = "НажатиеДополнительнойКнопки" Тогда
		
		Возврат НажатиеДополнительнойКнопки(Параметры);
	    	
	ИначеЕсли ИмяСобытия = "ВыполнитьРегламентныеДействия" Тогда
		
		Возврат ВыполнитьРегламентныеДействия(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьТаблицуИспользуемыхВидовДокументов" Тогда
		
		Возврат ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПолучитьКоличествоДокументовЗаПериод" Тогда
		
		Возврат ПолучитьКоличествоДокументовЗаПериод(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПослеОбработкиЛентыСобытий" Тогда
		
		Возврат ПослеОбработкиЛентыСобытий(Параметры);
		
	ИначеЕсли ИмяСобытия = "ПриОткрытииФормы" Тогда
		
		Возврат ПриОткрытииФормы(Параметры);

	ИначеЕсли ИмяСобытия = "ПриПолученииДанныхТабличнойЧасти" Тогда
		
		Возврат ПриПолученииДанныхТабличнойЧасти(Параметры);
		
	ИначеЕсли ИмяСобытия = "ОбновитьКомментарийДокументаУчета" Тогда
		
		Возврат ОбновитьКомментарийДокументаУчета(Параметры);
		
	КонецЕсли;
	
КонецФункции


///////////////////////////////////////
///////////// ИСХОДЯЩИЕ ///////////////
///////////////////////////////////////

// Определение используемых исходящих видов документов, включаемых в пакеты
Функция ПолучитьТаблицуИспользуемыхВидовДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TablitsuIspol%27zuyemykhVidovDokumentov.html
	
	ТЗ = ТаблицаЗначенийСКолонками("ID, Наименование, ТипДокументаAPI, ТипКонтентаAPI, ФункцияДокументаAPI, БазовыйВидДокумента");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктФормализованный",	"Акт",								"XmlAcceptanceCertificate", 			"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12",				"ТОРГ-12", 							"XmlTorg12", 							"utd970");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФактура",			"СФ", 								"Invoice", 								"utd970");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)", 				"InvoiceRevision", 						"utd970",	Неопределено,	"ID_СчетФактура");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД", 								"UniversalTransferDocument",			"utd970",	"СЧФДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_СЧФ",				"УПД СЧФ", 							"UniversalTransferDocument",			"utd970",	"СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ДОП",				"УПД ДОП", 							"UniversalTransferDocument",			"utd970",	"ДОП");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)", 				"UniversalTransferDocumentRevision",	"utd970",	"СЧФДОП",		"ID_УПД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_СЧФ",				"УПД СЧФ (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"СЧФ",			"ID_УПД_СЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_ДОП",				"УПД ДОП (исправление)", 			"UniversalTransferDocumentRevision",	"utd970",	"ДОП",			"ID_УПД_ДОП");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ", 								"InvoiceCorrection", 					"ucd736");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)", 				"InvoiceCorrectionRevision", 			"ucd736",		Неопределено,	"ID_КСФ");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД", 								"UniversalCorrectionDocument",			"ucd736",		"КСЧФДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_КСЧФ",				"УКД КСЧФ", 						"UniversalCorrectionDocument",			"ucd736",		"КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_ДИС",				"УКД ДИС", 							"UniversalCorrectionDocument",			"ucd736",		"ДИС");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)", 				"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФДИС",		"ID_УКД");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_КСЧФ",			"УКД КСЧФ (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"КСЧФ",			"ID_УКД_КСЧФ");
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_ДИС",				"УКД ДИС (исправление)", 			"UniversalCorrectionDocumentRevision",	"ucd736",		"ДИС",			"ID_УКД_ДИС");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",						"Счет (неформализованный)", 	"ProformaInvoice", 						"");
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",		"Счет (Диадок)", 				"ProformaInvoice", 						"xmlproformainvoice");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки", 						"ReconciliationAct", 					"");
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ВНУТР", "УПД (перемещение)", "UniversalTransferDocumentInternal", "utd970", "ДОП");
	
	Возврат ТЗ;
	
КонецФункции

// Формирование списков пакетов для отправки
Функция ПолучитьТекстЗапросаДляСпискаПакетовНаОтправкуПоМассивуВидовПакетов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27TekstZaprosaDlyaSpiskaPaketovNaOtpravkuPoMassivuVidovPaketov.html
	
	МассивВидовПакетов	= Параметры.МассивВидовПакетов;
	ПараметрыЗапроса	= Параметры.ПараметрыЗапроса;
	
	Результат = "";
	
	КатегорииПакетов = КатегорииПакетов();

	НужнаВТДокументыБезНДС = Ложь;
	
	Для Каждого ТекВидПакета Из МассивВидовПакетов Цикл
		
		ОписаниеВидаПакета = ОсновнойМодуль.ЭДО_СправочникМенеджер_ПолучитьЭлемент("ВидыПакетов", ТекВидПакета);
		
		ВидПакетаID		= ОписаниеВидаПакета.ID;
		КатегорияПакета	= ОписаниеВидаПакета.КатегорияПакета;
		
		Если 		ВидПакетаID = "ID_ОсновнойПакет" 
				ИЛИ ВидПакетаID = "ID_УПД"
				ИЛИ ВидПакетаID = "ID_УПД_раздельно" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Ложь);
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета);
			
		ИначеЕсли 	ВидПакетаID = "ID_УКД" 
				ИЛИ ВидПакетаID = "ID_УКД_раздельно"
				ИЛИ ВидПакетаID = "ID_КСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Ложь);
			
		ИначеЕсли	ВидПакетаID = "ID_УПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_СФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Ложь);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД" 
				ИЛИ ВидПакетаID = "ID_ИУПД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаРеализацию", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУКД" 
				ИЛИ ВидПакетаID = "ID_ИУКД_раздельно"
				ИЛИ ВидПакетаID = "ID_ИКСФ" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "Корректировочный", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ИУПД_НаАванс" 
				ИЛИ ВидПакетаID = "ID_ИСФ_НаАванс" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, "НаАванс", Истина);
			
		ИначеЕсли   ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" 
				ИЛИ ВидПакетаID = "ID_УПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_ИУПД_БезНДС"
				ИЛИ ВидПакетаID = "ID_УКД_БезНДС" Тогда
			
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета);
			
			НужнаВТДокументыБезНДС = Истина;
			
		ИначеЕсли	ВидПакетаID = "ID_Счет" 
				ИЛИ ВидПакетаID = "ID_СчетФормализованный" Тогда
			
			ИспользуютсяТолькоОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
			
			Если ИспользуютсяТолькоОснованияПоУмолчанию Тогда
				
				Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета);
				
			Иначе
				
				ТипОснования_СчетНаОплату		= ТипОснованияСчетаНаОплату_СчетНаОплату();
				ТипОснования_ЗаказПокупателя	= ТипОснованияСчетаНаОплату_ЗаказПокупателя();
				ТипОснования_ДокументПродажи	= ТипОснованияСчетаНаОплату_ДокументПродажи();
				
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "СчетНаОплатуПокупателю", ТипОснования_СчетНаОплату);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "АктОбОказанииПроизводственныхУслуг", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "КорректировкаРеализации", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ПередачаОС", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "РеализацияТоваровУслуг", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "РеализацияУслугПоПереработке", ТипОснования_ДокументПродажи);
				ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ОтчетКомитентуОПродажах", ТипОснования_ДокументПродажи);
				
				Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
					ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, "ЗаказПокупателя", ТипОснования_ЗаказПокупателя);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли	ВидПакетаID = "ID_АктСверки" Тогда
						
			Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса_АктыСверок(ОписаниеВидаПакета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Результат, СтрДлина("ВЫБРАТЬ") + 1);
		Результат = Результат + "
					|УПОРЯДОЧИТЬ ПО
					|	ДатаДокумента, НомерДокумента";
		
		ТекстЗапроса_ВременныеТаблицы = ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку();
		
		ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса_ВременныеТаблицы, НужнаВТДокументыБезНДС);
		
		ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса_ВременныеТаблицы);
		
		Результат = ТекстЗапроса_ВременныеТаблицы + ТекстЗапроса_РазделительЗапросов() + Результат;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию()
	
	Результат = Ядро.Настройки_ОснованияВидовДокументов_ИспользуютсяНастройкиПоУмолчанию();
	
	Возврат Результат;
	
КонецФункции

// Определение состава пакета
Функция ПодготовитьПакет(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27Paket.html
	
	ВидПакетаРазвернутый	= Параметры.ВидПакетаРазвернутый;
	СтрокаСписка			= Параметры.СтрокаСписка;
	Пакет					= Параметры.Пакет;
	Документ1С				= СтрокаСписка.Документ;

	// Первичные документы
	
	Если ВидПакетаРазвернутый.ID = "ID_УПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ОсновнойПакет" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, ДокументыОснования.ДокументОснование);
		КонецЦикла;
		
	// Первичные документы без НДС
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С);

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_ДОП");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_БезНДС" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_ДИС");
		
	// Исправления первичных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УПД_ДОП");
		КонецЦикла;	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Корректировочные документы
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_УКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_КСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_КСФ");
		
	// Исправления корректировочных документов
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД");

	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУКД_раздельно" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУКД_КСЧФ");
		
		ДокументыОснования = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(Документ1С, "ДокументыОснования", "ДокументОснование");
		
		Пока ДокументыОснования.Следующий() Цикл
			ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, ДокументыОснования.ДокументОснование, "ID_ИУКД_ДИС");
		КонецЦикла;
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИКСФ" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИКСФ");
		
	// СФ на аванс
	
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФактура");
		
	// Исправления СФ на аванс
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИУПД_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИУПД_СЧФ");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_ИСФ_НаАванс" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ИСФ");
	
	// Прочие документы
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_АктСверки" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктСверки");		
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_Счет" Тогда
        		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_Счет");	
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_СчетФормализованный" Тогда
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_СчетФормализованный");
		
	ИначеЕсли ВидПакетаРазвернутый.ID = "ID_УПД_ВНУТР" Тогда
		
		Пакет.Направление = "Внутреннее";
		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ВНУТР");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирование контента на основании ссылки на документ в 1С и необходимого типа контента
Функция ПодготовитьЭлектронныйДокумент(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Podgotovit%27ElektronnyyDokument.html
	
	Результат = Параметры.Результат;
	
	ВидДокументаРазвернутый = Параметры.ВидДокументаРазвернутый;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	ДанныеСотрудника		= Параметры.ДанныеСотрудника;
	
	ДанныеОрганизации = ОсновнойМодуль.Организации_ЗаполненныеРеквизиты(, Результат.BoxID);
	
	УказыватьОтсутствиеОснованияУПД	= ДанныеОрганизации.УказыватьОтсутствиеОснованияУПД;
	
	Документ1С					= Результат.Документ1С;
	ДокументыОснования			= Результат.ДокументыОснования;
	ВидДокументаНаименование	= ВидДокументаРазвернутый.Наименование;
	
	ID							= ВидДокументаРазвернутый.ID;
	ТипКонтента_XDTO			= ВидДокументаРазвернутый.ТипКонтента;	
	TypeNamedId					= ВидДокументаРазвернутый.TypeNamedId;
	FormatVersion				= ВидДокументаРазвернутый.FormatVersion;
	FunctionName				= ВидДокументаРазвернутый.FunctionName;
	
	Если ОсновнойМодуль.ТипСоответствуетКонтентуУПД(ВидДокументаРазвернутый)
		Или ОсновнойМодуль.ТипСоответствуетКонтентуУКД(ВидДокументаРазвернутый) Тогда
		
		//Получим функцию документа, которая используется в типовом модуле
		ФункцияУПД = ФункцияДокументаДляXML(TypeNamedId, FunctionName);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
		
		ДополнительныеПараметры.Вставить("ПараметрыСогласования", Неопределено);
		ДополнительныеПараметры.Вставить("ДанныеСотрудника"		, ДанныеСотрудника); // Графа 10 (РабОргПрод)
		
		ДополнительныеПараметры.Вставить("ФИОПодписанта", " ");
		ДополнительныеПараметры.Вставить("ФункцияУПД"	, ФункцияУПД);
		
		ДополнительныеПараметры.Вставить("FormatVersion", FormatVersion);
		
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_СчетФормализованный" Тогда
		
		ДополнительныеПараметры = Неопределено;
		Content = ОсновнойМодуль.ТиповойМодуль_ПолучитьКонтент(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ТипКонтента_XDTO, ДополнительныеПараметры);
		ОсновнойМодуль.ЗаполнитьКонтентXDTOПоСтруктуре(Результат.Content, Content);
		
	ИначеЕсли ID = "ID_АктСверки" ИЛИ ID = "ID_Счет" Тогда
		
		Если ID = "ID_АктСверки" Тогда
			ИмяПечатнойФормы = "АктСверки";
		Иначе 
			ИмяПечатнойФормы = "СчетНаОплату";
		КонецЕсли;
		
		ДополнительныеПараметры = Неопределено;
		ДанныеПечатнойФормы = ОсновнойМодуль.ТиповойМодуль_СформироватьПечатнуюФорму(НеИспользуется_ТиповойМодуль, НеИспользуется_РежимУправляемыхФорм, Документ1С, ИмяПечатнойФормы, ДополнительныеПараметры);
		
		Результат.Метаданные.DocumentNumber = ДанныеПечатнойФормы.Номер;
		Результат.Метаданные.DocumentDate = ДанныеПечатнойФормы.Дата;
		Результат.Метаданные.FileName = ДанныеПечатнойФормы.ИмяФайла;
		
		Если TypeNamedId = "ProformaInvoice" Тогда
			Результат.Метаданные.TotalSum = ДанныеПечатнойФормы.Сумма;
			Результат.Метаданные.TotalVat = ДанныеПечатнойФормы.СуммаНДС;
			Результат.Метаданные.CurrencyCode = ДанныеПечатнойФормы.КодВалюты;
		КонецЕсли;
		
		Результат.ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
		
		// BSLLS:UsingSynchronousCalls-off
		УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
		// BSLLS:UsingSynchronousCalls-on
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьЭлектронныйДокументПоВнешнейПечатнойФорме(Параметры)
	
	ЗаполнитьРеквизитыДокумента(Параметры);
	
	Документ				= Параметры.Документ;
	РеквизитыДокумента		= Документ.Реквизиты;
	ВнешняяПечатнаяФорма	= Параметры.ВнешняяПечатнаяФорма;
	ИдентификаторКоманды	= Параметры.ИдентификаторКоманды;
	
	ДанныеПечатнойФормы = СформироватьВнешнююПечатнуюФорму(Документ.ДокументУчета, ВнешняяПечатнаяФорма, ИдентификаторКоманды);
	
	Документ.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	Документ.Метаданные.FileName		= ДанныеПечатнойФормы.ИмяФайла;
	Документ.Метаданные.DocumentDate	= РеквизитыДокумента.Дата;
	Документ.Метаданные.DocumentNumber	= РеквизитыДокумента.Номер;
	
	Если Документ.Метаданные.Свойство("TotalSum") Тогда
		Документ.Метаданные.TotalSum = РеквизитыДокумента.Сумма;
	КонецЕсли;
	
	Если Документ.Метаданные.Свойство("TotalVat") Тогда
		Документ.Метаданные.TotalVat = РеквизитыДокумента.СуммаНДС;
	КонецЕсли;
	
	ХранилищеКонтента = Документ.Документооборот.ХранилищеКонтента;
	ХранилищеКонтента.Данные = Новый ДвоичныеДанные(ДанныеПечатнойФормы.ИмяВременногоФайла);
	ХранилищеКонтента.ИмяФайла = ДанныеПечатнойФормы.ИмяФайла;
	
	СлужебнаяИнформация = Документ.СлужебнаяИнформация;
	СлужебнаяИнформация.ПараметрыОтправки.ЗапрашиватьОтветнуюПодпись = Истина;
	
	// BSLLS:UsingSynchronousCalls-off
	УдалитьФайлы(ДанныеПечатнойФормы.ИмяВременногоФайла);
	// BSLLS:UsingSynchronousCalls-on
	
	Возврат Истина;
	
КонецФункции

// Для полностью сформированного пакета можно переопределить отправителя/получателя/подразделение/заблокированность/тестовость
Функция ПослеПодготовкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/PoslePodgotovkiPaketa.html
	
	Пакет = Параметры.Пакет;
	
	//Пакет.ДанныеДД.DelaySend = Истина; 	// Помещение исходящего пакета в черновики - без отправки контрагенту
	//Пакет.ДанныеДД.LockPackage = Истина; 	// Отправка закрытого пакета
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения <> """"
	//|			ТОГДА Диадок_ЮрФизЛица.ID_ВладелецПодразделения
	//|		ИНАЧЕ Диадок_ЮрФизЛица.ID
	//|	КОНЕЦ КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1"
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.OrganizationId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	//
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Контрагент);
	//Пакет.ДанныеДД.CounteragentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////1. По Организации оперделяем FromDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|ГДЕ
	//|	Диадок_ЮрФизЛица.СвязанныйСправочник1 = &СвязанныйСправочник1
	//|	И Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияОрганизаций"""
	//);
	//Запрос.УстановитьПараметр("СвязанныйСправочник1", Пакет.Данные1С.Организация);
	//Пакет.ДанныеДД.FromDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	
	////2. По Договору оперделяем ToDepartmentId
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	Диадок_ЮрФизЛица.ID КАК ID
	//|ИЗ
	//|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК спрДоговорыКонтрагентов
	//|		ПО (спрДоговорыКонтрагентов.Ссылка = &ТекущийДоговор)
	//|			И Диадок_ЮрФизЛица.СвязанныйСправочник2 = спрДоговорыКонтрагентов.Родитель
	//|			И (Диадок_ЮрФизЛица.СвязанныйСправочник2 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	//|			И (Диадок_ЮрФизЛица.ИмяСправочника = ""ПодразделенияКонтрагентов"")"
	//);
	//Запрос.УстановитьПараметр("ТекущийДоговор", Пакет.Данные1С.Документ.ДоговорКонтрагента);
	//Пакет.ДанныеДД.ToDepartmentId = ОсновнойМодуль.ЭДО_Служебные_ПолучитьРезультатЗапроса(Запрос, "ID");
	
	Возврат Истина;
	
КонецФункции

// После отправки пакета в ДД, когда пакету и документам присвоены ID
Функция ПослеОтправкиПакета(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Otpravki_Paketa.html
	
	Пакет = Параметры.Пакет;
	
	Возврат Истина;
	
КонецФункции

// Получение реквизитов документов пакета для вывода в список на отправку, 
// при включенной настройке "Разворачивать пакеты на отправку по документам"
Функция ЗаполнитьРеквизитыДокумента(Параметры)
	
	ДокументУчета	= Параметры.Документ.ДокументУчета;
	Реквизиты		= Параметры.Документ.Реквизиты;
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЕстьСуммаДокумента = ДокументУчета.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено;
	
	Если ЕстьСуммаДокумента Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", СуммаДокумента";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОсновнойМодуль.Общее_ЗначенияРеквизитовОбъекта(ДокументУчета, ИменаРеквизитов);
	
	Реквизиты.Номер	= СокрЛП(ЗначенияРеквизитов.Номер);
	Реквизиты.Дата = ЗначенияРеквизитов.Дата;
	
	Если ЕстьСуммаДокумента Тогда
		Реквизиты.Сумма	= ЗначенияРеквизитов.СуммаДокумента;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// ВХОДЯЩИЕ ////////////////
///////////////////////////////////////


// Поиск документа из 1С, соответствующего электронному документу в ДД
Функция НайтиСопоставлениеДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nayti_Sopostavleniye_Dokumenta.html
	
	Результат = Неопределено;
	
	Документ = Параметры.Документ;
	
	ТипДокумента = Документ.Тип;
	ФункцияДокумента = Документ.Тип.ФункцияДокумента;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ФункцияДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	Документ.Реквизиты.Дата);
	ПараметрыОтбора.Вставить("НомерДокумента",	Документ.Реквизиты.Номер);
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(Документ.Тип)
		ИЛИ ОсновнойМодуль.ЭтоПередаточныйДокумент(Документ.Тип) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если Результат = Неопределено Тогда
			Результат = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента)
		ИЛИ ОсновнойМодуль.ЭтоКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "КорректировкаПоступления");
		
	ИначеЕсли ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетНаОплату(ТипДокумента) И (ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА()) Тогда
		
		Результат = ПолучитьДокументы1С(ПараметрыОтбора, "СчетНаОплатуПоставщика");
		
	ИначеЕсли ЭтоФормализованныйАктСверки405(ТипДокумента) Тогда
		
		Организация = Документ.Получатель.Организация;
		Контрагент = Документ.Отправитель.Организация;
		НачалоПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.BeginDate);
		ОкончаниеПериодаСверки = Общее_СтрокаВДату(Документ.Метаданные.EndDate);
		
		Результат = НайтиАктыСверкиВзаиморасчетов(
			Организация,
			Контрагент,
			НачалоПериодаСверки,
			ОкончаниеПериодаСверки
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФормализованныйАктСверки405(ТипЭД)
	
	Результат = НРег(ТипЭД.ТипДокумента) = НРег("ReconciliationAct")
				И НРег(ТипЭД.ТипКонтента) = НРег("reconciliationact405");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиАктыСверкиВзаиморасчетов(Организация, Контрагент, НачалоПериодаСверки, ОкончаниеПериодаСверки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериодаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_НайтиАктыСверкиВзаиморасчетов()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументАктСверки.Ссылка
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДокументАктСверки
	|ГДЕ
	|	НЕ ДокументАктСверки.ПометкаУдаления
	|	И ДокументАктСверки.Организация = &Организация
	|	И ДокументАктСверки.Контрагент = &Контрагент
	|	И ДокументАктСверки.ДатаНачала = &ДатаНачала
	|	И ДокументАктСверки.ДатаОкончания = &ДатаОкончания";
	
	Возврат Результат;
	
КонецФункции

// Получает список операций, которые доступны при отражении электронного документа в учете.
//
// Параметры:
//  ПараметрыСобытия - Структура - содержит параметры:
//    * Документ - Структура - описание электронного документа (см. Ядро.Контракт_Документ);
// 
// Возвращаемое значение:
//  СписокЗначений - содержит идентификаторы учетных операций и их представления.
//
Функция СписокТиповДокументовДляСоздания(ПараметрыСобытия)
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СписокТиповДокументовДляСоздания(
		НеИспользуется_ТиповойМодуль,
		НеИспользуется_РежимУправляемыхФорм,
		ПараметрыСобытия
	);
	
	Возврат Результат;
	
КонецФункции

// Создание документа по данным из Диадока
Функция ПолучитьЗаполненныйОбъектДокумента1С(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Zapolnennyy_Obyekt_Dokumenta_1S.html
	
	Ошибки = Новый Массив;
	
	Документ = Параметры.Документ;
	
	ИспользоватьДатуЭД = Параметры.ИспользоватьДатуЭлектронногоДокумента;
	ОтключитьПроверкуСопоставленияНоменклатуры = Параметры.ОтключитьПроверкуСопоставленияНоменклатуры;
	
	ПроверитьФункциюДокумента(Параметры, Ошибки);
	ПроверитьЗаполнитьИдентификаторОперации(Параметры, Ошибки);
	ПроверитьЗаполнитьДокументОснование(Параметры, Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОсновнойМодуль.ТиповойМодуль_СоздатьДокумент(НеИспользуется_ТиповойМодуль, Параметры);
	
	НовыйОбъект = Результат.ОсновнойОбъект;
	
	Ошибки = ЗначениеВМассивЛок(Результат.ОписаниеОшибки);
	
	ПроверитьЗаполнениеДокумента(НовыйОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат = РезультатФункцииОшибка(Ошибки);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ИспользоватьДатуЭД
		И НЕ ЭтоФормализованныйАктСверки405(Документ.Тип) Тогда
		
		ДатаДокумента = Документ.Реквизиты.Дата;
		ТекущаяДатаДокумента = НовыйОбъект.Дата;
		НовыйОбъект.Дата = ДатаДокумента;
		Если Год(ДатаДокумента) <> Год(ТекущаяДатаДокумента) Тогда
			НовыйОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.СоздаватьСчетаФактуры Тогда
		
		СоздатьСчетФактуру(НовыйОбъект, Документ, ИспользоватьДатуЭД);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет в таблице сопоставления колонки со сведениями о номенклатуре информационной базы:
// * Номенклатура
// * Характеристика
// * Упаковка
//
// Параметры:
//  ПараметрыПМ - Структура - параметры события:
//    * ТаблицаСопоставления - ТаблицаЗначений - таблица сопоставления номенклатуры (см. НоваяТаблицаНоменклатурыДляСопоставления).
//
Функция ПрочитатьСопоставлениеНоменклатуры(ПараметрыПМ)
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	
	ТаблицаНоменклатурыДляСопоставления = ПараметрыПМ.ТаблицаСопоставления;
	
	ОсновнойМодуль.ТиповойМодуль_ПрочитатьСопоставлениеНоменклатуры(ТаблицаНоменклатурыДляСопоставления, НеИспользуется_ТиповойМодуль);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ отдельно взятого входящего документа
Функция ПровестиАнализДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Provesti_Analiz_Dokumenta.html
	
	Результат = Параметры.РезультатАнализа; // шаблон результата анализа приходит в этом параметре - надо только заполнить его поля
	
	ДокументДД	= Параметры.ДокументДД;
	ПакетДД		= Параметры.ПакетДД;
	
	Ошибки		= Новый Массив;
	Документ1С	= Неопределено;
	
	СтруктураДанных = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД, ПакетДД);
	
	ТипДокумента = НРег(СтруктураДанных.ТипДокумента);
	ТипКонтента = НРег(СтруктураДанных.ТипКонтента);
	ФункцияДокумента = НРег(СтруктураДанных.ФункцияДокумента);
	
	Контрагент	= СтруктураДанных.Контрагент;
	Организация	= СтруктураДанных.Организация;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда			
		Сообщить("Не указано соответствие контрагента для входящего документа: " + ДокументДД);
		Возврат Неопределено; //пропускаем анализ: ждем сопоставления контрагента			
	КонецЕсли;
	
	
	// Выполним сопоставление документа
	МассивДокументов1С = ОсновнойМодуль.НайтиСопоставлениеДокумента(Параметры.Документ);
	
	Если ТипЗнч(МассивДокументов1С) = Тип("Массив") И МассивДокументов1С.Количество() = 1 Тогда
		Документ1С = МассивДокументов1С[0];
	КонецЕсли;
	
    // НАКЛАДНЫЕ
	Если ТипДокумента = "xmltorg12" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда		
		
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найдена накладная №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));
		Иначе			
			ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Ошибки);					
		КонецЕсли;		
		
	// СЧЕТА-ФАКТУРЫ
	ИначеЕсли ТипДокумента = "invoice" 
		ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда		
						
		Если НЕ ЗначениеЗаполнено(Документ1С) Тогда			
			Ошибки.Добавить("Не найден счет-фактура №: " + СтруктураДанных.НомерДокумента + " от " + Формат(СтруктураДанных.ДатаДокумента, "ДФ=dd.MM.yyyy") + " на сумму " + Формат(СтруктураДанных.СуммаДокумента, "ЧДЦ=2"));			
		КонецЕсли;
		
		ТипКонтентаУПД = (ТипКонтента = "utd" ИЛИ ТипКонтента = "utd820" ИЛИ ТипКонтента = ТипКонтентаUtd970());
		
		Если ТипДокумента = "invoice" И НЕ ТипКонтентаУПД Тогда
			Ошибки.Добавить("Счет-фактура в старом формате.");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("ДокументДляСопоставления", Документ1С);
	Результат.Вставить("Ошибки", Ошибки);	
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("ДействиеВ1С", "Выполнить анализ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается действием "Выполнить анализ пакета": сначала для каждого документа выполняется событие ПровестиАнализДокумента, потом ПослеАнализаПакета
Функция ПослеАнализаПакета(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Analiza_Paketa.html

	Пакет			= Параметры.Пакет;	
	ДокументыПакета	= Параметры.ДокументыПакета;
	
	ДокументыПакета.Колонки.Добавить("ДанныеДокумента");
	
	СуммаНакладной 					= Неопределено;
	СуммаСчетаФактуры 				= Неопределено;
	ЕстьНесопоставленныеДокументы 	= Ложь;	
	ЕстьКритичнаяОшибкаПакета 		= Ложь;
	
	Ошибки = Новый Массив;
	
	// 1. Анализ всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ТекДокумент.Ссылка, Пакет);
		ТекДокумент.ДанныеДокумента = ДанныеДокумента;
		
		ДокументДД = ТекДокумент.Ссылка;
		ТипДокумента = НРег(ДанныеДокумента.ТипДокумента);
		ФункцияДокумента = НРег(ДанныеДокумента.ФункцияДокумента);
		
		//ошибки, выявленные при выполнении события ПровестиАнализДокумента, распространяем на весь пакет
		Если ЗначениеЗаполнено(ДанныеДокумента.ТекстОшибки) Тогда
			Ошибки.Добавить(ДанныеДокумента.ТекстОшибки);
		КонецЕсли;
		
		Если ТипДокумента = "xmltorg12" 
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "basic")) Тогда
		    СуммаНакладной = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
		
		Если ТипДокумента = "invoice"
			ИЛИ (ТипДокумента = "universaltransferdocument" И (ФункцияДокумента = "invoiceandbasic" ИЛИ ФункцияДокумента = "invoice")) Тогда
			СуммаСчетаФактуры = ДанныеДокумента.СуммаДокумента;
		КонецЕсли;
						
		Если (ТипДокумента = "xmltorg12" ИЛИ ТипДокумента = "invoice" ИЛИ ТипДокумента = "universaltransferdocument")
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
			ЕстьНесопоставленныеДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// 2. Интерпретация ошибок
	
	Если СуммаНакладной = Неопределено Тогда
		Ошибки.Добавить("Нет накладной.");
	КонецЕсли;
	
	Если СуммаСчетаФактуры = Неопределено Тогда
		Ошибки.Добавить("Нет счета-фактуры.");
	КонецЕсли;
	
	Если СуммаНакладной <> Неопределено И СуммаСчетаФактуры <> Неопределено И СуммаНакладной <> СуммаСчетаФактуры Тогда
		Ошибки.Добавить("Не совпадают суммы счета-фактуры и первичного документа.");
		//ЕстьКритичнаяОшибкаПакета = Истина; //иногда в СФ могут не включать позиции без НДС, Тогда несовпадение сумм приемлемо
	КонецЕсли;
		
	ТекстВсехОшибокПакета = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Ошибки, Символы.ПС);
	
	ЕстьКритичнаяОшибкаПакета = (ЕстьКритичнаяОшибкаПакета 
								ИЛИ Найти(ТекстВсехОшибокПакета, "ДУБЛИКАТ") <> 0
								ИЛИ Найти(ТекстВсехОшибокПакета, "Счет-фактура в старом формате") <> 0);
	
	//ОшибокНет = (СокрЛП(ТекстВсехОшибокПакета) = ""); //самый жесткий вариант выполнения анализа пакета
	ОшибокНет = НЕ ЕстьКритичнаяОшибкаПакета;           //менее жесткий вариант выполнения анализа пакета
	
	
	// 3. Формирование контента ответа всех документов пакета
	
	Для Каждого ТекДокумент Из ДокументыПакета Цикл
		
		ДанныеДокумента = ТекДокумент.ДанныеДокумента;
		
		ДокументДД	= ТекДокумент.Ссылка;		
		Документ1С	= ДанныеДокумента.ДокументВ1С;
		ТекстОшибки	= ДанныеДокумента.ТекстОшибки;
		
		НеИзменятьДействиеВДД = ЗначениеЗаполнено(ДанныеДокумента.ТребуемоеДействиеВДД)
								И ДанныеДокумента.ТребуемоеДействиеВДД <> "Подписать";
		
		Если НеИзменятьДействиеВДД ИЛИ Не ЗначениеЗаполнено(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
						
		РезультатАнализа = ОсновнойМодуль.ЭДО_НовыйРезультатАнализаВходящегоДокумента();
		
		РезультатАнализа.Ошибки = ТекстОшибки; // сохраняем ошибки, относящиеся только к текущему документу
		//РезультатАнализа.Ошибки = ТекстВсехОшибокПакета; // сохраняем ошибки всего пакета для каждого документа из пакета
		
		СписокДействийТекДокумента = ОсновнойМодуль.ЭДО_ВариантыОтветныхДействийПоДокументу(ДокументДД, ОшибокНет);		
		РезультатАнализа.ДействиеВДД = ?(СписокДействийТекДокумента.Количество() = 0, "", СписокДействийТекДокумента[0].Значение);
				
		Если ЗначениеЗаполнено(РезультатАнализа.ДействиеВДД) Тогда						
			РезультатАнализа.Вставить("КонтентОтвета", ПолучитьКонтентОтвета(ДокументДД, Документ1С, РезультатАнализа.ДействиеВДД, ТекстВсехОшибокПакета));			
		КонецЕсли;
		
		РезультатАнализа.Вставить("ДокументДляСопоставления", Документ1С);
		ОсновнойМодуль.СохранитьРезультатАнализа(ДокументДД, РезультатАнализа);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьТребуемоеДействие(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Trebuyemoye_Deystviye.html
	
	ДокументДД 	= Параметры.ДокументДД;
	ПакетДД 	= Параметры.ПакетДД;
	
	ДанныеДокумента = ОсновнойМодуль.ЭДО_ПолучитьРеквизитыДокумента(ДокументДД);
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(Параметры.Документ.Тип.ФункцияДокумента) Тогда
		ПредставлениеДокумента = ОсновнойМодуль.ЭДО_ПолучитьПредставлениеДокумента(ДокументДД);
		ТекстИсключения = "Не удалось выполнить действие над документом: " + ПредставлениеДокумента;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ДанныеДокумента.ТребуемоеДействиеВ1С = "ПровестиДокумент" И ЗначениеЗаполнено(ДанныеДокумента.ДокументВ1С) Тогда
		
		Документ1СОбъект = ДанныеДокумента.ДокументВ1С.ПолучитьОбъект();
		Документ1СОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ОсновнойМодуль.ЭДО_ЗаписатьРеквизитыДокумента(ДокументДД, Новый Структура("ТребуемоеДействиеВ1С", "")); // отработали действие
		
	КонецЕсли;		
	
	Возврат Истина;
	
КонецФункции

Функция ПравилаСопоставленияДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pravila_Sopostavleniya_Dokumenta.html
	
	Результат = Новый Структура;
	
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	
	ТипДокумента 		= РеквизитыДокумента.ТипДокумента;
	ФункцияДокумента	= РеквизитыДокумента.ФункцияДокумента;
	Организация			= РеквизитыДокумента.Организация;
	Контрагент			= РеквизитыДокумента.Контрагент;
	
	ОрганизацияДиадок 	= РеквизитыДокумента.ОрганизацияДиадок;
	ОрганизацияДиадокID = РеквизитыДокумента.ОрганизацияДиадокID;
	КонтрагентДиадок 	= РеквизитыДокумента.КонтрагентДиадок;
	КонтрагентДиадокID 	= РеквизитыДокумента.КонтрагентДиадокID;
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(ОрганизацияДиадок, ОрганизацияДиадокID);
	СопоставленныеОрганизации1С = ОсновнойМодуль.ЭДО_Организации_СопоставленныеВ1С(Идентификаторы);
	
	Идентификаторы = ОсновнойМодуль.ЭДО_Новый_ИдентификаторыСправочника(КонтрагентДиадок, КонтрагентДиадокID);
	СопоставленныеКонтрагенты1С = ОсновнойМодуль.ЭДО_Контрагенты_СопоставленныеВ1С(Идентификаторы);
	
	ВозможныеВидыЭДО	= ОсновнойМодуль.ЭДО_ВидыЭлектронныхДокументовПоФорматуЭДО(ТипДокумента, ФункцияДокумента);
	ВидыЭДО				= ОсновнойМодуль.ЭДО_Перечисление_ВидыЭДО();

	Отбор = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
	
	Для Каждого ВидЭДО Из ВозможныеВидыЭДО Цикл
		
		Если ВидЭДО = ВидыЭДО.Накладная Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеИзПереработки",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ВозвратТоваровОтПокупателя",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПолучениеУслугПоПереработке", Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Акт ИЛИ ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслуг",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеТоваровУслугВНТТ", Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеИзПереработки",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПолучениеУслугПоПереработке", Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеДопРасходов",		Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ОтчетКомиссионераОПродажах",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ПоступлениеНМА",				Отбор);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.СчетФактура Тогда
			
			ОтборСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаПоступление"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
			
			Если Метаданные.Перечисления.ВидСчетаФактурыПолученного.ЗначенияПеречисления.Найти("НаАвансКомитента") <> Неопределено Тогда
				// отсутствует в УПП 1.3
				ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента"));
			КонецЕсли;
			
			ОтборСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора); 
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочныйСчетФактура Тогда
			
			ОтборКоррСФ = Новый Структура("Организация, Контрагент", СопоставленныеОрганизации1С, СопоставленныеКонтрагенты1С);
			
			ЗначенияОтбора = Новый Массив;
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.Корректировочный"));
			ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс"));
			
			ОтборКоррСФ.Вставить("ВидСчетаФактуры", ЗначенияОтбора);
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетФактураПолученный", ОтборКоррСФ);
			
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.КорректировочнаяНакладная Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "КорректировкаПоступления", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.АктСверки Тогда
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "АктСверкиВзаиморасчетов", Отбор);
		КонецЕсли;
		
		Если ВидЭДО = ВидыЭДО.Счет Тогда
			
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "СчетНаОплатуПоставщика",	Отбор);
			ОсновнойМодуль.ЭДО_ДобавитьПравилоСопоставленияДокумента(Результат, "Документы", "ЗаказПоставщику",			Отбор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтборСопоставленияНоменклатуры(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Otbor_Sopostavleniya_Nomenklatury.html
	
	Результат = Новый Структура;
	
	//Результат.Вставить("Ссылка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТаблицуСопоставленияНоменклатуры(Параметры)
	
	ВладелецНоменклатуры		= Параметры.Контрагент;
	НоменклатураКонтрагента		= Параметры.МассивНоменклатуры;
	РезультатСозданияДокумента	= Параметры.РезультатСозданияДокумента;
	
	Для Каждого Элемент Из НоменклатураКонтрагента Цикл
		
		НоменклатураКод = Элемент.Код;
		НоменклатураАртикул = Элемент.Артикул;
		НоменклатураНаименование = Элемент.Наименование;
		
		ДобавитьНоменклатуруДляСопоставления(
			РезультатСозданияДокумента,
			ВладелецНоменклатуры,
			НоменклатураНаименование,
			НоменклатураКод,
			НоменклатураАртикул
		);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////
///////////// КРИПТОГРАФИЯ ////////////
///////////////////////////////////////

// Возвращает зашифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые данные для шифрования.
//	Состав структуры:
//		ДвоичныеДанные 	   - ДвоичныеДанные - Файл документа.
//		МассивСертификатов - Массив			- Массив сертифкатов (см. результат метода ПолучитьСертификатыДляШифрования).
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Зашифрованный файл документа.
//
Функция ЗашифроватьДанные(Параметры)
	
	ДвоичныеДанные 	   = Параметры.ДвоичныеДанные;
	МассивСертификатов = Параметры.МассивСертификатов;
	
	ЗашифрованныеДвоичныеДанные = Неопределено;
	
	Возврат ЗашифрованныеДвоичныеДанные;
	
КонецФункции

// Возвращает расшифрованные данные документа
//
// Параметры:
//	Параметры - Структура - Содержит зашифрованный документ.
//	Состав структуры:
//		ЗашифрованныеДвоичныеДанные - ДвоичныеДанные - Зашифрованный файл документа.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Расшифрованный файл документа.
//
Функция РасшифроватьДанные(Параметры)
	
	ЗашифрованныеДвоичныеДанные = Параметры.ЗашифрованныеДвоичныеДанные;
	
	РасшифрованныеДанные = Неопределено;
	
	Возврат РасшифрованныеДанные;
	
КонецФункции

// Возвращает массив сертификатов для шифрования документов
//
// Параметры:
//	Параметры - Структура - Содержит информацию о пакете, который необходимо зашифровать.
//	Состав структуры:
//		Данные1С - Структура - Ссылки на объекты 1С
//		ДанныеДД - Структура - Ссылки на объекты Диадока
//
// Возвращаемое значение:
//	 Массив	- массив сертификатов.
// 	 Возможные типы элементов:
//	 	ДвичныеДанные - Файл сертификата в DER формате
//	 	Строка		  - Отпечаток установленного на компьютер сертификата
//
Функция ПолучитьСертификатыДляШифрования(Параметры)
	
	Данные1С = Параметры.Данные1С;
	ДанныеДД = Параметры.ДанныеДД;
	
	МассивСертификатов = Неопределено;
	
	Возврат МассивСертификатов;
	
КонецФункции

// Возвращает подпись документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для подписания.
//	Состав структуры:
//		ДвоичныеДанные		 - ДвоичныеДанные - Двоичные данные документа, который необходимо подписать.
//		ПарольКонтейнера	 - Строка 		  - Пин код от закрытой части установленного на компьютер сертификата.
//		ОтпечатокСертификата - Строка 		  - Отпечаток установленного на компьютер сертификата.
//
// Возвращаемое значение:
//	 ДвоичныеДанные	- Двоичные данные подписи документа.
//
Функция ПодписатьДанные(Параметры)
	
	ДвоичныеДанные 		 = Параметры.ДвоичныеДанные;
	ПарольКонтейнера	 = Параметры.ПарольКонтейнера;
	ОтпечатокСертификата = Параметры.ОтпечатокСертификата;
	
	ДвоичныеДанныеПодписи = Неопределено;
	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

// Возвращает результат проверки подписи документа
//
// Параметры:
//	Параметры - Структура - Содержит необходимые параметры для проверки подписи.
//	Состав структуры:
//		ДвоичныеДанные		  - ДвоичныеДанные - Двоичные данные документа.
//		ДвоичныеДанныеПодписи - ДвоичныеДанные - Двоичные данные подписи документа.
//
// Возвращаемое значение:
//	 Булево	- Результат проверки:
//		Истина - подпись соответствует документу.
//		Ложь   - подпись не соответствует документу.
//
Функция ПроверитьПодпись(Параметры)
	
	ДвоичныеДанные 		  = Параметры.ДвоичныеДанные;
	ДвоичныеДанныеПодписи = Параметры.ДвоичныеДанныеПодписи;
	
	ПодписьВерна = Неопределено;
	
	Возврат ПодписьВерна;
	
КонецФункции



///////////////////////////////////////
///////////// ПРОЧИЕ СОБЫТИЯ //////////
///////////////////////////////////////


// Выполняет регламентные действия, требующие инициализацию основного модуля
Функция ВыполнитьРегламентныеДействия(Параметры) Экспорт
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Vypolnit%27_Reglamentnyye_Deystviya.html
	
	Отказ = Ложь;
	
	Если Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		ЭтоЗапускСКлиента = Ложь;
		
		Если ТипЗнч(Параметры) = Тип("Структура")
			И Параметры.Свойство("ЗапускСКлиента") Тогда
			ЭтоЗапускСКлиента = Параметры.ЗапускСКлиента;
		КонецЕсли;
		
		ПрочитатьОбработатьЛентуСобытий(Отказ, ЭтоЗапускСКлиента);
		
	КонецЕсли;
	
	Результат = НЕ Отказ;
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьОбработатьЛентуСобытий(Отказ, СообщатьОбОшибках)
	
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись().Логин) Тогда
		
		Ошибки.Добавить("Не указана служебная учетная запись для выполнения регламентных действий");
		
	КонецЕсли;
	
	Если НЕ Ядро.ИспользоватьПодсистемуДиадока() Тогда
		
		Ошибки.Добавить("Чтение ленты событий используется только на объектах подсистемы Диадок");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Для Каждого Ошибка Из Ошибки Цикл
			
			ТекстСообщения = Неопределено;
			
			Если СообщатьОбОшибках Тогда
				ТекстСообщения = НСтр("ru='" + Ошибка + "'");
			КонецЕсли;
			
			ШаблонТекстаОшибки = НСтр(
				"ru='При обработке ленты событий в ИМ произошла ошибка:
				|%1'"
			);
			
			ВидОперации = "Ошибка обработки ленты событий";
			ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Ошибка);
			ДопИнформация = Неопределено;
			
			Ядро.Ошибка_Обработать(
				ВидОперации,
				ТекстОшибки,
				ДопИнформация,
				ТекстСообщения
			);
			
		КонецЦикла;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// АВТОРИЗАЦИЯ ПО ЛОГИНУ И ПАРОЛЮ 
	
	ОсновнойМодуль.ЭДО_АвторизоватьсяПодЛогином(УчетнаяЗапись().Логин, УчетнаяЗапись().Пароль);
	
	// ОБРАБОТКА СОБЫТИЙ ЛЕНТЫ, В Т.Ч. ЗАГРУЗКА НОВЫХ ДОКУМЕНТОВ
	
	КоличествоПорцийСобытий = 10; // Кол-во вычитываемых порций событий (каждая порция содержит не более 100 событий)
	
	Для Каждого СтрокаОрганизации Из ОсновнойМодуль.ЭДО_Модуль_ТаблицаОрганизацийПользователя() Цикл
		
		ОписаниеОрганизации = Новый Структура;
		ОписаниеОрганизации.Вставить("BoxID", СтрокаОрганизации.BoxID);
		ОписаниеОрганизации.Вставить("Наименование", СтрокаОрганизации.Наименование);
		ОписаниеОрганизации.Вставить("Ссылка", СтрокаОрганизации.Ссылка);
		
		ОсталосьСобытийВЛенте = ОсновнойМодуль.ЭДО_Модуль_ОбработатьНовыеСобытияДокументов(ОписаниеОрганизации, КоличествоПорцийСобытий);
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет регламентные действия, НЕ требующие инициализации основного модуля
Процедура ВыполнитьРегламентныеДействияПМ(Параметры) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи статуса документа при очередном обмене с сервером Диадока
Функция ПослеУстановкиСтатусаДокумента(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Ustanovki_Statusa_Dokumenta.html
	
	ДокументДД	= Параметры.ДокументДД;
	Статус		= Параметры.Статус;
	
	// Можно установить какие-то признаки в 1С, когда ДокументДД перешел в определенный Статус 
	
	Возврат Истина;
	
КонецФункции

// Определение доп. колонок списка документов/пакетов (не более 5 штук)
Функция ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Nastroyki_Dopolnitel%27nykh_Kolonok_Spiska_Dokumentov.html

	Режим = Параметры.Режим;
	
	Результат = Новый Массив; // не более 5. Индекс элемента в массиве, увеличенный на единицу, совпадает с порядковым номером колонки
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//			
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Состояние документа 1С", Новый ОписаниеТипов("Строка")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Сумма в 1С", Новый ОписаниеТипов("Число")));
	//	Результат.Добавить(Новый Структура("Заголовок, Тип, ДопустимыеЗначения", "Расхождение", Новый ОписаниеТипов("Число")));
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчики заполнения доп. колонок, которые задали в ПолучитьНастройкиДополнительныхКолонокСпискаДокументов
Функция ПослеОбновленияСпискаДокументов(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obnovleniya_Spiska_Dokumentov.html
	
	СписокДокументов	= Параметры.СписокДокументов;
	Режим				= Параметры.Режим;
	
	//Если Режим = "ПолученныеДокументы" Тогда
	//	
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	Парам.НомерСтроки,
	//	|	ВЫРАЗИТЬ(Парам.СуммаДокумента КАК ЧИСЛО) КАК СуммаДокументаДД,
	//	|	ВЫРАЗИТЬ(Парам.Документ КАК Документ.ПоступлениеТоваровУслуг) КАК Документ1С
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&СписокДокументов КАК Парам
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.НомерСтроки,
	//	|	ВЫБОР
	//	|		КОГДА ВТ.Документ1С ССЫЛКА Документ.ПоступлениеТоваровУслуг
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).ПометкаУдаления
	//	|						ТОГДА ""Удален""
	//	|					КОГДА НЕ ВЫРАЗИТЬ(ВТ.Документ1С КАК Документ.ПоступлениеТоваровУслуг).Проведен
	//	|						ТОГДА ""Не проведен""
	//	|					ИНАЧЕ """"
	//	|				КОНЕЦ
	//	|		ИНАЧЕ """"
	//	|	КОНЕЦ КАК СостояниеДокумента,
	//	|	ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК СуммаДокумента1С,
	//	|	ВТ.СуммаДокументаДД - ЕСТЬNULL(ВТ.Документ1С.СуммаДокумента, 0) КАК Расхождение
	//	|ИЗ
	//	|	ВТ КАК ВТ"
	//	);
	//	
	//	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить( ,"НомерСтроки, Документ, СуммаДокумента"));
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит1 = Выборка.СостояниеДокумента;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит2 = Выборка.СуммаДокумента1С;
	//		СписокДокументов[Выборка.НомерСтроки - 1].ДопРеквизит3 = Выборка.Расхождение;
	//	КонецЦикла;
	//	
	//	Возврат ПолучитьНастройкиДополнительныхКолонокСпискаДокументов(Новый Структура("Режим", Режим));
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Определение доп. кнопок в меню "Действия" основной формы
Функция ЗаполнитьСписокДополнительныхКнопок(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Zapolnit%27_Spisok_Dopolnitel%27nykh_Knopok.html
	
	РежимОтображенияДокументов	= Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
	ТаблицаКнопок				= Параметры.ТаблицаКнопок;
	
	//Если РежимОтображенияДокументов = "ПолученныеДокументы" Тогда
	//	
	//	НовСтрока = ТаблицаКнопок.Добавить();
	//	НовСтрока.Имя		= "ИмяДополнительнойКнопки";
	//	НовСтрока.Заголовок	= "Представление кнопки в меню";
	//	НовСтрока.ИмяФормы	= "ФормаПакета";
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчики нажатия доп. кнопок, которые задали в ЗаполнитьСписокДополнительныхКнопок 
Функция НажатиеДополнительнойКнопки(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Nazhatiye_Dopolnitel%27noy_Knopki.html
	
	ИмяФормыВызова = Параметры.ИмяФормы;
	ИмяКнопки = Параметры.ИмяКнопки;
	ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
	
	Если ИмяФормыВызова = "Форма" Тогда
		
		// нажатие дополнительной кнопки в основной форме
		
		РежимОтображенияДокументов = Параметры.РежимОтображенияДокументов; // ОтправкаПакетов / ОтправленныеДокументы / ПолученныеДокументы / ПолученныеПакеты
		ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
		
	ИначеЕсли ИмяФормыВызова = "ФормаПакета" Тогда
		
		// нажатие дополнительной кнопки из формы пакета
		
		Пакет = Параметры.Пакет;
		Документ = Параметры.Документ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Используется для списка контрагентов в основном модуле для режима "Поиск и приглашение"
Функция ПолучитьКоличествоДокументовЗаПериод(Параметры)

	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Poluchit%27_Kolichestvo_Dokumentov_Za_Period.html
	
	МассивКонтрагентов	= Параметры.МассивКонтрагентов;
	ОрганизацияВ1С		= Параметры.Организация;
	
	СоответствиеДокументыЗаПериод = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов",	МассивКонтрагентов);
	Запрос.УстановитьПараметр("ДатаНачала",			ДобавитьМесяц(КонецДня(ТекущаяДата()), -3));
	Запрос.УстановитьПараметр("Организация",		ОрганизацияВ1С);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Контрагент КАК Связь1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Ссылка) КАК ДокументовЗаПериод
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И РеализацияТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслуг.Ссылка)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНачала
	|	И ПоступлениеТоваровУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслуг.Контрагент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктОбОказанииПроизводственныхУслуг.Ссылка)
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Проведен = ИСТИНА
	|	И АктОбОказанииПроизводственныхУслуг.Организация = &Организация
	|	И АктОбОказанииПроизводственныхУслуг.Дата >= &ДатаНачала
	|	И АктОбОказанииПроизводственныхУслуг.Контрагент В(&МассивКонтрагентов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОбОказанииПроизводственныхУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Связь1,
	|	СУММА(ВТ_Документы.ДокументовЗаПериод) КАК ДокументовЗаПериод
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Связь1";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // КоличествоДокументовЗаПериод()

Функция ПослеОбработкиЛентыСобытий(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Posle_Obrabotki_Lenty_Sobytiy.html
	
	ПараметрыСервиса			 = Параметры.ПараметрыСервиса;
	ИдентификаторыДокументов	 = Параметры.ИдентификаторыДокументов;
	
	//Для Каждого СтруктураИдентификаторов Из ИдентификаторыДокументов Цикл
	//	
	//	Если ЗначениеЗаполнено(СтруктураИдентификаторов.ДокументЭДО) Тогда
	//		ДокументЭДО = СтруктураИдентификаторов.ДокументЭДО;
	//	Иначе
	//		
	//		BoxId		 = СтруктураИдентификаторов.BoxId;
	//		LetterId	 = СтруктураИдентификаторов.LetterId;
	//		DocumentId	 = СтруктураИдентификаторов.DocumentId;
	//		
	//		ДокументЭДО = ОсновнойМодуль.ЭДО_Диадок_Документы_ПолучитьДокумент(BoxId, LetterId, DocumentId);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПриОткрытииФормы(Параметры)
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Otkrytii_Formy.html
	
	Форма		= Параметры.Форма;
	ИмяФормы	= Параметры.ИмяФормы;
	
	// Пример для снятия флажков у всех видов пакетов на отправку
	
	//Если ИмяФормы = "ОсновнаяФорма" Тогда
	//
	//	ДеревоФильтров = Форма.ДеревоФильтров;
	//	
	//	СтрокаОтправкаПакетов = ДеревоФильтров.Строки.Найти("ОтправкаПакетов");
	//	
	//	Если СтрокаОтправкаПакетов <> Неопределено Тогда
	//		
	//		Для Каждого СтрокаВидыПакетов Из СтрокаОтправкаПакетов.Строки Цикл
	//			СтрокаВидыПакетов.Пометка = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриПолученииДанныхТабличнойЧасти(Параметры) Экспорт 
	
	//https://developer.kontur.ru/Docs/Diadoc_UM/func/Pri_Poluchenii_Dannykh_Tablichnoy_Chasti.html
	
	Форма			 = Параметры.Форма;
	ИмяФормы		 = Параметры.ИмяФормы;
	Элемент			 = Параметры.Элемент;
	ОформленияСтрок	 = Параметры.ОформленияСтрок;
	
	//Для Каждого Эл Из ОформленияСтрок Цикл
	//	
	//	Если Эл.ДанныеСтроки.НомерСтроки % 2 = 0 Тогда
	//		Эл.Ячейки.Документ.ЦветФона	= WebЦвета.Аквамарин;
	//		Эл.ЦветФона					= WebЦвета.Древесный;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//} СОБЫТИЯ ПОДКЛЮЧАЕМОГО МОДУЛЯ


//****************************************************************************
//{ ПРЯМЫЕ ВЫЗОВЫ ИМ

// Типовой обработчик события "ПолучитьТаблицуИспользуемыхПакетов"
//
// Параметры:
//  ТЗ - ТаблицаЗначений - см. МенеджерИнтеграции.ПоставляемыеВидыПакетов
//
Процедура ЗаполнитьСписокПоставляемыхПакетов(ТЗ) Экспорт
	
	КатегорииПакетов = КатегорииПакетов();
	
	ОсновнойПакет			= КатегорииПакетов.ОсновнойПакет;
	КорректировочныйПакет	= КатегорииПакетов.КорректировочныйПакет;
	СчетФактураНаАванс		= КатегорииПакетов.СчетФактураНаАванс;
	СчетНаОплату			= КатегорииПакетов.СчетНаОплату;
	АктCверки				= КатегорииПакетов.АктCверки;
	БезКатегории			= КатегорииПакетов.БезКатегории;
	ВнутренниеПеремещения	= КатегорииПакетов.ВнутренниеПеремещения;
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД",					"УПД",								"ID_УПД, ID_УПД_ДОП",								ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ОсновнойПакет",		"СФ + ТОРГ12/Акт",					"ID_АктФормализованный, ID_ТОРГ12, ID_СчетФактура",	ОсновнойПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_раздельно",		"УПД СЧФ + УПД ДОП",				"ID_УПД_СЧФ, ID_УПД_ДОП",							ОсновнойПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД",					"УКД",								"ID_УКД",											КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_раздельно",		"УКД КСЧФ + УКД ДИС",				"ID_УКД_КСЧФ, ID_УКД_ДИС",							КорректировочныйПакет);
	ДобавитьСтрокуТЗ(ТЗ, "ID_КСФ",					"КСФ",								"ID_КСФ",											КорректировочныйПакет);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_СФ_НаАванс",			"СФ (на аванс)",					"ID_СчетФактура",									СчетФактураНаАванс);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_НаАванс",			"УПД СЧФ (на аванс)",				"ID_УПД_СЧФ",										СчетФактураНаАванс);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_Счет",					"Счет (неформализованный)",			"ID_Счет",											СчетНаОплату);
	ДобавитьСтрокуТЗ(ТЗ, "ID_СчетФормализованный",	"Счет (Диадок)",					"ID_СчетФормализованный",							СчетНаОплату);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_АктСверки",			"Акт сверки",						"ID_АктСверки",										АктCверки);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД",					"УПД (исправление)",				"ID_ИУПД",											БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_раздельно",		"УПД СЧФ + УПД ДОП (исправление)",	"ID_ИУПД_СЧФ, ID_УПД_ДОП",							БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ",					"СФ (исправление)",					"ID_ИСФ",											БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД",					"УКД (исправление)",				"ID_ИУКД",											БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУКД_раздельно",		"УКД КСЧФ + УКД ДИС (исправление)",	"ID_ИУКД_КСЧФ, ID_ИУКД_ДИС",						БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИКСФ",					"КСФ (исправление)",				"ID_ИКСФ",											БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_НаАванс",			"УПД (исправление на аванс)",		"ID_ИУПД_СЧФ",										БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИСФ_НаАванс",			"СФ (исправление на аванс)",		"ID_ИСФ",											БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_ТОРГ12_Акт_БезНДС",	"ТОРГ12/Акт (без СФ)",				"ID_АктФормализованный, ID_ТОРГ12",					БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_БезНДС",			"УПД ДОП (без СФ)",					"ID_УПД_ДОП",										БезКатегории);
	ДобавитьСтрокуТЗ(ТЗ, "ID_ИУПД_БезНДС",			"УПД ДОП (исправление без СФ)",	"ID_ИУПД_ДОП",											БезКатегории);

	ДобавитьСтрокуТЗ(ТЗ, "ID_УКД_БезНДС",			"УКД ДИС (без СФ)",				"ID_УКД_ДИС",											БезКатегории);
	
	ДобавитьСтрокуТЗ(ТЗ, "ID_УПД_ВНУТР",			"УПД (перемещение)",				"ID_УПД_ВНУТР",										ВнутренниеПеремещения);
	
	ЗаполнитьНаименованияКатегорийПакетов(ТЗ);
	УстановитьПакетамПризнакВнутреннегоДО(ТЗ);
	
КонецПроцедуры

// Типовой обработчик события "ПодготовитьДанныеДляОтправкиВнутреннихДокументов"
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив из Строка - имена добавленных временных таблиц
//
Функция ВнутренниеДокументыСлужебный_ПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Если ВидПакетаID <> "ID_УПД_ВНУТР" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПеремещениеТоваров) Тогда
		ИмяВТ = ДобавитьТаблицу_ПеремещениеТоваров(Запрос);
		Результат.Добавить(ИмяВТ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается из МодульМенеджер.ЗначенияПолейМаршрутизацииПоПодразделениям.
// Переопределяет получение значений полей маршрутизации по документу 1С
//
// Параметры:
//	ПоляОтправителя		- Массив 			- значения полей маршрутизации в подразделение отправителя
//	ПоляПолучателя		- Массив 			- значения полей маршрутизации в подразделение получателя
//	Документ1С			- ДокументСсылка 	- документ пакета, для которого определяются значения полей
Процедура ЗаполнитьЗначенияПолейМаршрутизацииПоПодразделениям(ПоляОтправителя, ПоляПолучателя, Документ1С) Экспорт
	
	ТипСсылки = ТипЗнч(Документ1С);
	
	ЭтоСчетФактураВыданный = (ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Если ЭтоСчетФактураВыданный Тогда
		
		ОснованияСФ = ДокументыОснованияСчетаФактуры(Документ1С);
		
		Если ОснованияСФ.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИсточникДанных = ОснованияСФ[0];
		
	Иначе
		ИсточникДанных = Документ1С;
	КонецЕсли;
	
	МетаданныеИсточникаДанных = ИсточникДанных.Метаданные(); 
	
	// ИМ БП 20 содержит интеграционную часть для конфигураций: "БухгалтерияПредприятия", "УправлениеПроизводственнымПредприятием",
	// "КомплекснаяАвтоматизация". В некоторых конфигурациях реквизит "Подразделение" может отсутствовать, либо иметь другое наименование
	ИмяРеквизитаПодразделение = "ПодразделениеОрганизации";
	ЕстьРеквизитПодразделение = ЕстьРеквизитОбъектаЛок(ИмяРеквизитаПодразделение, МетаданныеИсточникаДанных);
	
	Если Не ЕстьРеквизитПодразделение Тогда
		ИмяРеквизитаПодразделение = "Подразделение";
		ЕстьРеквизитПодразделение = ЕстьРеквизитОбъектаЛок(ИмяРеквизитаПодразделение, МетаданныеИсточникаДанных);
	КонецЕсли;
	
	ЕстьРеквизитОрганизация			= ЕстьРеквизитОбъектаЛок("Организация", МетаданныеИсточникаДанных);
	ЕстьРеквизитКонтрагент			= ЕстьРеквизитОбъектаЛок("Контрагент", МетаданныеИсточникаДанных);
	ЕстьРеквизитДоговорКонтрагента	= ЕстьРеквизитОбъектаЛок("ДоговорКонтрагента", МетаданныеИсточникаДанных);
	
	ИменаРеквизитов = Новый Массив;
	
	Если ЕстьРеквизитПодразделение Тогда
		ИменаРеквизитов.Добавить(ИмяРеквизитаПодразделение);
	КонецЕсли;
	
	ЕстьРеквизитСкладОтправитель = ЕстьРеквизитОбъектаЛок("СкладОтправитель", МетаданныеИсточникаДанных);
	Если ЕстьРеквизитСкладОтправитель Тогда
		ИменаРеквизитов.Добавить("СкладОтправитель");
	КонецЕсли;
	
	ЕстьРеквизитСкладПолучатель = ЕстьРеквизитОбъектаЛок("СкладПолучатель", МетаданныеИсточникаДанных);
	Если ЕстьРеквизитСкладПолучатель Тогда
		ИменаРеквизитов.Добавить("СкладПолучатель");
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
	
	Если ЕстьРеквизитДоговорКонтрагента Тогда
		ИменаРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	ТребуемыеРеквизиты = Ядро.СоединитьСтроку(ИменаРеквизитов, ",");
	
	Если ЗначениеЗаполнено(ТребуемыеРеквизиты) Тогда
		Реквизиты = ЗначенияРеквизитовОбъектаЛок(ИсточникДанных, ТребуемыеРеквизиты);
	КонецЕсли;
	 
	// В коллекции ПоляОтправителя и ПоляПолучателя индекс элементов соответствует приоритету этих элементов.
	// Чем меньше индекс, тем выше приоритет.
	
	Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(Реквизиты[ИмяРеквизитаПодразделение]) Тогда
		ПоляОтправителя.Добавить(Реквизиты[ИмяРеквизитаПодразделение]);
	КонецЕсли;
	
	Если ЕстьРеквизитСкладОтправитель И ЗначениеЗаполнено(Реквизиты.СкладОтправитель) Тогда
		ПоляОтправителя.Добавить(Реквизиты.СкладОтправитель);
	КонецЕсли;
	
	Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		ПоляОтправителя.Добавить(Реквизиты.Организация);
	КонецЕсли;
	
	Если ЕстьРеквизитСкладПолучатель И ЗначениеЗаполнено(Реквизиты.СкладПолучатель) Тогда
		ПоляПолучателя.Добавить(Реквизиты.СкладПолучатель);
	КонецЕсли;
	
	Если ЕстьРеквизитКонтрагент И ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ПоляПолучателя.Добавить(Реквизиты.Контрагент);
	КонецЕсли;
	
	Если ЕстьРеквизитДоговорКонтрагента И ЗначениеЗаполнено(Реквизиты.ДоговорКонтрагента) Тогда
		ПоляПолучателя.Добавить(Реквизиты.ДоговорКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

// Функция находит документы-основания заданного счета-фактуры.
//
// Параметры:
//  СчетФактура - ДокументСсылка - счет-фактура, основание которой нужно найти;
// 
// Возвращаемое значение:
//  Массив - содержит ссылки на основания счета-фактуры.
//
Функция ДокументыОснованияСчетаФактуры(СчетФактура)
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Ядро.Общее_ВыборкаДанныхОбъекта(СчетФактура, "ДокументыОснования", "ДокументОснование");
			
	Пока Выборка.Следующий() Цикл 
		
		ДокументОснование = Выборка.ДокументОснование;
		
		Если Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат Результат;
	
КонецФункции

// См. метод "ПередФормированиемПечатнойФормыСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  МенеджерПечати			 - ДокументМенеджер	- менеджер, из которого будем вызывать типовой метод печати
//  ПараметрыМетодаПечати	 - Структура 		- см. метод "НовыйПараметрыТиповогоМетодаПечати" в модуле "МенеджерИнтеграции"
//
Процедура ПередФормированиемПечатнойФормыСчетаНаОплату(МенеджерПечати, ПараметрыМетодаПечати) Экспорт
	
КонецПроцедуры

// См. метод "ПриЗаполненииМетыНеформализованногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
// Параметры:
//  СчетНаОплату	- ДокументСсылка	- документ, на основании которого формируем печатную форму
//  Мета			- Структура			- см. метод "НовыйРезультатВизуализацииСчетаНаОплату" в модуле "МенеджерИнтеграции"
//
Процедура ПриЗаполненииМетыНеформализованногоСчетаНаОплату(СчетНаОплату, Мета) Экспорт
	
КонецПроцедуры

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - документ учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПриПолученииПредставленияНомераДокументаУчета(Документ) Экспорт
	
	Результат = ПредставлениеНомера(Документ);
	
	Возврат Результат;
	
КонецФункции

// См. метод "СписокОснованийДляЭлектронногоСчетаНаОплату" в модуле "МенеджерИнтеграции"
// Переопределяет заполнение списка доступных оснований для формирования электронного счета на оплату.
//
// Параметры:
//	СписокОснований - СписокЗначений - переопределяемый список значений
//
Процедура ЗаполнитьСписокОснованийДляЭлектронногоСчетаНаОплату(СписокОснований) Экспорт
	
	СписокОснований.Добавить(ТипОснованияСчетаНаОплату_СчетНаОплату(), "Счет на оплату");
	СписокОснований.Добавить(ТипОснованияСчетаНаОплату_ДокументПродажи(), "Документ продажи");
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		СписокОснований.Добавить(ТипОснованияСчетаНаОплату_ЗаказПокупателя(), "Заказ покупателя");
	КонецЕсли;
	
КонецПроцедуры

// См. метод "ЭтоДокументКонфигурацииСчетНаОплату" в модуле "МенеджерИнтеграции"
// Определяет является ли переданный документ ИБ счетом на оплату
//
// Параметры:
//	Документ1С - ДокументСсылка - учетный документ информационной базы
//
// Возвращаемое значение:
//	Булево - Истина, если это счет на оплату
Функция ЭтоДокументКонфигурацииСчетНаОплату(Документ1С) Экспорт
	
	Результат = (ТипЗнч(Документ1С) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	
	Возврат Результат;
	
КонецФункции

// При получении реквизитов документов можно изменить реквизиты документа проверяемые по умолчанию или добавить новые
//
// Параметры:
//  СоответствияРеквизитов	 - Структура - Соответствие реквизитов ЭД и Документа учета
//  СсылкаНаОбъект		 - ДокументСсылка - ссылка на проверяемый документ
Процедура ПриПолученииИменРеквизитовДокументаУчета_НомерДата(СоответствияРеквизитов, СсылкаНаОбъект) Экспорт
	
	
КонецПроцедуры

// Значения реквизитов документов учета организация контрагент
//
// Параметры:
//  КоллекцияДокументов - Массив - коллекция документов учета
// 
// Возвращаемое значение:
//  Соотвествие - Соответствие в котором ключом является сам документ а в значении структура ревизитов (Организация, Контрагент) 
//
Функция ЗначенияРеквизитовДокументовУчета_ОрганизацияКонтрагент(КоллекцияДокументов) Экспорт
	
	ПервыйЭлемент = КоллекцияДокументов[0];
	МетаданныеЭлемента = ПервыйЭлемент.Метаданные();
	
	Реквизиты = Новый Массив;
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Организация") = Неопределено Тогда
		Реквизиты.Добавить("Организация");	
	КонецЕсли;
	
	Если НЕ МетаданныеЭлемента.Реквизиты.Найти("Контрагент") = Неопределено Тогда
		Реквизиты.Добавить("Контрагент");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ИменаРеквизитов = Общее_СоединитьСтроку(Реквизиты, ","); 
	
	Результат = Общее_ЗначенияРеквизитовОбъектов(КоллекцияДокументов, ИменаРеквизитов);
	
	Возврат Результат;
	
КонецФункции

// См. метод "ДоступнаТиповаяПечатнаяФорма" в модуле "МенеджерИнтеграции"
// Определяет доступность настройки "Печатная форма 1С" для исходящего документа "Счет на оплату"
//
// Параметры:
//  ЕстьТиповаяПечатнаяФорма - Булево - Истина, если типовая печатная форма счета на оплату доступна
//  ВидДокумента - Строка - Идентификатор вида документа на отправку
//  ТипОснования - Строка - Тип документа учета - основания для исходящего счета на полату
//  СтандартнаяОбработка - Булево - Ложь, чтобы отключить стандартную обработку события.
//
Процедура ПроверитьДоступностьТиповойПечатнойФормы(ЕстьТиповаяПечатнаяФорма, ВидДокумента, ТипОснования, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЕстьТиповаяПечатнаяФорма = Ложь;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С.
// Для получения подчиненных документов используется критерии отбора СвязанныеДокументы.
//
// Параметры:
//  ДокументУчета	 - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СчетаНаОплату_СвязанныеДокументыПоКритериюОтбора(Документ) Экспорт
	
	Результат = Новый Массив;
	
	СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, Документ);
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		
		Если ЭтоРеализацияТоваровУслуг(Документ) Тогда
			ДокументОснование = ЗначениеРеквизитаОбъектаЛок(Документ, "Сделка");
		ИначеЕсли ЭтоСчетНаОплатуПокупателю(Документ) Тогда
			ДокументОснование = ЗначениеРеквизитаОбъектаЛок(Документ, "ЗаказПокупателя");
		Иначе
			ДокументОснование = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОснование)
			И Результат.Найти(ДокументОснование) = Неопределено Тогда
			Результат.Добавить(ДокументОснование);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(Результат, ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Добавить(Документ);	
	
	Возврат Результат;	
	
КонецФункции	

Процедура СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, Документ)
	
	СвязанныеДокументы = СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ);
	
	Для Каждого СсылкаНаОбъект Из СвязанныеДокументы Цикл
		Если КоллекцияПриемник.Найти(СсылкаНаОбъект) = Неопределено Тогда
			КоллекцияПриемник.Добавить(СсылкаНаОбъект);
			СвязанныеДокументы_ЗаполнитьКоллекциюПоДокументу(КоллекцияПриемник, СсылкаНаОбъект)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив ссылок на связанные документы учета 1С
//
// Параметры:
//  Документ - Любая ссылка	 - ссылка на документ учета 1С, для которого необходимо получить коллекую связанных с ним
// 
// Возвращаемое значение:
//  Массив - массив ссылок на документы 1С
//
Функция СвязанныеДокументы_ПолучитьПоКритериюОтбора(Документ)

	ТекстЗапроса = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы";
	
	Если ЭтоКонфигурацияБП() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".СвязанныеДокументы", ".СтруктураПодчиненности");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;	
	
КонецФункции

Функция ЭтоРеализацияТоваровУслуг(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоДокументПродажи(Документ)
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
	МассивТипов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПередачаОС"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РеализацияУслугПоПереработке"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Результат = МассивТипов.Найти(ТипЗнч(Документ)) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетНаОплатуПокупателю(Документ)
	
	Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказПокупателя_УПП13(Документ)
	
	Результат = Ложь;
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		Результат = (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура - При получении оснований документа учета
//
// Параметры:
//  КоллекцияОснований	 - Массив - Коллекция для заполнения документами основания
//  ДокументУчета		 - ДокументСсылка - Ссылка на документ учета по которому выбираются документы основания
//
Процедура ПриПолученииОснованийДокументаУчета(КоллекцияОснований, ДокументУчета) Экспорт
	
	Если НЕ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КоллекцияОснований = ДокументыОснованияСчетаФактуры(ДокументУчета);
	
КонецПроцедуры

// Возвращает заполненную протоструктуру титула продавца в формате 970 по данным документа 1С
//
// Параметры:
//  ДокСсылка				 - ДокументСсылка - ссылка на учетный документ 1С, по которому заполняется протоконтент титула продавца 970@
//  ФункцияДокумента - Строка - функция УПД (возможные значения: СЧФ, СЧФДОП, ДОП)
//  ДополнительныеПараметры	 - Структура - Модуль_Ядро.ДополнительныеПараметрыПолученияКонтента
// 
// Возвращаемое значение:
//  Структура - заполненный протоконтент УПД (см. Контракт_ПротоСтруктураУПД970)
//
Функция УПД970_КонтентТитулаПродавца(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры) Экспорт
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Если ЭтоСчетФактураНаАванс(ДокСсылка) Тогда
			Результат = УПД970_КонтентТитулаПродавца_СчетФактураВыданныйНаАванс(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		Иначе
			Результат = УПД970_КонтентТитулаПродавца_СчетФактураВыданный(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_РеализацияТоваровУслуг(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_КорректировкаРеализации(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_ОтчетКомитентуОПродажах(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_ВозвратТоваровПоставщику(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ЭтоПередачаОС(ДокСсылка) Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_ПередачаОС(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_АктОбОказанииПроизводственныхУслуг(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_РеализацияУслугПоПереработке(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_ПеремещениеТоваров(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
		
		Результат = УПД970_КонтентТитулаПродавца_ОтражениеНачисленияНДС(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТипЗнч(ДокСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура АктыСверок_ЗаполнитьДанные(Модель, СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	Если ТипОбъекта <> Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда
		
		Ошибка = СтрШаблонЛок(
			"Неожиданный тип параметра 'СсылкаНаОбъект' (%1)",
			Строка(ТипОбъекта)
		);
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ДатаНачала КАК НачалоПериода,
	|	ДанныеДокумента.ДатаОкончания КАК КонецПериода,
	|	ДанныеДокумента.ДоговорКонтрагента КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеДокумента.ДоговорКонтрагента) КАК ДоговорПредставление,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.ВалютаДокумента.Наименование КАК ВалютаПредставление,
	|	ДанныеДокумента.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.Наименование КАК ОрганизацияНаименование,
	|	ДанныеДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ДанныеДокумента.ПредставительОрганизации КАК ПредставительОрганизации,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительОрганизации.Наименование, """") КАК ПредставительОрганизацииФИО,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительКонтрагента.Наименование, """") КАК ПредставительКонтрагентаФИО,
	|	ЕСТЬNULL(ДанныеДокумента.ПредставительКонтрагента.Должность, """") КАК ПредставительКонтрагентаДолжность,
	|	ДанныеДокумента.СверкаСогласована КАК СверкаСогласована
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОрганизации.НомерСтроки КАК НомерСтроки,
	|	&ПолеДоговорКонтрагентаПоОрганизации КАК Аналитика,
	|	ДанныеОрганизации.Представление КАК ДокументПредставление,
	|	ДанныеОрганизации.Дата КАК Дата,
	|	ДанныеОрганизации.Дебет КАК Дебет,
	|	ДанныеОрганизации.Кредит КАК Кредит,
	|	ИСТИНА КАК ЭтоДанныеОрганизации
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ДанныеОрганизации
	|ГДЕ
	|	ДанныеОрганизации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеКонтрагента.НомерСтроки,
	|	&ПолеДоговорКонтрагентаПоКонтрагенту,
	|	ДанныеКонтрагента.Представление,
	|	ДанныеКонтрагента.Дата,
	|	ДанныеКонтрагента.Дебет,
	|	ДанныеКонтрагента.Кредит,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ДанныеКонтрагента
	|ГДЕ
	|	ДанныеКонтрагента.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоДанныеОрганизации,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаДоговорПоДаннымОрганизации(ТекстЗапроса, "ДанныеОрганизации");
	ЗаполнитьВыражениеЗапросаДоговорПоДаннымКонтрагента(ТекстЗапроса, "ДанныеКонтрагента");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаСверки", СсылкаНаОбъект.Дата);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		
		Модель.Шапка.Дата = ВыборкаШапка.Дата;
		Модель.Шапка.НачалоПериода = ВыборкаШапка.НачалоПериода;
		Модель.Шапка.КонецПериода = ВыборкаШапка.КонецПериода;
		Модель.Шапка.ГруппироватьПоАналитике = Ложь;
		Модель.Шапка.СверкаСогласована = ВыборкаШапка.СверкаСогласована;
		
		Модель.Шапка.СверкаПоДоговору = ЗначениеЗаполнено(ВыборкаШапка.Договор);
		Модель.Шапка.ДоговорПредставление = СокрЛП(ВыборкаШапка.ДоговорПредставление);
		
		Модель.Шапка.ВалютаКод = СокрЛП(ВыборкаШапка.ВалютаКод);
		Модель.Шапка.ВалютаПредставление = СокрЛП(ВыборкаШапка.ВалютаПредставление);
		Модель.Шапка.ОстатокНаНачало = ВыборкаШапка.ОстатокНаНачало;
		
		МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
		СведенияОбОрганизации = МодульУправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);
		
		МодульФормированиеПечатныхФорм = ОбщийМодульПоИмениЛок("ФормированиеПечатныхФорм");
		Модель.Шапка.ОрганизацияПредставление = МодульФормированиеПечатныхФорм.ОписаниеОрганизации(
			СведенияОбОрганизации,
			"ПолноеНаименование"
		);
		
		Если НЕ ЗначениеЗаполнено(Модель.Шапка.ОрганизацияПредставление) Тогда
			
			Модель.Шапка.ОрганизацияПредставление = ВыборкаШапка.ОрганизацияНаименование;
			
		КонецЕсли;
		
		Модель.Шапка.ПредставительОрганизацииФИО = СокрЛП(ВыборкаШапка.ПредставительОрганизацииФИО);
		Модель.Шапка.ПредставительОрганизацииДолжность = ДолжностьОтветственногоЛицаОрганизацииЛок(
			ВыборкаШапка.ПредставительОрганизации,
			ВыборкаШапка.Организация,
			ВыборкаШапка.Дата
		);
		
		Модель.Шапка.КонтрагентПредставление = СокрЛП(ВыборкаШапка.КонтрагентНаименованиеПолное);
		Если ПустаяСтрока(ВыборкаШапка.КонтрагентНаименованиеПолное) Тогда
			Модель.Шапка.КонтрагентПредставление = СокрЛП(ВыборкаШапка.КонтрагентНаименование);
		КонецЕсли;
		
		Модель.Шапка.ПредставительКонтрагентаФИО = СокрЛП(ВыборкаШапка.ПредставительКонтрагентаФИО);
		Модель.Шапка.ПредставительКонтрагентаДолжность = СокрЛП(ВыборкаШапка.ПредставительКонтрагентаДолжность);
		
	КонецЕсли;
	
	ВыборкаТЧ = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Если ВыборкаТЧ.ЭтоДанныеОрганизации Тогда
			Запись = Модель.ДанныеОрганизации.Добавить();
		Иначе
			Запись = Модель.ДанныеКонтрагента.Добавить();
		КонецЕсли;
		
		Запись.Аналитика = ВыборкаТЧ.Аналитика;
		Запись.ДокументПредставление = СокрЛП(ВыборкаТЧ.ДокументПредставление);
		Запись.Дата = ВыборкаТЧ.Дата;
		Запись.Дебет = ВыборкаТЧ.Дебет;
		Запись.Кредит = ВыборкаТЧ.Кредит;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДолжностьОтветственногоЛицаОрганизацииЛок(ФизическоеЛицо, Организация, НаДату = '00010101')
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтветственныеЛица.Период КАК Период,
	|	ОтветственныеЛица.Должность КАК Должность,
	|	ПРЕДСТАВЛЕНИЕ(ОтветственныеЛица.Должность) КАК ДолжностьПредставление
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ФизическоеЛицо = &ФизическоеЛицо) КАК ОтветственныеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	Если Выборка.Следующий() Тогда
		Результат = СокрЛП(Выборка.ДолжностьПредставление);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает прикладное значение ставки НДС по его строковому представлению
//
// Параметры:
//  ПредставлениеСтавки - Строка - Строковое представление ставки НДС
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Прикладное значение ставки НДС
//
Функция ЗначениеСтавкиНДС(ПредставлениеСтавки) Экспорт
	
	СтавкиНДСДиадок = Новый Соответствие;
	СтавкиНДСДиадок.Вставить("0", Перечисления.СтавкиНДС.НДС0);
	СтавкиНДСДиадок.Вставить("10", Перечисления.СтавкиНДС.НДС10);
	СтавкиНДСДиадок.Вставить("18", Перечисления.СтавкиНДС.НДС18);
	СтавкиНДСДиадок.Вставить("20", Перечисления.СтавкиНДС.НДС20);
	СтавкиНДСДиадок.Вставить("10/110", Перечисления.СтавкиНДС.НДС10_110);
	СтавкиНДСДиадок.Вставить("18/118", Перечисления.СтавкиНДС.НДС18_118);
	СтавкиНДСДиадок.Вставить("20/120", Перечисления.СтавкиНДС.НДС20_120);
	СтавкиНДСДиадок.Вставить(ПредставлениеСтавкиБезНДС(), Перечисления.СтавкиНДС.БезНДС);
	СтавкиНДСДиадок.Вставить(СтавкаНДСИсчисляетсяНалоговымАгентом(), СтавкаНДСИсчисляетсяНалоговымАгентомПредставление());
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		СтавкиНДСДиадок.Вставить("5", Перечисления.СтавкиНДС.НДС5);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		СтавкиНДСДиадок.Вставить("7", Перечисления.СтавкиНДС.НДС7);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		СтавкиНДСДиадок.Вставить("22", Перечисления.СтавкиНДС.НДС22);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		СтавкиНДСДиадок.Вставить("5/105", Перечисления.СтавкиНДС.НДС5_105);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		СтавкиНДСДиадок.Вставить("7/107", Перечисления.СтавкиНДС.НДС7_107);
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		СтавкиНДСДиадок.Вставить("22/122", Перечисления.СтавкиНДС.НДС22_122);
	КонецЕсли;
	
	Результат = СтавкиНДСДиадок.Получить(ПредставлениеСтавки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает строковое представление ставки НДС по прикладному значению
//
// Параметры:
//  ЗначениеСтавки - ПеречислениеСсылка - Прикладное значение ставки НДС
//  НДСИсчисляетсяНалоговымАгентом - Булево - Истина, если НДС исчисляется налоговым агентом
// 
// Возвращаемое значение:
//  Строка - Строковое представление ставки НДС для электронного документа
//
Функция ПредставлениеСтавкиНДС(ЗначениеСтавки, НДСИсчисляетсяНалоговымАгентом = Ложь) Экспорт
	
	Результат = "";
	
	Если НДСИсчисляетсяНалоговымАгентом Тогда
		
		Результат = СтавкаНДСИсчисляетсяНалоговымАгентом();
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(_СоответствиеСтавокНДС) Тогда
			_СоответствиеСтавокНДС = _ПеречислениеСтавокНДС();
		КонецЕсли;
		
		Результат = _СоответствиеСтавокНДС.Получить(ЗначениеСтавки);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = "##";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _ПеречислениеСтавокНДС()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0, "0");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10, "10");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18, "18");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20, "20");
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС, "без НДС");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110, "10/110");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118, "18/118");
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120, "20/120");
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5, "5");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7, "7");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22, "22");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС5_105") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105, "5/105");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС7_107") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107, "7/107");
	КонецЕсли;
	
	Если СуществуетЗначениеПеречисленияСтавкиНДС("НДС22_122") Тогда
		Результат.Вставить(Перечисления.СтавкиНДС.НДС22_122, "22/122");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетЗначениеПеречисленияСтавкиНДС(ИмяЗначенияСтавкаНДС)
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления;
	Результат = (ЗначенияПеречисления.Найти(ИмяЗначенияСтавкаНДС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Возвращает виды документов из текущей конфигурации для поиска в модуле
// 
// Возвращаемое значение:
//  Массив - Предопределенные виды документов конфигурации для поиска в модуле
//
Функция ВидыПредопределенныхДокументовДляПоискаВМодуле() Экспорт
	
	ДокументыКонфигурации = Метаданные.Документы;
	
	Результат = Новый Массив;
	Результат.Добавить(ДокументыКонфигурации.СчетФактураВыданный);
	Результат.Добавить(ДокументыКонфигурации.КорректировкаРеализации);
	Результат.Добавить(ДокументыКонфигурации.АктОбОказанииПроизводственныхУслуг);
	Результат.Добавить(ДокументыКонфигурации.РеализацияТоваровУслуг);
	Результат.Добавить(ДокументыКонфигурации.ВозвратТоваровПоставщику);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомиссионераОПродажах);
	Результат.Добавить(ДокументыКонфигурации.ОтчетКомитентуОПродажах);
	Результат.Добавить(ДокументыКонфигурации.ПередачаОС);
	
	Если ЭтоКонфигурацияБП() Тогда
		Результат.Добавить(ДокументыКонфигурации.ОказаниеУслуг);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//} ПРЯМЫЕ ВЫЗОВЫ ИМ


//{ СБОР КОНТЕНТА УПД970

Функция УПД970_КонтентТитулаПродавца_СчетФактураВыданный(СчетФактура, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_СчетФактураВыданный(СчетФактура);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОснования = ДанныеПоДокументу.ДокументыОснования;
	
	ДокументОснование = ДокументыОснования[0];
	ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументОснование, СчетФактура, ФункцияДокумента);
	
	ТаблицаДанныеШапкиОснования = ДанныеПоДокументуОснования.РезультатПоШапке.Выгрузить();
	ДанныеШапкиОснования = ТаблицаДанныеШапкиОснования[0];
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Если ДанныеШапки.Исправление Тогда
		Контент.RevisionNumber = ДанныеШапки.НомерИсправления;
		Контент.RevisionDate = ДанныеШапки.Дата;
		
		Если ЗначениеЗаполнено(ДанныеШапки.НомерИсходногоДокумента) Тогда
			Контент.DocumentNumber = ДанныеШапки.НомерИсходногоДокумента;
		Иначе
			Контент.DocumentNumber = ДанныеШапки.НомерИсправляемогоКорректировочногоДокумента;
		КонецЕсли;
		
		ДобавитьИндексОбособленногоПодразделения(Контент.DocumentNumber, СчетФактура, ДанныеШапкиОснования.ПодразделениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.ДатаИсходногоДокумента) Тогда
			Контент.DocumentDate = ДанныеШапки.ДатаИсходногоДокумента;
		Иначе
			Контент.DocumentDate = ДанныеШапки.ДатаИсправляемогоКорректировочногоДокумента;
		КонецЕсли;
		
	Иначе
		
		Контент.DocumentNumber = ПредставлениеНомераДляСФ(СчетФактура, ДанныеШапкиОснования.ПодразделениеОрганизации);
		Контент.DocumentDate = ДанныеШапки.Дата;
		
	КонецЕсли;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, ДанныеПоДокументу.РезультатПоДокументамОплаты);
	
	УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокументаОснованияСчетаФактуры(
		Контент,
		ДанныеПоДокументуОснования,
		ДополнительныеПараметры);
		
	Для Индекс = 1 По ДокументыОснования.ВГраница() Цикл
		
		ДокументОснование = ДокументыОснования[Индекс];
		
		ДанныеПоДокументуОснования = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументОснование, СчетФактура, ФункцияДокумента);
	
		УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокументаОснованияСчетаФактуры(
			Контент,
			ДанныеПоДокументуОснования,
			ДополнительныеПараметры);
		
	КонецЦикла;	
		
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОснования, ФункцияДокумента);
		
	Если ЭтоКонфигурацияБП() Тогда
		УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваровПоСчетФактуре_БП20(Контент,
																			СчетФактура,
																			ДокументыОснования,
																			ДополнительныеПараметры);
	Иначе
		УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваровПоСчетФактуре_УПП13(Контент,
																			ДокументыОснования,
																			ДополнительныеПараметры);
	КонецЕсли;
	
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапкиОснования, ФункцияДокумента);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапкиОснования);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапкиОснования);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапкиОснования, ДанныеШапки.КППКонтрагента);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапкиОснования);
	
	Если ЭтоСчетФактураОтИмениПродавца_БП20(СчетФактура) Тогда
		УПД970_ЗаполнитьСоставителяДокументаПоДаннымАгента(Контент, СчетФактура);
	Иначе
		УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	КонецЕсли;
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, СчетФактура);
	
	Если УПД970_ВДокументеТолькоУслуги(Контент.Table.Items) Тогда
		УПД970_ИзменитьСведенияОбУчастникахЭДОВДокументеУслуг(Контент);
	КонецЕсли;
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_СчетФактураВыданныйНаАванс(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанныеПоСчетФактураВыданныйНаАванс(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выбрать();
	ДанныеШапки.Следующий();
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, ДанныеПоДокументу.РезультатПоДокументамОплаты);
	
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента);
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	
	СведенияОПоставщике = УПД970_ДанныеУчастникаЭДО(
		ДанныеШапки.Организация,
		ДанныеШапки.Дата,
		БанковскийСчет);
		
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(ДанныеШапки.Организация);
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);

	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОПоставщике, СведенияОбАдресе);
	
	СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДО(
		ДанныеШапки.Контрагент,
		ДанныеШапки.Дата);
		
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(ДанныеШапки.Контрагент);
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);

	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОКонтрагенте, СведенияОбАдресе);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	
	НДСИсчисляетсяНалоговымАгентом = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	
	РезультатПоТабличнойЧасти = ДанныеПоДокументу.РезультатПоТабличнойЧасти;
	ИтогиПоТабличнойЧасти = РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ИтогиПоТабличнойЧасти.Следующий() Тогда
		
		ДанныеТабличнойЧасти = ИтогиПоТабличнойЧасти.Выбрать();
		Пока ДанныеТабличнойЧасти.Следующий() Цикл
			
			Item = Контракт_Item970();
			
			Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.Содержание) Тогда
				Номенклатура = ДанныеТабличнойЧасти.Содержание;
			ИначеЕсли ЗначениеЗаполнено(ДанныеТабличнойЧасти.ТоварПолноеНаименование) Тогда
				Номенклатура = ДанныеТабличнойЧасти.ТоварПолноеНаименование;
			ИначеЕсли ЗначениеЗаполнено(ДанныеТабличнойЧасти.ТоварНаименование) Тогда
				Номенклатура = ДанныеТабличнойЧасти.ТоварНаименование;
			Иначе
				Номенклатура = "Предварительная оплата";
			КонецЕсли;
			
			Item.Product = Номенклатура;
			Item.ItemMark = УПД970_ПризнакТовараИлиУслугиПоСтрокеДокумента(ДанныеТабличнойЧасти.ВидПоступления);
			
			Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.ТоварКод) Тогда
				Item.ItemVendorCode = ДанныеТабличнойЧасти.ТоварКод;
			КонецЕсли;
			
			Item.TaxRate = ПредставлениеСтавкиНДС(ДанныеТабличнойЧасти.СтавкаНДС, НДСИсчисляетсяНалоговымАгентом);
			
			Если НДСИсчисляетсяНалоговымАгентом Тогда
				Item.Vat = 0;
				Item.Subtotal = 0;
				Item.SubtotalWithVatExcluded = ДанныеТабличнойЧасти.Сумма;
			Иначе
				Item.Vat = ДанныеТабличнойЧасти.СуммаНДС;
				Item.Subtotal = ДанныеТабличнойЧасти.Сумма;
			КонецЕсли;
			
			Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(ДанныеТабличнойЧасти);
			
			Table.Items.Добавить(Item);
			
		КонецЦикла;
		
		Если Не НДСИсчисляетсяНалоговымАгентом Тогда
			Table.Vat = ИтогиПоТабличнойЧасти.СуммаНДС;
			Table.Total = ИтогиПоТабличнойЧасти.Сумма;
		Иначе
			Table.Total = 0;
			Table.TotalWithVatExcluded = ИтогиПоТабличнойЧасти.Сумма;
		КонецЕсли;
		
	КонецЕсли;
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_РеализацияТоваровУслуг(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_РеализацияТоваровУслуг(ДокСсылка, ФункцияДокумента);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_КорректировкаРеализации(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_КорректировкаРеализации(ДокСсылка);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_ОтчетКомитентуОПродажах(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	СчетФактура = Неопределено;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_ОтчетКомитентуОПродажах(ДокСсылка, СчетФактура);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	НеТребуетсяПересчетВалюты = Истина;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_ВозвратТоваровПоставщику(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_ВозвратуТоваровПоставщику(ДокСсылка, ФункцияДокумента);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);

	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_АктОбОказанииПроизводственныхУслуг(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_АктОбОказанииПроизводственныхУслуг(ДокСсылка);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_РеализацияУслугПоПереработке(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_РеализацияУслугПоПереработке(ДокСсылка);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_ПередачаОС(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	Перем Контент;
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_ПередачеОС(ДокСсылка);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;

	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);

	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_ПеремещениеТоваров(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_ПеремещениеТоваров(ДокСсылка);
	
	ДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выбрать();
	ДанныеШапки.Следующий();
	
	ОбстоятельствоФормированияДокумента = "00051";
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Контент = Контракт_ПротоСтруктураУПД970();
	Контент.Function = ФункцияДокументаУПД_ДОП();
	Контент.CircumFormatInvoice = ОбстоятельствоФормированияДокумента;
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	Контент.DocumentName = НаименованияДокументов.УПД;
	Контент.Currency = Валюта.Код;
	
	DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(
		Контент.DocumentName,
		Контент.DocumentNumber,
		Контент.DocumentDate
	);
	
	Контент.DocumentShipments.Добавить(DocumentShipment);
	
	УПД970_ЗаполнитьСведенияОбУчастникахЭДОВнутреннегоДО(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваровПеремещенияТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	ОснованияОтгрузки = Новый Массив;
	
	УПД970_ЗаполнитьСведенияОПередачеТоваров(Контент, ОснованияОтгрузки, ДополнительныеПараметры);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	
	Возврат Контент;
	
КонецФункции

Функция УПД970_КонтентТитулаПродавца_ОтражениеНачисленияНДС(ДокСсылка, ФункцияДокумента, ДополнительныеПараметры)
	
	ДанныеПоДокументу = УПД970_ИсходныеДанные_ОтражениеНачисленияНДС(ДокСсылка);
	
	ТаблицаДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выгрузить();
	ДанныеШапки = ТаблицаДанныеШапки[0];
	
	ДокументыОтгрузки = ЗначениеВМассивЛок(ДокСсылка);
	
	Контент = Контракт_ПротоСтруктураУПД970();
	
	Контент.Function = ФункцияДокумента;
	
	Контент.CircumFormatInvoice = УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеШапки, ФункцияДокумента);
	
	Контент.DocumentNumber = ПредставлениеНомера(ДокСсылка);
	Контент.DocumentDate = ДанныеШапки.Дата;
	
	УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки);
	
	НеТребуетсяПересчетВалюты = НЕ ДанныеШапки.РасчетыВУсловныхЕдиницах;
	УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияДокумента, НеТребуетсяПересчетВалюты);
	
	УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки);

	УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки);
	УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки);
	
	УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент);
	УПД970_ЗаполнитьСведенияОМаркировке(Контент, ДокСсылка);
	
	УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, ДокументыОтгрузки, ФункцияДокумента);
	УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокСсылка, ДополнительныеПараметры);
	
	УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент);
	УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры);
	
	Возврат Контент;
	
КонецФункции

Процедура УПД970_ЗаполнитьТаблицуТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	ВсеСтрокиБезНДС = Истина;
	
	ДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выбрать();
	ДанныеШапки.Следующий();
	
	СуммаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	НДСИсчисляетсяНалоговымАгентом = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	
	РезультатСведенияПрослеживаемости = Неопределено;
	
	Если ДанныеПоДокументу.Свойство("РезультатСведенияПрослеживаемости", РезультатСведенияПрослеживаемости) Тогда
		СведенияПрослеживаемости = РезультатСведенияПрослеживаемости.Выгрузить();
		СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	КонецЕсли;
	
	РезультатПоТабличнойЧасти = ДанныеПоДокументу.РезультатПоТабличнойЧасти;
	ИтогиПоТабличнойЧасти = РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если НЕ ИтогиПоТабличнойЧасти.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПересчетВРубли = УПД970_ТребуетсяПересчетВРубли(ДанныеШапки, Контент.Function);
	
	Если ТребуетсяПересчетВРубли Тогда
		
		ДанныеДляПересчета = Новый_ДанныеДляПересчетаВалюты(ДанныеШапки);
		
		СуммаАвансов = УПД970_ПересчетВалюты_СуммаАвансов(ДанныеДляПересчета);
		
		Курс = УПД970_КурсВзаиморасчетов(ДанныеШапки.КурсВзаиморасчетов, ДанныеШапки.ВалютаДокумента, ДанныеШапки.Дата);
		Кратность = УПД970_КратностьВзаиморасчетов(
			ДанныеШапки.КратностьВзаиморасчетов,
			ДанныеШапки.ВалютаДокумента,
			ДанныеШапки.Дата
		);
		
	КонецЕсли;
	
	ВыводитьАртикулВместоКодаТовара = УПД970_ВыводитьАртикулВместоКодаТовара();
	
	ДанныеТабличнойЧасти = ИтогиПоТабличнойЧасти.Выбрать();
	Пока ДанныеТабличнойЧасти.Следующий() Цикл
		
		Item = Контракт_Item970();
		
		ПараметрыЗаполненияСтрокиТаблицыТоваров = Новый_ПараметрыЗаполненияСтрокиТаблицыТоваров();
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ТребуетсяПересчетВРубли = ТребуетсяПересчетВРубли;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.Курс = Курс;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.Кратность = Кратность;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.СуммаВключаетНДС = СуммаВключаетНДС;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.НДСИсчисляетсяНалоговымАгентом = НДСИсчисляетсяНалоговымАгентом;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.СуммаАвансов = СуммаАвансов;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ТочностьКоличества = ТочностьКоличества;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ВыводитьАртикулВместоКодаТовара = ВыводитьАртикулВместоКодаТовара;
		
		УПД970_ЗаполнитьСтрокуТаблицыТоваров(
			Item,
			ДанныеТабличнойЧасти,
			ПараметрыЗаполненияСтрокиТаблицыТоваров,
			ВсеСтрокиБезНДС);
		
		УПД970_ЗаполнитьCustomDeclaration(
			Item,
			ДанныеТабличнойЧасти.НомерГТД,
			ДанныеТабличнойЧасти.СтранаПроисхожденияКод,
			ДанныеТабличнойЧасти.СтранаПроисхожденияУчастникЕАЭС);
		
		Если ДанныеТабличнойЧасти.ПрослеживаемыйТовар Тогда
			УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СведенияПрослеживаемости, ДанныеТабличнойЧасти);
			УПД970_УстановитьРегистрационныйНомерДляПрослеживаемогоТовара(Item.CustomDeclarations);
		КонецЕсли;
		
		УПД970_ОчиститьСтрануПроисхожденияСПустымГТД(Item);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(ДанныеТабличнойЧасти);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьИтогиПоТабличнойЧасти(
		Table,
		ИтогиПоТабличнойЧасти,
		ВсеСтрокиБезНДС,
		СуммаВключаетНДС,
		НДСИсчисляетсяНалоговымАгентом);
	
	Если ТребуетсяПересчетВРубли Тогда
		Если СуммаАвансов <> 0 Тогда
			УПД970_ПересчетВалюты_ПересчитатьСуммыСУчетомАвансов(Table, СуммаАвансов, ДанныеШапки.Дата);
		КонецЕсли;
		
		УПД970_ПересчетВалюты_ПересчитатьИтоговыеСуммыУПД(Table);
	КонецЕсли;
	
	УПД970_ПересчитатьЦенуВТабличнойЧасти(Table.Items, ТочностьЦены);
	
	Если УПД970_ВДокументеТолькоУслуги(Table.Items) Тогда
		УПД970_ИзменитьСведенияОбУчастникахЭДОВДокументеУслуг(Контент);
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуТоваровПеремещенияТоваров(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	Table = Контракт_InvoiceTable970();
	Контент.Table = Table;
	
	РезультатТовары = ДанныеПоДокументу.РезультатПоТабличнойЧасти.Выгрузить();
	
	ТочностьКоличества = 3;
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	ДопКолонкаПФДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	ВсеСтрокиБезНДС = Истина;
	
	Для Каждого ДанныеТЧ Из РезультатТовары Цикл
		
		Item = Контракт_Item970();
		
		Item.Product = УПД970_ПредставлениеТовара(ДанныеТЧ);
		Item.ItemMark = ТипыНоменклатуры.Имущество;
		Item.ItemVendorCode = УПД970_КодТовара(ДанныеТЧ, ДопКолонкаПФДокументов);
		
		Если ЗначениеЗаполнено(ДанныеТЧ.ЕдиницаИзмеренияНаименование) Тогда
			Item.UnitName = СокрЛП(ДанныеТЧ.ЕдиницаИзмеренияНаименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеТЧ.ЕдиницаИзмеренияКод) Тогда
			Item.Unit = СокрЛП(ДанныеТЧ.ЕдиницаИзмеренияКод);
		КонецЕсли;
		
		Item.Quantity = 0;
		Если ЗначениеЗаполнено(ДанныеТЧ.Количество) Тогда
			Item.Quantity = Окр(ДанныеТЧ.Количество, ТочностьКоличества);
		КонецЕсли;
		
		Item.TaxRate = ПредставлениеСтавкиНДС(ДанныеТЧ.СтавкаНДС);
		Item.WithoutVat = XMLСтрока(ДанныеТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС);
		Если ДанныеТЧ.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
			ВсеСтрокиБезНДС = Ложь;
		КонецЕсли;
		
		УПД970_ЗаполнитьCustomDeclaration(
			Item,
			ДанныеТЧ.НомерГТД,
			ДанныеТЧ.СтранаПроисхожденияКод,
			ДанныеТЧ.СтранаПроисхожденияУчастникЕАЭС
		);
		
		УПД970_ОчиститьСтрануПроисхожденияСПустымГТД(Item);
		
		Item.Price = ДанныеТЧ.Цена;
		Item.Vat = 0;
		Item.Subtotal = ДанныеТЧ.Сумма;
		Item.SubtotalWithVatExcluded = Item.Subtotal - Item.Vat;
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(ДанныеТЧ);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.TotalNet = РезультатТовары.Итог("Количество");
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	Table.Vat = 0;
	Table.Total = РезультатТовары.Итог("Сумма");
	Table.TotalWithVatExcluded = Table.Total - Table.Vat;
	
КонецПроцедуры

Функция УПД970_ПредставлениеТовара(ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ТоварПолноеНаименование) Тогда
		НаименованиеТовара = ДанныеСтроки.ТоварПолноеНаименование;
	Иначе
		НаименованиеТовара = ДанныеСтроки.ТоварНаименование;
	КонецЕсли;
	
	Если ЭтоКонфигурацияБП() Тогда
		ПредставлениеХарактеристикиИСерии = "";
	Иначе
		ПредставлениеХарактеристикиИСерии = УПД970_ПредставлениеХарактеристикиИСерии(ДанныеСтроки);
	КонецЕсли;
	
	Результат = НаименованиеТовара + ПредставлениеХарактеристикиИСерии;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КодТовара(ДанныеСтроки, ДопКолонкаПФДокументов)
	
	Если ДопКолонкаПФДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		Результат = ДанныеСтроки.ТоварАртикул;
	ИначеЕсли ДопКолонкаПФДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		Результат = ДанныеСтроки.ТоварКод;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КурсВзаиморасчетов(КурсВзаиморасчетов, ВалютаДокумента, ДатаДокумента)
	
	Если КурсВзаиморасчетов = Неопределено Тогда
		ИнтерфейсКонфигурации = ОбщийМодульПоИмениЛок("МодульВалютногоУчета");
		Результат = ИнтерфейсКонфигурации.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента).Курс;
	Иначе
		Результат = КурсВзаиморасчетов;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_КратностьВзаиморасчетов(КратностьВзаиморасчетов, ВалютаДокумента, ДатаДокумента)
	
	Если КратностьВзаиморасчетов = Неопределено Тогда
		ИнтерфейсКонфигурации = ОбщийМодульПоИмениЛок("МодульВалютногоУчета");
		Результат = ИнтерфейсКонфигурации.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента).Кратность;
	Иначе
		Результат = КратностьВзаиморасчетов;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСтрокуТаблицыТоваров(Item, ДанныеТабличнойЧасти, ПараметрыЗаполнения, ВсеСтрокиБезНДС)
	
	Сумма = ДанныеТабличнойЧасти.Сумма;
	СуммаНДС = ДанныеТабличнойЧасти.СуммаНДС;
	
	Если ПараметрыЗаполнения.СуммаВключаетНДС Тогда
		СуммаБезНДС = Сумма - СуммаНДС;
		СуммаВсего = Сумма;
	Иначе
		СуммаБезНДС = Сумма;
		СуммаВсего = Сумма + СуммаНДС;
	КонецЕсли;

	Если ПараметрыЗаполнения.ТребуетсяПересчетВРубли Тогда
		
		СуммаВсего = Окр(СуммаВсего * ПараметрыЗаполнения.Курс / ПараметрыЗаполнения.Кратность, 2);
		
		МодульОбщегоНазначения = ОбщийМодульПоИмениЛок("ОбщегоНазначения");

		МассивРаспределения = Новый Массив;
		МассивРаспределения.Добавить(СуммаБезНДС);
		МассивРаспределения.Добавить(СуммаНДС);
		МассивРаспределенныхСумм = МодульОбщегоНазначения.РаспределитьПропорционально(СуммаВсего, МассивРаспределения);
		Если МассивРаспределенныхСумм <> Неопределено Тогда
			СуммаБезНДС = МассивРаспределенныхСумм[0];
			СуммаНДС = МассивРаспределенныхСумм[1];
		КонецЕсли;

		Если ПараметрыЗаполнения.СуммаАвансов <> 0 Тогда
			Item.Вставить("СуммаРублевая");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.ТоварПолноеНаименование) Тогда
		НаименованиеТовара = ДанныеТабличнойЧасти.ТоварПолноеНаименование;
	Иначе
		НаименованиеТовара = ДанныеТабличнойЧасти.ТоварНаименование;
	КонецЕсли;
	
	Если ЭтоКонфигурацияБП() Тогда
		ПредставлениеХарактеристикиИСерии = "";
	Иначе
		ПредставлениеХарактеристикиИСерии = УПД970_ПредставлениеХарактеристикиИСерии(ДанныеТабличнойЧасти);
	КонецЕсли;
	
	Item.Product = НаименованиеТовара + ПредставлениеХарактеристикиИСерии;
	Item.ItemMark = УПД970_ПризнакТовараИлиУслугиПоСтрокеДокумента(ДанныеТабличнойЧасти.ВидПоступления);
	
	Если ПараметрыЗаполнения.ВыводитьАртикулВместоКодаТовара Тогда
		КодАртикулТовара = ДанныеТабличнойЧасти.ТоварАртикул;
	Иначе
		КодАртикулТовара = ДанныеТабличнойЧасти.ТоварКод;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодАртикулТовара) Тогда
		Item.ItemVendorCode = КодАртикулТовара;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.Количество) Тогда
		Item.Quantity = Окр(ДанныеТабличнойЧасти.Количество, ПараметрыЗаполнения.ТочностьКоличества);
	Иначе
		Item.Quantity = 0;
	КонецЕсли;
	
	Item.Price = ДанныеТабличнойЧасти.Цена;
	
	Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.ЕдиницаИзмерения) Тогда
		
		КодЕИ = СокрЛП(ДанныеТабличнойЧасти.ЕдиницаИзмеренияКод);
		ИмяЕИ = СокрЛП(ДанныеТабличнойЧасти.ЕдиницаИзмерения);
		
		Item.Unit = ГенерацияXML.XML_КодЕдиницыИзмерения(КодЕИ);
		Item.UnitName = ИмяЕИ;
			
	КонецЕсли;
	
	НДСИсчисляетсяНалоговымАгентом = ПараметрыЗаполнения.НДСИсчисляетсяНалоговымАгентом;
	
	Item.TaxRate = ПредставлениеСтавкиНДС(ДанныеТабличнойЧасти.СтавкаНДС, НДСИсчисляетсяНалоговымАгентом);
	
	ЭтоСтавкаБезНДС = (ДанныеТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС);
	Item.WithoutVat = XMLСтрока(ЭтоСтавкаБезНДС);
	
	Если НЕ ЭтоСтавкаБезНДС Тогда
		ВсеСтрокиБезНДС = Ложь;
	КонецЕсли;
	
	Если НДСИсчисляетсяНалоговымАгентом Тогда
		Item.Vat = 0;
		Item.Subtotal = 0;
	Иначе
		Item.Vat = СуммаНДС;
		Item.Subtotal = СуммаВсего;
	КонецЕсли;
	
	Item.SubtotalWithVatExcluded = СуммаБезНДС;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СведенияПрослеживаемости, ДанныеТабличнойЧасти)
	
	Отбор = Новый Структура("ИдентификаторСтроки", ДанныеТабличнойЧасти.ИдентификаторСтроки);
	СтрокиПрослеживаемости = СведенияПрослеживаемости.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаПрослеживаемости Из СтрокиПрослеживаемости Цикл
		
		ItemTracingInfo = Контракт_ItemTracingInfo970();
		
		ItemTracingInfo.RegNumberUnit = СокрЛП(СтрокаПрослеживаемости.НомерРНПТ);
		ItemTracingInfo.Quantity = СтрокаПрослеживаемости.КоличествоПрослеживаемости;
		
		Если ЗначениеЗаполнено(СтрокаПрослеживаемости.Сумма) Тогда
			ItemTracingInfo.SumWithoutVat = СтрокаПрослеживаемости.Сумма;
		Иначе
			ItemTracingInfo.SumWithoutVat = Item.SubtotalWithVatExcluded;
		КонецЕсли;
		
		ItemTracingInfo.Unit = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияКод);
		ItemTracingInfo.UnitName = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияНаименование);
		
		Item.ItemTracingInfos.Добавить(ItemTracingInfo);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьВалютуДокумента(Контент, ДанныеШапки, ФункцияУПД, НеТребуетсяПересчетВалюты = Ложь)
	
	ЭтоСФ = (ФункцияУПД <> ФункцияДокументаУПД_ДОП());
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВалютаУПД = ВалютаРеглУчета;
	
	Если ДанныеШапки.ВалютаДокумента <> ВалютаРеглУчета Тогда
		
		Если ДанныеШапки.РасчетыВУсловныхЕдиницах Тогда
			ВалютаУПД = ВалютаРеглУчета;
		Иначе
			Если ЭтоСФ ИЛИ НеТребуетсяПересчетВалюты Тогда
				ВалютаУПД = ДанныеШапки.ВалютаДокумента;
			Иначе
				ВалютаУПД = ВалютаРеглУчета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВалютаУПД) Тогда
		Контент.Currency = СокрЛП(ВалютаУПД.Код);
	Иначе
		Контент.Currency = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьИтогиПоТабличнойЧасти(Table, ИтогиПоТабличнойЧасти, ВсеСтрокиБезНДС, СуммаВключаетНДС, НДСИсчисляетсяНалоговымАгентом)
	
	Table.TotalNet = ИтогиПоТабличнойЧасти.Количество;
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
	Если СуммаВключаетНДС Тогда
		Table.TotalWithVatExcluded = ИтогиПоТабличнойЧасти.Сумма - ИтогиПоТабличнойЧасти.СуммаНДС;
	Иначе
		Table.TotalWithVatExcluded = ИтогиПоТабличнойЧасти.Сумма;
	КонецЕсли;
	
	Если Не НДСИсчисляетсяНалоговымАгентом Тогда
		
		Table.Vat = ИтогиПоТабличнойЧасти.СуммаНДС;
		
		Если СуммаВключаетНДС Тогда
			Table.Total = ИтогиПоТабличнойЧасти.Сумма;
		Иначе
			Table.Total = ИтогиПоТабличнойЧасти.Сумма + ИтогиПоТабличнойЧасти.СуммаНДС;
		КонецЕсли;
		
	Иначе
		
		Table.Total = 0;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьТаблицуТоваровКонтентаПоДаннымДокументаОснованияСчетаФактуры(Контент, ДанныеПоДокументу, ДополнительныеПараметры)
	
	ДанныеШапки = ДанныеПоДокументу.РезультатПоШапке.Выбрать();
	ДанныеШапки.Следующий();
	
	Если Контент.Table = Неопределено Тогда
		
		Table = Контракт_InvoiceTable970();
		Контент.Table = Table;
		ВсеСтрокиБезНДС = Истина;
		
	Иначе
		Table = Контент.Table;
		ВсеСтрокиБезНДС = XMLЗначение(Тип("Булево"), Table.WithoutVat);
	КонецЕсли;
	
	ТочностьЦены = ДополнительныеПараметры.ТочностьЦены;
	ТочностьКоличества = ДополнительныеПараметры.ТочностьКоличества;
	
	СуммаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	НДСИсчисляетсяНалоговымАгентом = ДанныеШапки.НДСИсчисляетсяНалоговымАгентом;
	
	РезультатСведенияПрослеживаемости = Неопределено;
	
	Если ДанныеПоДокументу.Свойство("РезультатСведенияПрослеживаемости", РезультатСведенияПрослеживаемости) Тогда
		СведенияПрослеживаемости = РезультатСведенияПрослеживаемости.Выгрузить();
		СведенияПрослеживаемости.Индексы.Добавить("ИдентификаторСтроки");
	КонецЕсли;
	
	РезультатПоТабличнойЧасти = ДанныеПоДокументу.РезультатПоТабличнойЧасти;
	ИтогиПоТабличнойЧасти = РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если НЕ ИтогиПоТабличнойЧасти.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПересчетВРубли = УПД970_ТребуетсяПересчетВРубли(ДанныеШапки, Контент.Function);
	
	Если ТребуетсяПересчетВРубли Тогда
		
		ДанныеДляПересчета = Новый_ДанныеДляПересчетаВалюты(ДанныеШапки);
		
		СуммаАвансов = УПД970_ПересчетВалюты_СуммаАвансов(ДанныеДляПересчета);
		
		Курс = УПД970_КурсВзаиморасчетов(ДанныеШапки.КурсВзаиморасчетов, ДанныеШапки.ВалютаДокумента, ДанныеШапки.Дата);
		Кратность = УПД970_КратностьВзаиморасчетов(
			ДанныеШапки.КратностьВзаиморасчетов,
			ДанныеШапки.ВалютаДокумента,
			ДанныеШапки.Дата
		);
		
	КонецЕсли;
	
	ВыводитьАртикулВместоКодаТовара = УПД970_ВыводитьАртикулВместоКодаТовара();
	
	ДанныеТабличнойЧасти = ИтогиПоТабличнойЧасти.Выбрать();
	Пока ДанныеТабличнойЧасти.Следующий() Цикл
		
		Item = Контракт_Item970();
		
		ПараметрыЗаполненияСтрокиТаблицыТоваров = Новый_ПараметрыЗаполненияСтрокиТаблицыТоваров();
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ТребуетсяПересчетВРубли = ТребуетсяПересчетВРубли;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.Курс = Курс;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.Кратность = Кратность;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.СуммаВключаетНДС = СуммаВключаетНДС;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.НДСИсчисляетсяНалоговымАгентом = НДСИсчисляетсяНалоговымАгентом;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.СуммаАвансов = СуммаАвансов;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ТочностьКоличества = ТочностьКоличества;
		ПараметрыЗаполненияСтрокиТаблицыТоваров.ВыводитьАртикулВместоКодаТовара = ВыводитьАртикулВместоКодаТовара;
		
		УПД970_ЗаполнитьСтрокуТаблицыТоваров(
			Item,
			ДанныеТабличнойЧасти,
			ПараметрыЗаполненияСтрокиТаблицыТоваров,
			ВсеСтрокиБезНДС);
		
		УПД970_ЗаполнитьCustomDeclaration(
			Item,
			ДанныеТабличнойЧасти.НомерГТД,
			ДанныеТабличнойЧасти.СтранаПроисхожденияКод,
			ДанныеТабличнойЧасти.СтранаПроисхожденияУчастникЕАЭС);
		
		Если ДанныеТабличнойЧасти.ПрослеживаемыйТовар Тогда
			УПД970_ЗаполнитьСведенияПрослеживаемости(Item, СведенияПрослеживаемости, ДанныеТабличнойЧасти);
			УПД970_УстановитьРегистрационныйНомерДляПрослеживаемогоТовара(Item.CustomDeclarations);
		КонецЕсли;
		
		УПД970_ОчиститьСтрануПроисхожденияСПустымГТД(Item);
		
		Item.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияItem(ДанныеТабличнойЧасти);
		
		Table.Items.Добавить(Item);
		
	КонецЦикла;
	
	Table.TotalNet = Table.TotalNet + ИтогиПоТабличнойЧасти.Количество;
	
	Если СуммаВключаетНДС Тогда
		СуммаИтогоБезНДС = ИтогиПоТабличнойЧасти.Сумма - ИтогиПоТабличнойЧасти.СуммаНДС;
	Иначе
		СуммаИтогоБезНДС = ИтогиПоТабличнойЧасти.Сумма;
	КонецЕсли;
	
	Table.TotalWithVatExcluded = Table.TotalWithVatExcluded + СуммаИтогоБезНДС;
	
	Если Не НДСИсчисляетсяНалоговымАгентом Тогда
		
		Table.Vat = Table.Vat + ИтогиПоТабличнойЧасти.СуммаНДС;
		
		Если СуммаВключаетНДС Тогда
			СуммаИтого = ИтогиПоТабличнойЧасти.Сумма;
		Иначе
			СуммаИтого = ИтогиПоТабличнойЧасти.Сумма + ИтогиПоТабличнойЧасти.СуммаНДС;
		КонецЕсли;
		
	Иначе
		
		СуммаИтого = 0;
		
	КонецЕсли;
	
	Table.Total = Table.Total + СуммаИтого;
	
	Если ТребуетсяПересчетВРубли Тогда
		
		Если СуммаАвансов <> 0 Тогда
			УПД970_ПересчетВалюты_ПересчитатьСуммыСУчетомАвансов(Table, СуммаАвансов, ДанныеШапки.Дата);
		КонецЕсли;
		
		УПД970_ПересчетВалюты_ПересчитатьИтоговыеСуммыУПД(Table);
		
	КонецЕсли;
	
	УПД970_ПересчитатьЦенуВТабличнойЧасти(Table.Items, ТочностьЦены);
	
	Table.WithoutVat = XMLСтрока(ВсеСтрокиБезНДС);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьExtendedOrganizationInfo(Content, ДанныеУчастникаЭДО, СведенияОбАдресе = Неопределено)
	
	Content.Type = УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО);
	
	Content.Name = ДанныеУчастникаЭДО.Наименование;
	
	Content.Inn = ДанныеУчастникаЭДО.ИНН;
	Content.Kpp = ДанныеУчастникаЭДО.КПП;
	Content.Okpo = ДанныеУчастникаЭДО.КодПоОКПО;
	
	Content.IndividualEntityRegistrationCertificate = ДанныеУчастникаЭДО.Свидетельство;
	
	Content.IndividualEntityRegistrationNumber = ДанныеУчастникаЭДО.ОГРНИП;
	Content.IndividualEntityRegistrationDate = ДанныеУчастникаЭДО.ДатаОГРНИП;
	
	Content.LegalEntityId = ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации;
	
	Content.Country = ДанныеУчастникаЭДО.СтранаНаименование;
	Content.CountryCode = ДанныеУчастникаЭДО.СтранаКод;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.Телефоны) Тогда
		Content.Phone.Добавить(ДанныеУчастникаЭДО.Телефоны);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеУчастникаЭДО.ЭлектроннаяПочта) Тогда
		Content.Email.Добавить(ДанныеУчастникаЭДО.ЭлектроннаяПочта);
	КонецЕсли;
	
	Content.BankName = ДанныеУчастникаЭДО.НаименованиеБанка;
	Content.BankAccountNumber = ДанныеУчастникаЭДО.НомерСчета;
	Content.CorrespondentAccount = ДанныеУчастникаЭДО.КоррСчет;
	Content.BankId = ДанныеУчастникаЭДО.БИК;
	
	Если ДанныеУчастникаЭДО.Адрес <> Неопределено Тогда
		Content.Address = УПД970_ЗаполненныйAddressInfo(ДанныеУчастникаЭДО.Адрес);
	Иначе
		Content.Address = УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе);
	КонецЕсли;
	
	Content.СлужебнаяИнформация.Ссылка = ДанныеУчастникаЭДО.Ссылка;
	
КонецПроцедуры

Функция УПД970_ExtendedOrganizationInfoType(ДанныеУчастникаЭДО)
	
	ТипЮрФизЛица = ДанныеУчастникаЭДО.ЮрФизЛицо;
	Страна = ДанныеУчастникаЭДО.Страна;
	
	СтранаРоссия = Справочники.КлассификаторСтранМира.Россия;
	
	ВидыЮрФизЛицПрото = ГенерацияXML_Перечисление_ВидыЮрФизЛиц();
	
	Если ТипЮрФизЛица = Перечисления.ЮрФизЛицо.ФизЛицо
		И ДанныеУчастникаЭДО.НеЯвляетсяРезидентом = Ложь Тогда
		
		Результат = ВидыЮрФизЛицПрото.ИндивидуальныйПредприниматель;
		
	ИначеЕсли ТипЮрФизЛица = Перечисления.ЮрФизЛицо.ЮрЛицо
		И ДанныеУчастникаЭДО.НеЯвляетсяРезидентом = Ложь Тогда
		
		Результат = ВидыЮрФизЛицПрото.ЮридическоеЛицо;
		
	ИначеЕсли ТипЮрФизЛица = Перечисления.ЮрФизЛицо.ФизЛицо
		И ДанныеУчастникаЭДО.НеЯвляетсяРезидентом = Истина Тогда
		
		Результат = ВидыЮрФизЛицПрото.ИностранныйГражданин;
		
	ИначеЕсли ТипЮрФизЛица = Перечисления.ЮрФизЛицо.ЮрЛицо
		И ДанныеУчастникаЭДО.НеЯвляетсяРезидентом = Истина Тогда
		
		Результат = ВидыЮрФизЛицПрото.ИностраннаяОрганизация;
		
	Иначе
		
		ТекстОшибки = НСтр("ru='Не удалось определить тип участника ЭДО.
				|Заполните корректные реквизиты участников ЭДО в базе 1С 
				|(организация, грузоотправитель, контрагент, грузополучатель)'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Результат = Контракт_DocumentShipments970();
	
	Результат.Name = НаименованиеДокумента;
	Результат.Number = НомерДокумента;
	Результат.Date = ДатаДокумента;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымПродавца(Контент)
	
	Контент.DocumentCreator = "";
	Контент.DocumentCreatorBase = "";
	
	Если Контент.Sellers.Количество() > 0 Тогда
		
		ПродавецИнфо = Контент.Sellers[0];
		Контент.DocumentCreator = НаименованиеИННКПП(ПродавецИнфо.Name, ПродавецИнфо.Inn, ПродавецИнфо.Kpp);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСоставителяДокументаПоДаннымАгента(Контент, СсылкаНаОбъект)
	
	Агент = ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, "Организация");
	РеквизитыАгента = УПД970_ДанныеУчастникаЭДО(Агент, Контент.DocumentDate);
	
	Контент.DocumentCreator = НаименованиеИННКПП(РеквизитыАгента.Наименование, РеквизитыАгента.ИНН, РеквизитыАгента.КПП);
	
	УПД970_ЗаполнитьСведенияОДокументеОснованияСоставителяФайла(Контент, СсылкаНаОбъект);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументеОснованияСоставителяФайла(Контент, СсылкаНаОбъект)

	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Номер", "ДоговорКонтрагента.Номер");
	РеквизитыДоговора.Вставить("Дата", "ДоговорКонтрагента.Дата");
	
	РеквизитыДоговора = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, РеквизитыДоговора);
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Номер)
		И ЗначениеЗаполнено(РеквизитыДоговора.Дата) Тогда
		
		НаименованиеДокумент = "Договор";
		
		Контент.DocumentCreatorBase = Контракт_DocumentCreatorBase();
		
		Контент.DocumentCreatorBase.Name = НаименованиеДокумент;
		Контент.DocumentCreatorBase.Number = РеквизитыДоговора.Номер;
		Контент.DocumentCreatorBase.Date = РеквизитыДоговора.Дата;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияДокументовОбОтгрузке(Контент, КоллекцияДокументов, ФункцияДокумента)
	
	ДокументыОтгрузки = УПД970_ДокументыОтгрузки(КоллекцияДокументов);
	
	СтрокиТаблицы = Контент.Table.Items;
	
	НаименованиеДокумента = УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента);
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		
		РеквизитыДокументовОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДокументыОтгрузки, "Дата");
		
		Для Каждого КлючЗначение Из РеквизитыДокументовОтгрузки Цикл
			
			ДокументОтгрузки = КлючЗначение.Ключ;
			РеквизитыДокумента = КлючЗначение.Значение;
			
			НомерДокумента = ПредставлениеНомера(ДокументОтгрузки);
			ДатаДокумента = РеквизитыДокумента.Дата;
			
			DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
			Контент.DocumentShipments.Добавить(DocumentShipment);
		
		КонецЦикла;
		
	Иначе
		
		НомерДокумента = Контент.DocumentNumber;
		ДатаДокумента = Контент.DocumentDate;
		
		DocumentShipment = УПД970_ЗаполненныйDocumentShipments970(НаименованиеДокумента, НомерДокумента, ДатаДокумента);
		Контент.DocumentShipments.Добавить(DocumentShipment);
		
		Контент.DocumentName = НаименованиеДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ДокументыОтгрузки(ИсходныеДокументы)
	
	Результат = Новый Массив;
	
	Для Каждого ИсходныйДокумент Из ИсходныеДокументы Цикл
		
		ДокументОтгрузки = УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент);
		
		Результат.Добавить(ДокументОтгрузки);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ИсправляемыйДокументОтгрузки(ИсходныйДокумент)
	
	Если ЗначениеЗаполнено(ИсходныйДокумент)
		И ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ДокументРеализации = ЗначениеРеквизитаОбъектаЛок(ИсходныйДокумент, "ДокументРеализации");
		Результат = УПД970_ИсправляемыйДокументОтгрузки(ДокументРеализации);
		
	Иначе
		
		Результат = ИсходныйДокумент;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция УПД790_НаименованиеДокументаОтгрузки(СтрокиТаблицы, ДокументыОтгрузки, ФункцияДокумента)
	
	НаименованияДокументов = НаименованияДокументовОтгрузки();
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФДОП() Тогда
		
		Результат = НаименованияДокументов.УПД;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументыОтгрузки) И ДокументыОтгрузки.Количество() > 1 Тогда
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		ЕстьУслуги = УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы);
		
		Если ЕстьТовары И НЕ ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Накладная;
			
		ИначеЕсли НЕ ЕстьТовары И ЕстьУслуги Тогда
			
			Результат = НаименованияДокументов.Акт;
			
		Иначе
			Результат = НаименованияДокументов.Документ;
		КонецЕсли;
		
	Иначе
		
		ЕстьТовары = УПД970_ВДокументеЕстьТовары(СтрокиТаблицы);
		
		Если ЕстьТовары Тогда
			Результат = НаименованияДокументов.Накладная;
		Иначе
			Результат = НаименованияДокументов.Акт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияДокументовОтгрузки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("УПД", "Универсальный передаточный документ");
	Результат.Вставить("Накладная", "Товарная накладная");
	Результат.Вставить("Акт", "Акт");
	Результат.Вставить("Документ", "Документ");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressInfo(СведенияОбАдресе)
	
	Перем Результат;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыАдресов = ГенерацияXML.Перечисление_ВидыАдресов();
	
	Результат = Контракт_AddressInfo970();
	
	Если ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		Результат.AddressSAR = УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе);
		Результат.Type = ВидыАдресов.АдресГАР;
		
	ИначеЕсли ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса) Тогда
		
		Результат.AddressRF = УПД970_ЗаполненныйAddressRF(СведенияОбАдресе);
		Результат.Type = ВидыАдресов.АдресРФ;
		
	Иначе
		
		Результат.AddressText = УПД970_ЗаполненныйAddressText(СведенияОбАдресе);
		Результат.Type = ВидыАдресов.АдресСтрокой;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressSAR(СведенияОбАдресе)
	
	КодыРегионов = ГенерацияXML.КодыРегионов();
	
	Результат = Контракт_AddressSARInfo();
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда
		Результат.ID = СведенияОбАдресе.ИдентификаторДома;
	Иначе
		Результат.ID = СведенияОбАдресе.ИдентификаторАдресногоОбъекта;
	КонецЕсли;
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	
	ПредставлениеРегиона = "";
	Если ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона) Тогда
		ПредставлениеРегиона = КодыРегионов.Получить(XMLЗначение(Тип("Число"), СведенияОбАдресе.КодРегиона));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеРегиона) Тогда
		
		ЧастиРегиона = Новый Массив;
		ЧастиРегиона.Добавить(СокрЛП(СведенияОбАдресе.Регион));
		ЧастиРегиона.Добавить(НРег(СведенияОбАдресе.РегионТипПолный));
		
		ПредставлениеРегиона = Общее_СоединитьСтроку(ЧастиРегиона, " ");
		
	КонецЕсли;
	
	Результат.Region = ПредставлениеРегиона;
	Результат.Region = СокрЛП(СведенияОбАдресе.Регион + " " + НРег(СведенияОбАдресе.РегионТипПолный));
	
	MunicipalDistrictCode = СведенияОбАдресе.КодМуниципальногоРайона;
	Если НЕ ЗначениеЗаполнено(MunicipalDistrictCode) Тогда
		MunicipalDistrictCode = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
	КонецЕсли;
	
	Результат.MunicipalDistrict = СведенияОбАдресе.МуниципальныйРайон;
	Результат.MunicipalDistrictCode = MunicipalDistrictCode;
	
	УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОНаселенномПункте(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОТерритории(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОУлице(Результат, СведенияОбАдресе);
	
	Результат.LandPlot = СведенияОбАдресе.НомерЗемельногоУчастка;
	
	УПД970_ЗаполнитьСведенияОЗданиях(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииЗдания(Результат, СведенияОбАдресе);
	УПД970_ЗаполнитьСведенияОПомещенииКвартиры(Результат, СведенияОбАдресе);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОГородеПоселенииРайоне(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Поселение) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.Поселение;
		
		Если ЗначениеЗаполнено(СведенияОбАдресе.КодПоселения) Тогда
			AddressSAR.SettlementCode = СведенияОбАдресе.КодПоселения;
		ИначеЕсли СведенияОбАдресе.ПоселениеТипКраткий = "г.п." Тогда
			AddressSAR.SettlementCode = "1";
		Иначе
			AddressSAR.SettlementCode = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.ВнутригородскойРайон) Тогда
		
		AddressSAR.Settlement = СведенияОбАдресе.ВнутригородскойРайон;
		AddressSAR.SettlementCode = "4";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОНаселенномПункте(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.НаселенныйПункт;
		AddressSAR.LocalityType = СведенияОбАдресе.НаселенныйПунктТипКраткий;
		
	ИначеЕсли ЗначениеЗаполнено(СведенияОбАдресе.Город) Тогда
		
		AddressSAR.Locality = СведенияОбАдресе.Город;
		AddressSAR.LocalityType = СведенияОбАдресе.ГородТипКраткий;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОТерритории(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Территория) Тогда
		AddressSAR.PlanningElement = СведенияОбАдресе.Территория;
		AddressSAR.PlanningElementType = СведенияОбАдресе.ТерриторияТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОУлице(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Улица) Тогда
		AddressSAR.StreetElement = СведенияОбАдресе.Улица;
		AddressSAR.StreetElementType = СведенияОбАдресе.УлицаТипКраткий;
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОЗданиях(AddressSAR, СведенияОбАдресе)
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание.Номер)
		И ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания) Тогда
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = СведенияОбАдресе.Здание.Номер;
		AddressObject.Type = СведенияОбАдресе.Здание.ТипЗдания;
		
	КонецЕсли;
	
	Для Каждого Корпус Из СведенияОбАдресе.Корпуса Цикл
		
		Если НЕ ЗначениеЗаполнено(Корпус.Номер)
			И НЕ ЗначениеЗаполнено(Корпус.ТипКорпуса) Тогда
			Продолжить;
		КонецЕсли;
		
		AddressObject = Контракт_AddressObjectNumberInfo();
		AddressSAR.Buildings.Добавить(AddressObject);
		
		AddressObject.Number = Корпус.Номер;
		AddressObject.Type = Корпус.ТипКорпуса;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииЗдания(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	
	Для Каждого ТипПомещения Из ТипыПомещенийЗдания Цикл
		
		Для Каждого Элемент Из Помещения Цикл
			
			Если ВРЕГ(Элемент.ТипПомещения) = ВРЕГ(ТипПомещения) Тогда
				
				AddressSAR.House = Элемент.Номер;
				AddressSAR.HouseType = Элемент.ТипПомещения;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПомещенииКвартиры(AddressSAR, СведенияОбАдресе)
	
	Помещения = СведенияОбАдресе.Помещения;
	Если НЕ ЗначениеЗаполнено(Помещения) Тогда
		Возврат;
	КонецЕсли;
	
	ПомещениеКвартиры = УПД970_ПолучитьПомещениеКвартиры(Помещения);
	
	Если ПомещениеКвартиры = Неопределено Тогда
		ПомещениеКвартиры = УПД970_ПолучитьНеклассифицированноеПомещение(Помещения);
	КонецЕсли;
	
	Если ПомещениеКвартиры <> Неопределено Тогда
		AddressSAR.Apartment = ПомещениеКвартиры.Номер;
		AddressSAR.ApartmentType = ПомещениеКвартиры.ТипПомещения;
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПолучитьПомещениеКвартиры(СписокПомещений)

	ПомещениеКвартиры = Неопределено;
	
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();
	Для Каждого ИмяТипаПомещения Из ТипыПомещенийКвартиры Цикл
		
		ПомещениеКвартиры = Ядро.МассивСтруктур_Найти(СписокПомещений, ИмяТипаПомещения, "ТипПомещения");
		
		Если ПомещениеКвартиры <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПомещениеКвартиры;

КонецФункции

Функция УПД970_ПолучитьНеклассифицированноеПомещение(СписокПомещений)
	
	Результат = Неопределено;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();

	Для Каждого Помещение Из СписокПомещений Цикл
		
		ТипПомещения = Помещение.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		Если Не ЭтоПомещениеЗдания
			И Не ЭтоПомещениеКвартиры Тогда
			Результат = Помещение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressRF(СведенияОбАдресе)
	
	Результат = Контракт_AddressRFInfo();
	
	Результат.ZipCode = СведенияОбАдресе.Индекс;
	Результат.RegionCode = СведенияОбАдресе.КодРегиона;
	Результат.Region = СведенияОбАдресе.Регион;
	Результат.Territory = СокрЛП(СведенияОбАдресе.Район);
	Результат.City = СоединитьЭлементыАдресногоОбъекта(СведенияОбАдресе.Город, СведенияОбАдресе.ГородСокращение);
	Результат.Locality = СоединитьЭлементыАдресногоОбъекта(СведенияОбАдресе.НаселенныйПункт, СведенияОбАдресе.НаселенныйПунктСокращение);
	Результат.Street = СоединитьЭлементыАдресногоОбъекта(СведенияОбАдресе.Улица, СведенияОбАдресе.УлицаСокращение);
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Здание) Тогда 
		СведенияОбАдресе.Здание.Свойство("Номер", Результат.Building);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Корпуса) Тогда 
		СведенияОбАдресе.Корпуса[0].Свойство("Номер", Результат.Block);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбАдресе.Помещения) Тогда 
		СведенияОбАдресе.Помещения[0].Свойство("Номер", Результат.Apartment);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ЗаполненныйAddressText(СведенияОбАдресе)
	
	Результат = Контракт_AddressTextInfo();
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	Если СведенияОбАдресе.ТипАдреса = МуниципальныйАдрес()
		И ЗначениеЗаполнено(СведенияОбАдресе.МуниципальноеПредставление) Тогда
		
		ПредставлениеАдреса = СведенияОбАдресе.МуниципальноеПредставление;
		
	КонецЕсли;
	
	Результат.AddressText = ПредставлениеАдреса;
	Результат.CountryCode = СведенияОбАдресе.КодСтраны;
	Результат.Country = СведенияОбАдресе.Страна;

	Возврат Результат;
	
КонецФункции

Функция УПД970_КодМуниципальногоРайона(ТипМуниципальногоРайона)
	
	Результат = "";
	
	Если ВРег(ТипМуниципальногоРайона) = ВРег("м.р-н") Тогда
		
		Результат = "1";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("г.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("ф.т.") Тогда
		
		Результат = "2";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер. г.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("вн.тер.г.") Тогда
		
		Результат = "3";
		
	ИначеЕсли ВРег(ТипМуниципальногоРайона) = ВРег("мун. окр.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("м.о.")
		Или ВРег(ТипМуниципальногоРайона) = ВРег("мун.окр.") Тогда
		
		Результат = "4";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОПередачеТоваров(Контент, ОснованияОтгрузки, ДополнительныеПараметры)
	
	TransferInfo = Контракт_TransferInfo970();
	Контент.TransferInfo = TransferInfo;
	
	TransferInfo.OperationInfo = "Товары переданы, работы сданы, услуги оказаны";
	
	Если Контент.Function <> ФункцияДокументаУПД_СЧФ() Тогда
		TransferInfo.TransferDate = УПД970_ПолучитьДатуОтгрузки(Контент);
	КонецЕсли;
	
	УПД970_ЗаполнитьTransferBases(TransferInfo, ОснованияОтгрузки, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьTransferBases(TransferInfo, ОснованияОтгрузки, ДополнительныеПараметры)
	
	Перем УказыватьОтсутствиеОснованияУПД;
	
	ДополнительныеПараметры.Свойство("УказыватьОтсутствиеОснованияУПД", УказыватьОтсутствиеОснованияУПД);
		
	Для Каждого РеквизитыОснования Из ОснованияОтгрузки Цикл
		
		РеквизитыЗаполнены = УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования);
		
		Если Не РеквизитыЗаполнены
			И УказыватьОтсутствиеОснованияУПД = Истина Тогда
			
			TransferInfo.TransferBases.Очистить();
			
			Прервать;
			
		Иначе
			
			TransferBase = Контракт_TransferBases970();
			
			TransferBase.Name = РеквизитыОснования.Наименование;
			TransferBase.Number = РеквизитыОснования.Номер;
			TransferBase.Date = РеквизитыОснования.Дата;
			TransferBase.СлужебнаяИнформация = УПД970_ЗаполненныйСлужебнаяИнформацияTransferBases970(РеквизитыОснования.ОснованиеСсылка);
			
			TransferInfo.TransferBases.Добавить(TransferBase);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если TransferInfo.TransferBases.Количество() = 0 Тогда
		TransferInfo.WithoutTransferBase = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияTransferBases970(ОснованиеСсылка)
	
	Результат = Контракт_СлужебнаяИнформацияTransferBases970();
	Результат.ОснованиеСсылка = ОснованиеСсылка;
	Результат.ПредставлениеВТекстеОшибки = "основании";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьДатуОтгрузки(Content)
	
	Результат = Content.DocumentDate;
	
	Для Каждого DocumentShipment Из Content.DocumentShipments Цикл
		Результат = DocumentShipment.Date;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОСотруднике(Контент, ДополнительныеПараметры)
	
	Перем ДанныеСотрудника;
	
	ДополнительныеПараметры.Свойство("ДанныеСотрудника", ДанныеСотрудника);
		
	ЕстьТовары = УПД970_ВДокументеЕстьТовары(Контент.Table.Items);
	
	Если ЗначениеЗаполнено(ДанныеСотрудника)
		И ЗначениеЗаполнено(ДанныеСотрудника.Должность)
		И Контент.Function <> ФункцияДокументаУПД_СЧФ() 
		И ЕстьТовары Тогда
		
		Employee = Контракт_Employee970();
		
		Employee.Surname = ДанныеСотрудника.Фамилия;
		Employee.FirstName = ДанныеСотрудника.Имя;
		Employee.Patronymic = ДанныеСотрудника.Отчество;
		Employee.EmployeePosition = ДанныеСотрудника.Должность;
		
		Контент.TransferInfo.Employee = Employee;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваров(Контент, ДокументОснования, ДополнительныеПараметры)
	
	Если ЭтоКонфигурацияБП() Тогда
		
		ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументу_БП20(ДокументОснования);
		РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузкиТоваров_БП20(ОснованиеОтгрузки);
		
	Иначе
		
		ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументу_УПП13(ДокументОснования);
		РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузкиТоваров_УПП13(ОснованиеОтгрузки);
		
	КонецЕсли;
	
	РеквизитыОснованийОтгрузки = ЗначениеВМассивЛок(РеквизитыОснования);
	
	УПД970_ЗаполнитьСведенияОПередачеТоваров(Контент, РеквизитыОснованийОтгрузки, ДополнительныеПараметры);
	
КонецПроцедуры

Функция УПД970_ВДокументеЕстьТовары(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Имущество Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеЕстьУслуги(СтрокиТаблицы)

	Результат = Ложь;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	МаксИндекс = СтрокиТаблицы.Количество() - 1;
	
	Для ТекИндекс = - МаксИндекс По 0 Цикл
		
		ItemMark = СтрокиТаблицы[ - ТекИндекс].ItemMark;
		
		Если ItemMark = ТипыНоменклатуры.Услуга
			ИЛИ ItemMark = ТипыНоменклатуры.Работа
			ИЛИ ItemMark = ТипыНоменклатуры.ИмущественныеПрава Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВДокументеТолькоУслуги(СтрокиТаблицы)
	
	Результат = Истина;
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если НЕ СтрокаТаблицы.ItemMark = ТипыНоменклатуры.Услуга Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ИзменитьСведенияОбУчастникахЭДОВДокументеУслуг(Контент)
	
	Контент.Shippers = Новый Массив;
	Контент.Consignees = Новый Массив;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьПризнакНаличияПрослеживаемыхТоваров(Контент)
	
	ЕстьПрослеживаемыеТовары = Ложь;
	
	Для Каждого Item Из Контент.Table.Items Цикл
		Если Item.ItemTracingInfos.Количество() > 0 Тогда
			ЕстьПрослеживаемыеТовары = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПризнакиПрослежкиИМаркировки = ГенерацияXML.Новый_ПризнакиПрослеживаемыхИМаркируемыхТоваровУПД970(ЕстьПрослеживаемыеТовары);
	
	ГенерацияXML.Заполнить_ПризнакиПрослеживаемыхИМаркируемыхТоваровДокументаУПД970(Контент, ПризнакиПрослежкиИМаркировки);

КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОМаркировке(Контент, СсылкаНаОбъект)
	
	Попытка
		
		РаботаСМаркировкой.ЗаполнитьСведенияОМаркировке970(Контент);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		ПодробнаяОшибка = Ядро.Общее_ПодставитьПараметрыВСтроку(
			"Не удалось заполнить сведения о маркировке по причине:
			|%1",
			ПодробноеПредставлениеОшибки(Ошибка)
		);
		
		ЗаписьЖурналаРегистрации(
			"Диадок.РаботаСМаркировкой",
			УровеньЖурналаРегистрации.Ошибка,
			СсылкаНаОбъект.Метаданные(),
			СсылкаНаОбъект,
			ПодробнаяОшибка
		);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьCustomDeclaration(Item, НомерГТД, СтранаПроисхожденияКод, СтранаПроисхожденияУчастникЕАЭС)
	
	Если СтранаПроисхожденияКод = ОсновнаяСтрана().Код Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКонфигурацияКА() Тогда
		
		Если Не ЗначениеЗаполнено(НомерГТД)
			И (Не ЗначениеЗаполнено(СтранаПроисхожденияКод)
			Или СтранаУчастникЕАЭС(СтранаПроисхожденияКод)) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(НомерГТД)
			И (Не ЗначениеЗаполнено(СтранаПроисхожденияКод)
			Или СтранаПроисхожденияУчастникЕАЭС) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	CustomDeclaration = Контракт_CustomDeclarations();
	CustomDeclaration.CountryCode = СтранаПроисхожденияКод;
	CustomDeclaration.DeclarationNumber = СокрЛП(НомерГТД);
	
	Item.CustomDeclarations.Добавить(CustomDeclaration);
	
КонецПроцедуры

Процедура УПД970_УстановитьРегистрационныйНомерДляПрослеживаемогоТовара(CustomDeclarations)
	
	Если ЗначениеЗаполнено(CustomDeclarations) Тогда
		
		Для каждого CustomDeclaration Из CustomDeclarations Цикл
			CustomDeclaration.DeclarationNumber = РегистрационныйНомерПрослеживаемогоТовара();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция РегистрационныйНомерПрослеживаемогоТовара()
	Возврат "Прослеж";
КонецФункции

Процедура УПД970_ОчиститьСтрануПроисхожденияСПустымГТД(Item)
	
	CustomDeclarations = Item.CustomDeclarations;
	
	Для Сч = -CustomDeclarations.ВГраница() По 0 Цикл
		
		CustomDeclaration = CustomDeclarations[-Сч];
		
		Если НЕ ЗначениеЗаполнено(CustomDeclaration.DeclarationNumber) Тогда
			CustomDeclarations.Удалить(-Сч);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_ЗаполненныйСлужебнаяИнформацияItem(СтрокаТаблицы)
	
	Результат = Контракт_СлужебнаяИнформацияСтроки();
	
	Результат.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	Результат.Номенклатура = СтрокаТаблицы.Товар;
	Результат.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
	Результат.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
	Результат.НомерГТД = СтрокаТаблицы.НомерГТД;
	Результат.ПрослеживаемыйТовар = СтрокаТаблицы.ПрослеживаемыйТовар;
	Результат.ДокументОтгрузки = СтрокаТаблицы.Ссылка;
	Результат.ИдентификаторСтроки = СтрокаТаблицы.ИдентификаторСтроки;
	Результат.ПутьКИдентификаторуСтроки = СтрокаТаблицы.ИмяТабличнойЧасти;
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		УПД970_ДополнитьСлужебнуюИнформациюItemДаннымиУПП13(Результат, СтрокаТаблицы);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСлужебнуюИнформациюItemДаннымиУПП13(Результат, СтрокаТаблицы)
	
	Результат.Серия = СтрокаТаблицы["СерияНоменклатуры"];
	Результат.Характеристика = СтрокаТаблицы["ХарактеристикаНоменклатуры"];
	
КонецПроцедуры

Функция УПД970_ДокументыОснованияСчетФактураВыданный(ДокументСсылка)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Основания.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК Основания
	|ГДЕ
	|	Основания.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОСведенияОбОрганизации(ДанныеШапки)
	
	ЭтоОПнаОтдельномБалансе = ЭтоОбособленноеПодразделениеНаОтдельномБалансе(ДанныеШапки.Организация);
	ЭтоОПнаОбщемБалансе = ЭтоОбособленноеПодразделениеНаОбщемБалансе(ДанныеШапки.ПодразделениеОрганизации);
	
	Если ЭтоОПнаОтдельномБалансе Тогда
		Организация = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Организация, "ГоловнаяОрганизация");
	Иначе
		Организация = ДанныеШапки.Организация;
	КонецЕсли;
	
	БанковскийСчетОрганизации = ДанныеШапки.БанковскийСчетОрганизации;
	
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Организация,
		ДанныеШапки.Дата,
		БанковскийСчетОрганизации);
		
	Если ЭтоОПнаОтдельномБалансе Тогда
			
		КПП = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Организация, "КПП");
		
	ИначеЕсли ЭтоОПнаОбщемБалансе Тогда
		
		КПП = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.ПодразделениеОрганизации, "КПП");
		
	Иначе
		
		КПП = СведенияОбОрганизации.КПП;
		
	КонецЕсли;
	
	СведенияОбОрганизации.КПП = КПП;
	
	Возврат СведенияОбОрганизации;
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОПродавце(Контент, ТаблицаДанныеШапки)
	
	// Продавец
	
	Для Каждого ДанныеШапки Из ТаблицаДанныеШапки Цикл
		
		СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОСведенияОбОрганизации(ДанныеШапки);
		
		Seller = Контракт_ExtendedOrganizationInfo970();
		
		УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбОрганизации);
		Seller.СлужебнаяИнформация.Ссылка = СведенияОбОрганизации.Ссылка;
		
		Контент.Sellers.Добавить(Seller);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОПокупателе(Контент, ДанныеШапки, КППКонтрагентаПоДокументу = Неопределено)

	// Покупатель
	ЭтоОПКонтрагентаНаОтдельномБалансе = ЭтоОбособленноеПодразделениеНаОтдельномБалансе(ДанныеШапки.Контрагент);
	
	Если ЭтоОПКонтрагентаНаОтдельномБалансе Тогда
		Контрагент = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Контрагент, "ГоловнойКонтрагент");
	Иначе
		Контрагент = ДанныеШапки.Контрагент;
	КонецЕсли;
	
	СведенияОКонтрагенте = УПД970_ДанныеУчастникаЭДОсЮрАдресом(
		Контрагент,
		ДанныеШапки.Дата);
		
	Если ЗначениеЗаполнено(КППКонтрагентаПоДокументу) Тогда
		КППКонтрагента = КППКонтрагентаПоДокументу;
	ИначеЕсли ЭтоОПКонтрагентаНаОтдельномБалансе Тогда
		КППКонтрагента = ЗначениеРеквизитаОбъектаЛок(ДанныеШапки.Контрагент, "КПП");
	Иначе
		КППКонтрагента = СведенияОКонтрагенте.КПП;
	КонецЕсли;
	
	СведенияОКонтрагенте.КПП = КППКонтрагента;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОКонтрагенте);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОКонтрагенте.Ссылка;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОГрузоотправителе(Контент, ТаблицаДанныеШапки)

	// Грузоотправитель
	Для Каждого ДанныеШапки Из ТаблицаДанныеШапки Цикл
		
		ЭтоОПнаОтдельномБалансе = ЭтоОбособленноеПодразделениеНаОтдельномБалансе(ДанныеШапки.Организация);
		ЭтоОПнаОбщемБалансе = ЭтоОбособленноеПодразделениеНаОбщемБалансе(ДанныеШапки.ПодразделениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.Грузоотправитель) Тогда
			
			СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
				ДанныеШапки.Грузоотправитель,
				ДанныеШапки.Дата);
				
		ИначеЕсли ЭтоОПнаОтдельномБалансе Тогда
			
			СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОсФактАдресом(
				ДанныеШапки.Организация,
				ДанныеШапки.Дата);
			
		ИначеЕсли ЭтоОПнаОбщемБалансе Тогда
			
			СведенияОГрузоотправителе = УПД970_СведенияОПодразделенииОрганизации(
				ДанныеШапки.Организация,
				ДанныеШапки.ПодразделениеОрганизации,
				ДанныеШапки.Дата);
			
		ИначеЕсли ДанныеШапки.Грузоотправитель <> Неопределено Тогда
			
			СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДОСведенияОбОрганизации(ДанныеШапки);
			
		Иначе
			
			СведенияОГрузоотправителе = Неопределено;
			
		КонецЕсли;
		
		Если СведенияОГрузоотправителе <> Неопределено Тогда
			
			Shipper = Контракт_Shipper970();
			Shipper.SameAsSeller = Ложь;
			
			СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДОСведенияОбОрганизации(ДанныеШапки);
			
			Если СведенияОГрузоотправителе.Ссылка = СведенияОбОрганизации.Ссылка Тогда
				
				Shipper.SameAsSeller = Истина;
				
			Иначе
				
				ShipperInfo = Контракт_ExtendedOrganizationInfo970();
				УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, СведенияОГрузоотправителе);
				ShipperInfo.СлужебнаяИнформация.Ссылка = СведенияОГрузоотправителе.Ссылка;
				Shipper.OrganizationInfo = ShipperInfo;
				
			КонецЕсли;
			
			Контент.Shippers.Добавить(Shipper);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОГрузополучателе(Контент, ДанныеШапки)

	// Грузополучатель
	
	Если ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеГрузополучателя(
			ДанныеШапки.Грузополучатель,
			ДанныеШапки.Дата,
			ДанныеШапки.АдресДоставки);
		
	ИначеЕсли ДанныеШапки.Грузополучатель <> Неопределено Тогда
		
		СведенияОГрузополучателе = УПД970_ДанныеГрузополучателя(
			ДанныеШапки.Контрагент,
			ДанныеШапки.Дата,
			ДанныеШапки.АдресДоставки);
			
	Иначе
		
		СведенияОГрузополучателе = Неопределено;
		
	КонецЕсли;
	
	Если СведенияОГрузополучателе <> Неопределено Тогда
		
		Consignee = Контракт_ExtendedOrganizationInfo970();
		Контент.Consignees.Добавить(Consignee);

		УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОГрузополучателе);
		
		Consignee.СлужебнаяИнформация.Ссылка = СведенияОГрузополучателе.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОбУчастникахЭДОВнутреннегоДО(Контент, ДанныеШапки)
	
	СведенияОбУчастникахЭДО = УПД970_СведенияОбУчастникахВнутреннегоЭДО(ДанныеШапки);
	
	Seller = Контракт_ExtendedOrganizationInfo970();
	Контент.Sellers.Добавить(Seller);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Seller, СведенияОбУчастникахЭДО.Организация);
	Seller.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Организация.Ссылка;
	
	Buyer = Контракт_ExtendedOrganizationInfo970();
	Контент.Buyers.Добавить(Buyer);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Buyer, СведенияОбУчастникахЭДО.Контрагент);
	Buyer.СлужебнаяИнформация.Ссылка = СведенияОбУчастникахЭДО.Контрагент.Ссылка;
	
	Shipper = Контракт_Shipper970();
	Shipper.SameAsSeller = Ложь;
	Контент.Shippers.Добавить(Shipper);
	ShipperInfo = Контракт_ExtendedOrganizationInfo970();
	Shipper.OrganizationInfo = ShipperInfo;
	УПД970_ЗаполнитьExtendedOrganizationInfo(ShipperInfo, СведенияОбУчастникахЭДО.Грузоотправитель);
	ShipperInfo.Department = ДанныеШапки.СкладОтправительПредставление;
	
	Consignee = Контракт_ExtendedOrganizationInfo970();
	Контент.Consignees.Добавить(Consignee);
	УПД970_ЗаполнитьExtendedOrganizationInfo(Consignee, СведенияОбУчастникахЭДО.Грузополучатель);
	Consignee.Department = ДанныеШапки.СкладПолучательПредставление;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьСведенияОДокументахОплатыСчетаФактуры(Контент, РезультатПоДокументамОплаты)
	
	ВыборкаПоДокументамОплаты = РезультатПоДокументамОплаты.Выбрать();
	Пока ВыборкаПоДокументамОплаты.Следующий() Цикл
		
		PaymentDocument = Контракт_PaymentDocumentInfo();
		
		PaymentDocument.Number = ВыборкаПоДокументамОплаты.НомерДокумента;
		PaymentDocument.Date = ВыборкаПоДокументамОплаты.ДатаДокумента;
		
		Контент.PaymentDocuments.Добавить(PaymentDocument);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ЗаполнитьИдентификаторГосКонтракта(Контент, ДанныеШапки)

	Если ЭтоКонфигурацияБП() Тогда
		УПД970_ЗаполнитьИдентификаторГосКонтракта_БП20(Контент, ДанныеШапки)
	Иначе
		УПД970_ЗаполнитьИдентификаторГосКонтракта_УПП13(Контент, ДанныеШапки)
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_СведенияОбУчастникахВнутреннегоЭДО(ДанныеШапки)
	
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДО(ДанныеШапки.Организация, ДанныеШапки.Дата);
	
	ЭтоОбособленноеПодразделение = ЭтоОбособленноеПодразделениеНаОбщемБалансе(ДанныеШапки.ПодразделениеОтправитель);
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		СведенияОГрузоотправителе = УПД970_СведенияОПодразделенииОрганизации(
			ДанныеШапки.Организация,
			ДанныеШапки.ПодразделениеОтправитель,
			ДанныеШапки.Дата
		);
		СведенияОГрузоотправителе.Адрес = УПД970_СведенияОбАдресеСклада(ДанныеШапки.ПодразделениеОтправитель);
		
	Иначе
		
		СведенияОГрузоотправителе = УПД970_ДанныеУчастникаЭДО(
			ДанныеШапки.Организация,
			ДанныеШапки.Дата
		);
		Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
			СведенияОГрузоотправителе.Адрес = УПД970_СведенияОбАдресеСклада(ДанныеШапки.СкладОтправитель);
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоОбособленноеПодразделение = ЭтоОбособленноеПодразделениеНаОбщемБалансе(ДанныеШапки.ПодразделениеПолучатель);
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		СведенияОГрузополучателе = УПД970_СведенияОПодразделенииОрганизации(
			ДанныеШапки.Организация,
			ДанныеШапки.ПодразделениеПолучатель,
			ДанныеШапки.Дата
		);
		СведенияОГрузополучателе.Адрес = УПД970_СведенияОбАдресеСклада(ДанныеШапки.ПодразделениеПолучатель);
		
	Иначе
		
		СведенияОГрузополучателе = УПД970_ДанныеУчастникаЭДО(
			ДанныеШапки.Организация,
			ДанныеШапки.Дата
		);
		Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
			СведенияОГрузополучателе.Адрес = УПД970_СведенияОбАдресеСклада(ДанныеШапки.СкладПолучатель);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = УПД970_Контракт_УчастникиЭДО();
	Результат.Организация = СведенияОбОрганизации;
	Результат.Контрагент = СведенияОбОрганизации;
	Результат.Грузоотправитель = СведенияОГрузоотправителе;
	Результат.Грузополучатель = СведенияОГрузополучателе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсЮрАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОбЮридическомАдресе(Ссылка);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДОсФактАдресом(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет);
	
	СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка);
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеГрузополучателя(Ссылка, ДатаСведений, Знач АдресДоставки)
	
	Результат = УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений);
	
	АдресДоставки = СокрЛП(АдресДоставки);
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		СведенияОбАдресе = УПД970_СведенияОбАдресеДоставки(Ссылка, АдресДоставки);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		СведенияОбАдресе = УПД970_СведенияОФактическомАдресе(Ссылка);
	КонецЕсли;
	
	Результат.Адрес = СведенияОбАдресе;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_Контракт_УчастникиЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Грузоотправитель");
	Результат.Вставить("Грузополучатель");

	Возврат Результат;
	
КонецФункции

Функция УПД970_ПредставлениеХарактеристикиИСерии(ДанныеТабличнойЧасти)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
		Результат = " (" + стрЗаменить(ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры, "<>", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеТабличнойЧасти.СерияНоменклатуры) Тогда
		
		ПредставлениеСерии = стрЗаменить(ДанныеТабличнойЧасти.СерияНоменклатуры, "<>", "");
		
		Результат = ?(стрДлина(Результат) = 0, " (", Результат + "; ") + ПредставлениеСерии;
		
	КонецЕсли;
	
	Результат = ?(Результат = "", "", Результат + ")");
	
	Возврат Результат;
	
КонецФункции

//{ УПД970 ПОЛУЧЕНИЕ ИСХОДНЫХ ДАННЫХ

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры(ДокументСсылка, СчетФактура, ФункцияДокумента)
	
	Если ЭтоКонфигурацияБП() Тогда
		Результат = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_БП20(ДокументСсылка, СчетФактура, ФункцияДокумента);
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		Результат = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_КА11(ДокументСсылка, СчетФактура, ФункцияДокумента);
	Иначе
		Результат = УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_УПП13(ДокументСсылка, СчетФактура, ФункцияДокумента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_РеализацияТоваровУслуг(ДокСсылка, ФункцияДокумента)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_БП20(ФункцияДокумента));
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиРеализацииТоваровУслуг_БП20());
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_КА11(ФункцияДокумента));
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_УПП13(ФункцияДокумента));
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиРеализацииТоваровУслуг_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_КорректировкаРеализации(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиКорректировкиРеализации_БП20());
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_КА11());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиКорректировкиРеализации_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ВозвратуТоваровПоставщику(ДокСсылка, ФункцияДокумента)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_БП20(ФункцияДокумента));
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_КА11(ФункцияДокумента));
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_УПП13(ФункцияДокумента));
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиВозвратаТоваровПоставщику_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ПередачеОС(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПередачиОС_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиПередачиОС_БП20());
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПередачиОС_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_КА11());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПередачиОС_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиПередачиОС_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ОтчетКомитентуОПродажах(ДокСсылка, СчетФактура)
	
	Запросы = Новый Массив;
	
	СчетФактураОтИмениПродавца_БП20 = ЭтоСчетФактураОтИмениПродавца_БП20(СчетФактура);
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Если СчетФактураОтИмениПродавца_БП20 Тогда
			
			Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОтИмениПродавца_БП20());
			Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОтИмениПродавца_БП20());
			
		Иначе
			
			Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОПродажах_БП20());
			Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОПродажах_БП20());
			
		КонецЕсли;
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОПродажах_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОПродажах_УПП13());
		
	КонецЕсли;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = Общее_СоединитьСтроку(Запросы, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатыЗапроса[0]);
	
	Если СчетФактураОтИмениПродавца_БП20 Тогда
		
		Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[4]);
		
	Иначе
		
		Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[1]);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_АктОбОказанииПроизводственныхУслуг(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиАктаОбОказанииПроизводственныхУслуг_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиАктаОбОказанииПроизводственныхУслуг_БП20());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиАктаОбОказанииПроизводственныхУслуг_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиАктаОбОказанииПроизводственныхУслуг_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_РеализацияУслугПоПереработке(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиРеализацииУслугПоПереработке_БП20());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличнойЧастиРеализацииУслугПоПереработке_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_СчетФактураВыданный(ДокСсылка)
	
	ДокументыОснования = УПД970_ДокументыОснованияСчетФактураВыданный(ДокСсылка);
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный();
	ТекстЗапросаСведенийОДокументахОплаты = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный();

	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаСведенийОДокументахОплаты);
	
	ТекстЗапроса = Общее_СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатЗапроса[0]);
	Результат.Вставить("РезультатПоДокументамОплаты", РезультатЗапроса[1]);
	Результат.Вставить("ДокументыОснования", ДокументыОснования);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанныеПоСчетФактураВыданныйНаАванс(ДокСсылка)

	Если ЭтоКонфигурацияБП() Тогда
		ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_БП20();
		ТекстЗапросаТабличныеЧасти = УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_БП20();
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_КА11();
		ТекстЗапросаТабличныеЧасти = УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_КА11();
	Иначе
		ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_УПП13();
		ТекстЗапросаТабличныеЧасти = УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_УПП13();
	КонецЕсли;
	
	ТекстЗапросаСведенийОДокументахОплаты = УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеЧасти);
	ТекстыЗапросов.Добавить(ТекстЗапросаСведенийОДокументахОплаты);
	
	ТекстЗапроса = Общее_СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатыЗапроса[0]);
	Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[1]);
	Результат.Вставить("РезультатПоДокументамОплаты", РезультатыЗапроса[2]);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ОтчетКомиссионераОПродажах(ДокСсылка, СчетФактура)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_БП20());
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_КА11());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхПрослеживаемостиОтчетаКомиссионераОПродажах_УПП13());
		
	КонецЕсли;
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = Общее_СоединитьСтроку(Запросы, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатыЗапроса[0]);
	Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[1]);
	
	КоличествоЗапросовВПакетеСДанными = 4;
	
	Если РезультатыЗапроса.Количество() = КоличествоЗапросовВПакетеСДанными Тогда
		Результат.Вставить("РезультатСведенияПрослеживаемости", РезультатыЗапроса[3]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ПеремещениеТоваров(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_БП20());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_БП20());
		
	ИначеЕсли ЭтоКонфигурацияКА() Тогда
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_КА11());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_КА11());
		
	Иначе
		
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_УПП13());
		Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_УПП13());
		
	КонецЕсли;
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхОДокументахОплатыСчетФактурыВыданный()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента КАК ДатаДокумента,
	|	ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента КАК НомерДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДатаНомерДокументовОплаты КАК ДатаНомерДокументовОплаты
	|ГДЕ
	|	ДатаНомерДокументовОплаты.Ссылка = &Ссылка
	|	И ДатаНомерДокументовОплаты.ДатаПлатежноРасчетногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаНомерДокументовОплаты.НомерПлатежноРасчетногоДокумента <> """"";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданный()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Исправление КАК Исправление,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.КППКонтрагента КАК КППКонтрагента,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактураВыданный.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыДоговораПоДаннымШапкиДокумента(ДанныеШапки)

	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка", ДанныеШапки.ДоговорКонтрагента);
	Результат.Вставить("Номер", ДанныеШапки.ДоговорДата);
	Результат.Вставить("Дата", ДанныеШапки.ДоговорНомер);
	Результат.Вставить("ВидДоговора", ДанныеШапки.ВидДоговора);
	Результат.Вставить("ВалютаВзаиморасчетов", ДанныеШапки.ВалютаВзаиморасчетов);
	Результат.Вставить("РасчетыВУсловныхЕдиницах", ДанныеШапки.РасчетыВУсловныхЕдиницах);
	Результат.Вставить("НДСИсчисляетсяНалоговымАгентом", ДанныеШапки.НДСИсчисляетсяНалоговымАгентом);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ОтражениеНачисленияНДС(ДокСсылка)
	
	Запросы = Новый Массив;
	
	Запросы.Добавить(УПД970_ТекстЗапросаДанныхШапкиОтражениеНачисленияНДС());
	Запросы.Добавить(УПД970_ТекстЗапросаДанныхТабличныхЧастейОтражениеНачисленияНДС());
	
	Результат = УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

//{ Функции и процедуры для УПП 1.3

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_УПП13(ДокументСсылка, СчетФактура, ФункцияДокумента)

	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанные_РеализацияТоваровУслуг(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_КорректировкаРеализации(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомитентуОПродажах(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_ИсходныеДанные_ВозвратуТоваровПоставщику(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоПередачаОС(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_ПередачеОС(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанные_АктОбОказанииПроизводственныхУслуг(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		Результат = УПД970_ИсходныеДанные_РеализацияУслугПоПереработке(ДокументСсылка);
			
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомиссионераОПродажах(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтражениеНачисленияНДС(ДокументСсылка);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваровПоСчетФактуре_УПП13(Контент, ДокументыОснования, ДополнительныеПараметры)
	
	ОснованияОтгрузки = Новый Массив;
	Для Каждого ДокументОснования Из ДокументыОснования Цикл
		
		ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументу_УПП13(ДокументОснования);
		Если ЗначениеЗаполнено(ОснованиеОтгрузки)
			И ОснованияОтгрузки.Найти(ОснованиеОтгрузки) = Неопределено Тогда
			ОснованияОтгрузки.Добавить(ОснованиеОтгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	РеквизитыОснованийОтгрузки = Новый Массив;
	Для Каждого ОснованиеОтгрузки Из ОснованияОтгрузки Цикл
		
		РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузкиТоваров_УПП13(ОснованиеОтгрузки);
		РеквизитыОснованийОтгрузки.Добавить(РеквизитыОснования);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьСведенияОПередачеТоваров(Контент, РеквизитыОснованийОтгрузки, ДополнительныеПараметры);

КонецПроцедуры

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_УПП13()
	
	// ПодразделениеОрганизации появилось в УПП 1.3.221
	
	ИмяРеквизитаПодразделениеОрганизации = "ПодразделениеОрганизации";
	ЕстьПодразделениеОрганизации = ЕстьРеквизитОбъектаЛок(
		ИмяРеквизитаПодразделениеОрганизации,
		Метаданные.Документы.РеализацияТоваровУслуг
	);
	
	Результат =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Ссылка КАК Ссылка,
		|	Т.Дата КАК Дата,
		|	Т.ВалютаДокумента КАК ВалютаДокумента,
		|	Т.Организация КАК Организация,
		|	Т.Контрагент КАК Контрагент,
		|	Т.Грузоотправитель КАК Грузоотправитель,
		|	Т.Грузополучатель КАК Грузополучатель,
		|	Т.АдресДоставки КАК АдресДоставки,
		|	Т.Сделка КАК Сделка,
		|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ВЫБОР
		|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
		|		ИНАЧЕ Т.БанковскийСчетОрганизации
		|	КОНЕЦ КАК БанковскийСчетОрганизации,
		|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
		|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
		|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
	
	Если ЕстьПодразделениеОрганизации Тогда
		
		Результат = СтрЗаменить(
				Результат,
				"НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации",
				"Т.ПодразделениеОрганизации КАК ПодразделениеОрганизации");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_УПП13(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТоварыУслуги =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	&НомерГТД КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	&ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	3 КАК Порядок,
	|	&УслугиИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Услуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	"""" КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул ТоварАртикул,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Цена КАК Цена,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Услуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка";
	
	МетаданныеТовары = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары;
	МетаданныеУслуги = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Услуги;
	
	ВыражениеСтранаСсылка = "ЕСТЬNULL(Товары.СтранаПроисхождения, Товары.СерияНоменклатуры.СтранаПроисхождения)";
	ВыражениеСтранаКод = "ЕСТЬNULL(Товары.СтранаПроисхождения.Код, Товары.СерияНоменклатуры.СтранаПроисхождения.Код)";
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(Товары.СтранаПроисхождения.УчастникЕАЭС, Товары.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС)";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТовары) Тогда // ниже 1.3.182
		ВыражениеСтранаСсылка = "ЕСТЬNULL(Товары.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))";
		ВыражениеСтранаКод = "ЕСТЬNULL(Товары.СерияНоменклатуры.СтранаПроисхождения.Код, """")";
		ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(Товары.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	КонецЕсли;
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйКомплект = "Товары.ПрослеживаемыйКомплект";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйКомплект", МетаданныеТовары) Тогда
		ВыражениеПрослеживаемыйКомплект = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "Товары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТовары) Тогда
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеТоварыИдентификаторСтроки = "Товары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТовары) Тогда
		 // ИдентификаторСтроки в товарах появился с версии 1.3.182
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеУслугиИдентификаторСтроки = "Услуги.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеУслуги) Тогда
		// ИдентификаторСтроки в услугах появился с версии 1.3.217
		ВыражениеУслугиИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеНомерГТД = "ВЫБОР
	|		КОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер) = """"
	|			ТОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.Код, СпрНоменклатура.НомерГТД.Код)
	|		ИНАЧЕ ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер)
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&ПрослеживаемыйКомплект", ВыражениеПрослеживаемыйКомплект);
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&УслугиИдентификаторСтроки", ВыражениеУслугиИдентификаторСтроки);
	Замены.Добавить("&НомерГТД", ВыражениеНомерГТД);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапросаТоварыУслуги = СтрЗаменить(ТекстЗапросаТоварыУслуги, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТоварыУслуги);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	2 КАК Порядок,
		|	"""" КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	"""" КАК ТоварКодТНВЭД,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	"""" КАК НомерГТД,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	0 КАК ЕстьНДС,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	ВозвратнаяТара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиРеализацииТоваровУслуг_УПП13()
	
	ОбъектМетаданных = Метаданные.Документы.РеализацияТоваровУслуг;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее_УПП13(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_УПП13()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.Сделка КАК Сделка,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ Т.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Т.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_УПП13()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	&НомерГТД КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	&ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	&УслугиИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	Услуги.Сумма,
	|	Услуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	МетаданныеТовары = Метаданные.Документы.КорректировкаРеализации.ТабличныеЧасти.Товары;
	МетаданныеУслуги = Метаданные.Документы.КорректировкаРеализации.ТабличныеЧасти.Услуги;
	
	ВыражениеПрослеживаемыйКомплект = "Товары.ПрослеживаемыйКомплект";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйКомплект", МетаданныеТовары) Тогда
		ВыражениеПрослеживаемыйКомплект = "ЛОЖЬ"; // 1.3.188 и ниже
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СерииНоменклатуры.СтранаПроисхождения
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА Товары.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ";
	ВыражениеСтранаКод = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.Код
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.Код
	|		ИНАЧЕ КлассификаторСтранМира.Код
	|	КОНЕЦ";
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.УчастникЕАЭС
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМира.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТовары) Тогда // ниже 1.3.182
		ВыражениеСтранаСсылка = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения, СпрНоменклатура.СтранаПроисхождения)";
		ВыражениеСтранаКод = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.Код, КлассификаторСтранМира.Код)";
		ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, КлассификаторСтранМира.УчастникЕАЭС)";
	КонецЕсли;
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "Товары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТовары) Тогда
		// ПрослеживаемыйТовар в товарах появился с версии 1.3.182
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеТоварыИдентификаторСтроки = "Товары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТовары) Тогда
		// ИдентификаторСтроки в товарах появился с версии 1.3.182
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеУслугиИдентификаторСтроки = "Услуги.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеУслуги) Тогда
		// ИдентификаторСтроки в услугах появился с версии 1.3.217
		ВыражениеУслугиИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеНомерГТД = "ВЫБОР
	|		КОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер) = """"
	|			ТОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.Код, СпрНоменклатура.НомерГТД.Код)
	|		ИНАЧЕ ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер)
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ПрослеживаемыйКомплект", ВыражениеПрослеживаемыйКомплект);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&УслугиИдентификаторСтроки", ВыражениеУслугиИдентификаторСтроки);
	Замены.Добавить("&НомерГТД", ВыражениеНомерГТД);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиКорректировкиРеализации_УПП13()
	
	ОбъектМетаданных = Метаданные.Документы.КорректировкаРеализации;
	
	Пустышка =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК КоличествоПрослеживаемости,
	|	"""""""" КАК ИдентификаторСтроки,
	|	0 КАК Сумма,
	|	"""""""" КАК ЕдиницаИзмеренияКод,
	|	"""""""" КАК ЕдиницаИзмеренияНаименование,
	|	"""""""" КАК НомерРНПТ";
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(Пустышка);
	
	Замены = Новый СписокЗначений;
	
	МетаданныеТЧ = ОбъектМетаданных.ТабличныеЧасти.Найти("СведенияПрослеживаемости");
	
	Если МетаданныеТЧ <> Неопределено Тогда // 1.3.182 и выше
		
		ОсновнойЗапрос =
		"ВЫБРАТЬ
		|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	&ВыражениеСумма КАК Сумма,
		|	&ВыражениеЕдИзмКод КАК ЕдиницаИзмеренияКод,
		|	&ВыражениеЕдИзмНаименование КАК ЕдиницаИзмеренияНаименование,
		|	НомераГТД.Код КАК НомерРНПТ
		|ИЗ
		|	Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК СведенияПрослеживаемости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
		|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
		|ГДЕ
		|	СведенияПрослеживаемости.Ссылка = &Ссылка
		|	&ВыражениеЭтоСтрокаСИсходнымиРНПТ";
		
		ВыражениеСумма = "СведенияПрослеживаемости.Сумма";
		Если Не ЕстьРеквизитОбъектаЛок("Сумма", МетаданныеТЧ) Тогда // 1.3.188 и ниже
			ВыражениеСумма = "0";
		КонецЕсли;
		
		ВыражениеЕдИзмКод =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Код
		|	ИНАЧЕ ""796""
		|КОНЕЦ";
		
		ВыражениеЕдИзмНаименование =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Наименование
		|	ИНАЧЕ ""шт""
		|КОНЕЦ";
		
		Если Не ЕстьРеквизитОбъектаЛок("Номенклатура", МетаданныеТЧ) Тогда // 1.3.188 и ниже
			ВыражениеЕдИзмКод = """796""";
			ВыражениеЕдИзмНаименование = """шт""";
		КонецЕсли;
		
		ВыражениеЭтоСтрокаСИсходнымиРНПТ = "И НЕ СведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ";
		
		Если НЕ ЕстьРеквизитОбъектаЛок("ЭтоСтрокаСИсходнымиРНПТ", МетаданныеТЧ) Тогда // 1.3.188 и ниже
			ВыражениеЭтоСтрокаСИсходнымиРНПТ = "";
		КонецЕсли;
		
		Замены.Добавить("&ВыражениеСумма", ВыражениеСумма);
		Замены.Добавить("&ВыражениеЕдИзмКод", ВыражениеЕдИзмКод);
		Замены.Добавить("&ВыражениеЕдИзмНаименование", ВыражениеЕдИзмНаименование);
		Замены.Добавить("&ВыражениеЭтоСтрокаСИсходнымиРНПТ", ВыражениеЭтоСтрокаСИсходнымиРНПТ);
		
		ЧастиЗапроса.Добавить(ОсновнойЗапрос);
		
	КонецЕсли;
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, ТекстЗапроса_ОбъединитьВсе());
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_УПП13()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
	|	ВозвратТоваровПоставщику.Номер КАК Номер,
	|	ВозвратТоваровПоставщику.Дата КАК Дата,
	|	ВозвратТоваровПоставщику.Организация КАК Организация,
	|	ВозвратТоваровПоставщику.Сделка КАК Сделка,
	|	ВозвратТоваровПоставщику.Подразделение КАК Подразделение,
	|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ВозвратТоваровПоставщику.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ВозвратТоваровПоставщику.Ответственный КАК Ответственный,
	|	ВозвратТоваровПоставщику.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВозвратТоваровПоставщику.Грузоотправитель КАК Грузоотправитель,
	|	ВозвратТоваровПоставщику.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Организации.ОсновнойБанковскийСчет
	|		ИНАЧЕ ВозвратТоваровПоставщику.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВозвратТоваровПоставщику.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВозвратТоваровПоставщику.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВозвратТоваровПоставщику.Организация = Организации.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_УПП13(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТоварыОборудование =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Ссылка КАК Ссылка,
	|	&ТоварыИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	&ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	&НомерГТД КАК НомерГТД
	|
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Оборудование"",
	|	2,
	|	Оборудование.Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	Оборудование.ЕдиницаИзмерения,
	|	Оборудование.Количество,
	|	Оборудование.Цена,
	|	Оборудование.СтавкаНДС,
	|	Оборудование.СуммаНДС,
	|	Оборудование.Сумма,
	|	Оборудование.НомерСтроки,
	|	Оборудование.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	""Оборудование"",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код,
	|	""""
	|
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Оборудование КАК Оборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Оборудование.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Оборудование.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|
	|ГДЕ
	|	Оборудование.Ссылка = &Ссылка";
	
	МетаданныеТовары = Метаданные.Документы.ВозвратТоваровПоставщику.ТабличныеЧасти.Товары;
	
	ВыражениеПрослеживаемыйКомплект = "Товары.ПрослеживаемыйКомплект";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйКомплект", МетаданныеТовары) Тогда
		ВыражениеПрослеживаемыйКомплект = "ЛОЖЬ"; // 1.3.188 и ниже
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СерииНоменклатуры.СтранаПроисхождения
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА Товары.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ";
	ВыражениеСтранаКод = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.Код
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.Код
	|		ИНАЧЕ КлассификаторСтранМира.Код
	|	КОНЕЦ";
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.УчастникЕАЭС
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМира.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТовары) Тогда // ниже 1.3.182
		ВыражениеСтранаСсылка = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения, СпрНоменклатура.СтранаПроисхождения)";
		ВыражениеСтранаКод = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.Код, КлассификаторСтранМира.Код)";
		ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, КлассификаторСтранМира.УчастникЕАЭС)";
	КонецЕсли;
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "Товары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТовары) Тогда
		// ПрослеживаемыйТовар в товарах появился с версии 1.3.182
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеТоварыИдентификаторСтроки = "Товары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТовары) Тогда
		// ИдентификаторСтроки в товарах появился с версии 1.3.182
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеНомерГТД = "ВЫБОР
	|		КОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер) = """"
	|			ТОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.Код, СпрНоменклатура.НомерГТД.Код)
	|		ИНАЧЕ ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер)
	|	КОНЕЦ";
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&ПрослеживаемыйКомплект", ВыражениеПрослеживаемыйКомплект);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	Замены.Добавить("&НомерГТД", ВыражениеНомерГТД);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапросаТоварыОборудование = СтрЗаменить(
			ТекстЗапросаТоварыОборудование,
			Элемент.Значение,
			Элемент.Представление);
	КонецЦикла;
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТоварыОборудование);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	3 КАК Порядок,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	ВозвратнаяТара.Ссылка КАК Ссылка,
		|	ВозвратнаяТара.НомерСтроки КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	"""" КАК НомерГТД
		|
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиВозвратаТоваровПоставщику_УПП13()

	ОбъектМетаданных = Метаданные.Документы.ВозвратТоваровПоставщику;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее_УПП13(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПередачиОС_УПП13()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаОС.Ссылка КАК Ссылка,
	|	ПередачаОС.Номер КАК Номер,
	|	ПередачаОС.Дата КАК Дата,
	|	ПередачаОС.Организация КАК Организация,
	|	ПередачаОС.Подразделение КАК Подразделение,
	|	ПередачаОС.Сделка КАК Сделка,
	|	ПередачаОС.Контрагент КАК Контрагент,
	|	ПередачаОС.ВалютаДокумента КАК ВалютаДокумента,
	|	ПередачаОС.УчитыватьНДС КАК УчитыватьНДС,
	|	ПередачаОС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПередачаОС.СуммаДокумента КАК СуммаДокумента,
	|	ПередачаОС.Ответственный КАК Ответственный,
	|	ПередачаОС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ПередачаОС.Грузоотправитель КАК Грузоотправитель,
	|	ПередачаОС.Грузополучатель КАК Грузополучатель,
	|	ПередачаОС.АдресДоставки КАК АдресДоставки,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ПередачаОС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ПередачаОС.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПередачаОС.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ПередачаОС.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ПередачаОС.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПередачаОС.Организация = Организации.Ссылка
	|ГДЕ
	|	ПередачаОС.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_УПП13()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК Товар,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрОсновныеСредства.Код КАК ТоварКод,
	|	СпрОсновныеСредства.Код КАК ТоварАртикул,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	"""" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК ЕдиницаИзмеренияНаименование,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СтавкаНДС КАК СтавкаНДС,
	|	ОсновныеСредства.СуммаНДС КАК СуммаНДС,
	|	ОсновныеСредства.КодТНВЭД КАК КодТНВЭД,
	|	&ОСИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	ОсновныеСредства.СтранаПроисхождения КАК СтранаПроисхождения,
	|	КлассификаторСтранМира.Код КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК СпрОсновныеСредства
	|		ПО ОсновныеСредства.ОсновноеСредство = СпрОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО ОсновныеСредства.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	ОсновныеСредства.НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	ВыражениеСтранаУчастникЕАЭС = "КлассификаторСтранМира.УчастникЕАЭС";
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	МетаданныеОсновныеСредства = Метаданные.Документы.ПередачаОС.ТабличныеЧасти.ОС;
	
	ВыражениеПрослеживаемыйТовар = "ОсновныеСредства.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеОсновныеСредства) Тогда
		// ПрослеживаемыйТовар в товарах появился с версии 1.3.185
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеТоварыИдентификаторСтроки = "ОсновныеСредства.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеОсновныеСредства) Тогда
		// ИдентификаторСтроки в товарах появился с версии 1.3.185
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&ОСИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиПередачиОС_УПП13()

	ОбъектМетаданных = Метаданные.Документы.ПередачаОС;
	Результат = УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее_УПП13(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОПродажах_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Подразделение КАК Подразделение,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНДС,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ОтчетКомитентуОПродажах.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ОтчетКомитентуОПродажах.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОтчетКомитентуОПродажах.Организация = Организации.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка";

	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОПродажах_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуги"" КАК ВидПоступления,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНДС,
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СпрНоменклатура.Ссылка, ""Комиссионное вознаграждение"") КАК Товар,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)), ""Комиссионное вознаграждение"") КАК ТоварПолноеНаименование,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)), ""Комиссионное вознаграждение"") КАК ТоварНаименование,
	|	ЕСТЬNULL(СпрНоменклатура.Код, """") КАК ТоварКод,
	|	ЕСТЬNULL(СпрНоменклатура.Артикул, """") КАК ТоварАртикул,
	|	0 КАК Цена,
	|	ЕСТЬNULL(СуммаПоДокументу.СуммаВознаграждения, 0) КАК Сумма,
	|	ЕСТЬNULL(СуммаПоДокументу.СуммаНДСВознаграждения, 0) КАК СуммаНДС,
	|	0 КАК Количество,
	|	1 КАК НомерСтроки,
	|	"""" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК ЕдиницаИзмеренияНаименование,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ОтчетКомитентуОПродажах.УслугаПоВознаграждению = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК СуммаВознаграждения,
	|			СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения,
	|			ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ГДЕ
	|			ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтчетКомитентуОПродажахТовары.Ссылка) КАК СуммаПоДокументу
	|		ПО ОтчетКомитентуОПродажах.Ссылка = СуммаПоДокументу.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиАктаОбОказанииПроизводственныхУслуг_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК Ссылка,
	|	АктОбОказанииПроизводственныхУслуг.Номер КАК Номер,
	|	АктОбОказанииПроизводственныхУслуг.Дата КАК Дата,
	|	АктОбОказанииПроизводственныхУслуг.Организация КАК Организация,
	|	АктОбОказанииПроизводственныхУслуг.ПодразделениеОрганизации КАК Подразделение,
	|	АктОбОказанииПроизводственныхУслуг.Контрагент КАК Контрагент,
	|	АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	АктОбОказанииПроизводственныхУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	АктОбОказанииПроизводственныхУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	АктОбОказанииПроизводственныхУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	АктОбОказанииПроизводственныхУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	АктОбОказанииПроизводственныхУслуг.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО АктОбОказанииПроизводственныхУслуг.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО АктОбОказанииПроизводственныхУслуг.Организация = Организации.Ссылка
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка = &Ссылка";

	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиАктаОбОказанииПроизводственныхУслуг_УПП13()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Услуги.Ссылка КАК Ссылка,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	""Услуги"" КАК ВидПоступления,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	Услуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Услуги.НомерСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Услуги.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке_УПП13()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияУслугПоПереработке.Ссылка КАК Ссылка,
	|	РеализацияУслугПоПереработке.Номер КАК Номер,
	|	РеализацияУслугПоПереработке.Дата КАК Дата,
	|	РеализацияУслугПоПереработке.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияУслугПоПереработке.Контрагент КАК Контрагент,
	|	РеализацияУслугПоПереработке.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РеализацияУслугПоПереработке.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РеализацияУслугПоПереработке.Организация КАК Организация,
	|	РеализацияУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО РеализацияУслугПоПереработке.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияУслугПоПереработке.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеализацияУслугПоПереработке.Организация = Организации.Ссылка
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "РеализацияУслугПоПереработке.ПодразделениеОрганизации";
	МетаданныеИсточника = Метаданные.Документы.РеализацияУслугПоПереработке;
	Если НЕ ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)"; // 1.3.220 и ниже
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиРеализацииУслугПоПереработке_УПП13()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Продукция.НомерСтроки КАК НомерСтроки,
	|	Продукция.Ссылка КАК Ссылка,
	|	Продукция.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Продукция.Количество КАК Количество,
	|	Продукция.Цена КАК Цена,
	|	Продукция.Сумма КАК Сумма,
	|	Продукция.СтавкаНДС КАК СтавкаНДС,
	|	Продукция.СуммаНДС КАК СуммаНДС,
	|	Продукция.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Продукция.НомерСтроки КАК ИдентификаторСтроки,
	|	""Продукция"" КАК ИмяТабличнойЧасти,
	|	Продукция.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Продукция.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Продукция КАК Продукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Продукция.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Продукция.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Продукция.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	Услуги.НомерСтроки,
	|	Услуги.Ссылка,
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА СпрНоменклатура.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.Сумма,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	Продукция.НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_УПП13()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.Организация КАК Организация,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	ЕСТЬNULL(ПлатежноеПоручениеВходящее.СчетОрганизации, Организации.ОсновнойБанковскийСчет) КАК БанковскийСчетОрганизации,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО СчетФактураВыданный.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактураВыданный.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СчетФактураВыданный.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|		ПО СчетФактураВыданный.ДокументОснование = ПлатежноеПоручениеВходящее.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ПлатежноеПоручениеВходящее.ПодразделениеОрганизации";
	МетаданныеИсточника = Метаданные.Документы.ПлатежноеПоручениеВходящее;
	Если НЕ ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)"; // 1.3.220 и ниже
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_УПП13()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ВидПоступления,
	|	СчетФактураВыданныйАвансы.Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйАвансы.Сумма КАК Сумма,
	|	СчетФактураВыданныйАвансы.СуммаНДС КАК СуммаНДС,
	|	СчетФактураВыданныйАвансы.СтавкаНДС,
	|	СчетФактураВыданныйАвансы.Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	СчетФактураВыданныйАвансы.Номенклатура КАК Товар,
	|	СчетФактураВыданныйАвансы.Содержание,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК ИдентификаторСтроки,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СчетФактураВыданныйАвансы.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомиссионераОПродажах.Номер КАК Номер,
	|	ОтчетКомиссионераОПродажах.Дата КАК Дата,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомиссионераОПродажах.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомиссионераОПродажах.Грузоотправитель КАК Грузоотправитель,
	|	ОтчетКомиссионераОПродажах.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомиссионераОПродажах.Сделка КАК Сделка,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомиссионераОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОтчетКомиссионераОПродажах.Организация = Организации.Ссылка
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &ДокСсылка
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_УПП13()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	&ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	&СтранаПроисхожденияСсылка КАК СтранаПроисхождения,
	|	&СтранаПроисхожденияКод КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	&НомерГТД КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	&ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК Покупатели
	|		ПО Товары.Ссылка = Покупатели.Ссылка
	|			И Товары.КлючСтроки = Покупатели.КлючСтроки
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Покупатели.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	МетаданныеТовары = Метаданные.Документы.ОтчетКомиссионераОПродажах.ТабличныеЧасти.Товары;
	
	ВыражениеПрослеживаемыйКомплект = "Товары.ПрослеживаемыйКомплект";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйКомплект", МетаданныеТовары) Тогда
		ВыражениеПрослеживаемыйКомплект = "ЛОЖЬ"; // 1.3.194 и ниже
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "Товары.ПрослеживаемыйТовар";
	Если Не ЕстьРеквизитОбъектаЛок("ПрослеживаемыйТовар", МетаданныеТовары) Тогда
		// ПрослеживаемыйТовар в товарах появился с версии 1.3.182
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеИдентификаторСтроки = "Товары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТовары) Тогда
		 // ИдентификаторСтроки в товарах появился с версии 1.3.182
		ВыражениеИдентификаторСтроки = """""";
	КонецЕсли;
	
	ВыражениеСтранаСсылка = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СерииНоменклатуры.СтранаПроисхождения
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА Товары.СтранаПроисхождения
	|		ИНАЧЕ СпрНоменклатура.СтранаПроисхождения
	|	КОНЕЦ";
	ВыражениеСтранаКод = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.Код
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.Код
	|		ИНАЧЕ КлассификаторСтранМира.Код
	|	КОНЕЦ";
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираСерии.УчастникЕАЭС
	|		КОГДА Товары.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМираТовары.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМира.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("СтранаПроисхождения", МетаданныеТовары) Тогда // ниже 1.3.182
		ВыражениеСтранаСсылка = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения, СпрНоменклатура.СтранаПроисхождения)";
		ВыражениеСтранаКод = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.Код, КлассификаторСтранМира.Код)";
		ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, КлассификаторСтранМира.УчастникЕАЭС)";
	КонецЕсли;
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеНомерГТД = "ВЫБОР
	|		КОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер) = """"
	|			ТОГДА  ЕСТЬNULL(СерииНоменклатуры.НомерГТД.Код, СпрНоменклатура.НомерГТД.Код)
	|		ИНАЧЕ ЕСТЬNULL(СерииНоменклатуры.НомерГТД.РегистрационныйНомер, СпрНоменклатура.НомерГТД.РегистрационныйНомер)
	|	КОНЕЦ";

	Замены = Новый СписокЗначений;
	Замены.Добавить("&ПрослеживаемыйКомплект", ВыражениеПрослеживаемыйКомплект);
	Замены.Добавить("&СтранаПроисхожденияСсылка", ВыражениеСтранаСсылка);
	Замены.Добавить("&СтранаПроисхожденияКод", ВыражениеСтранаКод);
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	Замены.Добавить("&ИдентификаторСтроки", ВыражениеИдентификаторСтроки);
	Замены.Добавить("&НомерГТД", ВыражениеНомерГТД);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиОтчетаКомиссионераОПродажах_УПП13()

	Пустышка =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК КоличествоПрослеживаемости,
	|	"""""""" КАК ИдентификаторСтроки,
	|	0 КАК Сумма,
	|	"""""""" КАК ЕдиницаИзмеренияКод,
	|	"""""""" КАК ЕдиницаИзмеренияНаименование,
	|	"""""""" КАК НомерРНПТ";
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(Пустышка);
	
	Замены = Новый СписокЗначений;
	
	МетаданныеТЧ = Метаданные.Документы.ОтчетКомиссионераОПродажах.ТабличныеЧасти.Найти("СведенияПрослеживаемости");
	
	Если МетаданныеТЧ <> Неопределено Тогда // 1.3.182 и выше
		
		ОсновнойЗапрос =
		"ВЫБРАТЬ
		|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	&ВыражениеСумма КАК Сумма,
		|	&ВыражениеЕдИзмКод КАК ЕдиницаИзмеренияКод,
		|	&ВыражениеЕдИзмНаименование КАК ЕдиницаИзмеренияНаименование,
		|	НомераГТД.Код КАК НомерРНПТ
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.СведенияПрослеживаемости КАК СведенияПрослеживаемости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
		|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремИдентификаторыСтрока КАК ВремИдентификаторыСтрока
		|		ПО СведенияПрослеживаемости.ИдентификаторСтроки = ВремИдентификаторыСтрока.ИдентификаторСтроки
		|ГДЕ
		|	СведенияПрослеживаемости.Ссылка = &ДокСсылка";
		
		ВыражениеСумма = "СведенияПрослеживаемости.Сумма";
		Если Не ЕстьРеквизитОбъектаЛок("Сумма", МетаданныеТЧ) Тогда // 1.3.194 и ниже
			ВыражениеСумма = "0";
		КонецЕсли;
		
		ВыражениеЕдИзмКод =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Код
		|	ИНАЧЕ ""796""
		|КОНЕЦ";
		
		ВыражениеЕдИзмНаименование =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Наименование
		|	ИНАЧЕ ""шт""
		|КОНЕЦ";
		
		Если Не ЕстьРеквизитОбъектаЛок("Номенклатура", МетаданныеТЧ) Тогда // 1.3.194 и ниже
			ВыражениеЕдИзмКод = """796""";
			ВыражениеЕдИзмНаименование = """шт""";
		КонецЕсли;
		
		Замены.Добавить("&ВыражениеСумма", ВыражениеСумма);
		Замены.Добавить("&ВыражениеЕдИзмКод", ВыражениеЕдИзмКод);
		Замены.Добавить("&ВыражениеЕдИзмНаименование", ВыражениеЕдИзмНаименование);
		
		ЧастиЗапроса.Добавить(ОсновнойЗапрос);
		
	КонецЕсли;
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, ТекстЗапроса_ОбъединитьВсе());
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ТоварыИдентификаторСтроки
	|ПОМЕСТИТЬ ВремИдентификаторыСтрока
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК Покупатели
	|		ПО Товары.Ссылка = Покупатели.Ссылка
	|			И Товары.КлючСтроки = Покупатели.КлючСтроки
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Покупатели.СчетФактура = &СчетФактура
	|;
	|" + Результат;
	
	МетаданныеТовары = Метаданные.Документы.ОтчетКомиссионераОПродажах.ТабличныеЧасти.Товары;
	
	ВыражениеТоварыИдентификаторСтроки = "Товары.ИдентификаторСтроки";
	Если Не ЕстьРеквизитОбъектаЛок("ИдентификаторСтроки", МетаданныеТовары) Тогда
		// ИдентификаторСтроки в товарах появился с версии 1.3.182
		ВыражениеТоварыИдентификаторСтроки = """""";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ТоварыИдентификаторСтроки", ВыражениеТоварыИдентификаторСтроки);
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
	|	Шапка.Организация.ИНН КАК ОрганизацияИНН,
	|	Шапка.Организация.КПП КАК ОрганизацияКПП,
	|	Шапка.СкладОтправитель КАК СкладОтправитель,
	|	Шапка.СкладОтправитель.Наименование КАК СкладОтправительПредставление,
	|	Шапка.СкладПолучатель КАК СкладПолучатель,
	|	Шапка.СкладПолучатель.Наименование КАК СкладПолучательПредставление,
	|	Шапка.Подразделение КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_УПП13()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Товар,
	|	ТЧ.Номенклатура.Код КАК ТоварКод,
	|	ТЧ.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД, ТЧ.Номенклатура.НомерГТД) КАК НомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.Код, """") КАК ПолныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.РегистрационныйНомер, """") КАК РегистрационныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Наименование, """") КАК СтранаПроисхожденияНаименование,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТЧ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ТЧ.ХарактеристикаНоменклатуры.Наименование, """") КАК ХарактеристикаПредставление,
	|	ТЧ.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.Наименование, """") КАК СерияПредставление,
	|	ТЧ.ЕдиницаИзмерения КАК Упаковка,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена * ТЧ.Количество КАК Сумма,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Ссылка,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Номенклатура.Артикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)),
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код, """"""""),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование, """"""""),
	|	0,
	|	ТЧ.Количество,
	|	0,
	|	ЛОЖЬ,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	2
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Ссылка,
	|	НомерСтроки";
	
	ВыражениеСтранаУчастникЕАЭС = "ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ)";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда // 1.3.145 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаСведенийОПрослеживаемостиОбщее_УПП13(ОбъектМетаданных)
	
	Пустышка =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	0 КАК КоличествоПрослеживаемости,
	|	"""""""" КАК ИдентификаторСтроки,
	|	0 КАК Сумма,
	|	"""""""" КАК ЕдиницаИзмеренияКод,
	|	"""""""" КАК ЕдиницаИзмеренияНаименование,
	|	"""""""" КАК НомерРНПТ";
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(Пустышка);
	
	Замены = Новый СписокЗначений;
	
	МетаданныеТЧ = ОбъектМетаданных.ТабличныеЧасти.Найти("СведенияПрослеживаемости");
	
	Если МетаданныеТЧ <> Неопределено Тогда // 1.3.182 и выше
		
		ОсновнойЗапрос =
		"ВЫБРАТЬ
		|	СведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	СведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	&ВыражениеСумма КАК Сумма,
		|	&ВыражениеЕдИзмКод КАК ЕдиницаИзмеренияКод,
		|	&ВыражениеЕдИзмНаименование КАК ЕдиницаИзмеренияНаименование,
		|	НомераГТД.Код КАК НомерРНПТ
		|ИЗ
		|	&ПолноеИмяТаблицы КАК СведенияПрослеживаемости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
		|		ПО СведенияПрослеживаемости.РНПТ = НомераГТД.Ссылка
		|ГДЕ
		|	СведенияПрослеживаемости.Ссылка = &Ссылка";
		
		ВыражениеСумма = "СведенияПрослеживаемости.Сумма";
		Если Не ЕстьРеквизитОбъектаЛок("Сумма", МетаданныеТЧ) Тогда // 1.3.188 и ниже
			ВыражениеСумма = "0";
		КонецЕсли;
		
		ВыражениеЕдИзмКод =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Код
		|	ИНАЧЕ ""796""
		|КОНЕЦ";
		
		ВыражениеЕдИзмНаименование =
		"ВЫБОР
		|	КОГДА СведенияПрослеживаемости.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА СведенияПрослеживаемости.Номенклатура.БазоваяЕдиницаИзмерения.Наименование
		|	ИНАЧЕ ""шт""
		|КОНЕЦ";
		
		Если Не ЕстьРеквизитОбъектаЛок("Номенклатура", МетаданныеТЧ) Тогда // 1.3.188 и ниже
			ВыражениеЕдИзмКод = """796""";
			ВыражениеЕдИзмНаименование = """шт""";
		КонецЕсли;
		
		Замены.Добавить("&ПолноеИмяТаблицы", ОбъектМетаданных.ПолноеИмя() + ".СведенияПрослеживаемости");
		Замены.Добавить("&ВыражениеСумма", ВыражениеСумма);
		Замены.Добавить("&ВыражениеЕдИзмКод", ВыражениеЕдИзмКод);
		Замены.Добавить("&ВыражениеЕдИзмНаименование", ВыражениеЕдИзмНаименование);
		
		ЧастиЗапроса.Добавить(ОсновнойЗапрос);
		
	КонецЕсли;
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, ТекстЗапроса_ОбъединитьВсе());
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваров_УПП13(ОснованиеОтгрузки)
	
	Если ЗначениеЗаполнено(ОснованиеОтгрузки) Тогда
		
		Если ЭтоЗаказПокупателя_УПП13(ОснованиеОтгрузки) Тогда
			Результат = УПД970_РеквизитыОснованияОтгрузкиТоваровПоЗаказу_УПП13(ОснованиеОтгрузки);
		Иначе
			Результат = УПД970_РеквизитыОснованияОтгрузкиТоваровПоДоговору(ОснованиеОтгрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваровПоЗаказу_УПП13(ДокументСсылка)
	
	ДатаЗаказа = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "Дата");
	
	Результат = УПД970_НовыйРеквизитыОснованияОтгрузки(
		"Заказ покупателя",
		ПредставлениеНомера(ДокументСсылка),
		ДатаЗаказа,
		ДокументСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОснованиеОтгрузкиТоваровПоДокументу_УПП13(ДокументСсылка)
	
	Сделка = Неопределено;
	ДоговорКонтрагента = Неопределено;
	
	Если ЕстьРеквизитОбъектаЛок("Сделка", ДокументСсылка.Метаданные()) Тогда
		Сделка = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "Сделка");
	КонецЕсли;
	
	ДоговорКонтрагента = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ДоговорКонтрагента");
	
	Если УПД970_ВедениеВзаиморасчетовПоЗаказам_УПП13(ДоговорКонтрагента)
		И ЗначениеЗаполнено(Сделка)
		И ЭтоЗаказПокупателя_УПП13(Сделка) Тогда
		
		Результат = Сделка;
		
	ИначеЕсли ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
		Результат = ДоговорКонтрагента;
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВедениеВзаиморасчетовПоЗаказам_УПП13(Договор)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ВедениеВзаиморасчетов = ЗначениеРеквизитаОбъектаЛок(Договор, "ВедениеВзаиморасчетов");
		Результат = (ВедениеВзаиморасчетов = ПредопределенноеЗначение("Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьИдентификаторГосКонтракта_УПП13(Контент, ДанныеШапки)
	
	Перем ИдентификаторГосКонтракта;
	
	Если ЭтоСчетФактураВыданный(ДанныеШапки.Ссылка) Тогда
		
		ИдентификаторГосКонтракта = ДанныеШапки.ИдентификаторГосКонтракта;
		
	Иначе
		
		РеквизитыДоговора = УПД970_РеквизитыДоговораПоДаннымШапкиДокумента(ДанныеШапки);
		
		Если МожноИспользоватьКонтракты_УПП13(РеквизитыДоговора) Тогда
			
			МодульОбщегоНазначения275 = ОбщийМодульПоИмениЛок("ОбщегоНазначения275КлиентСервер");
			Контракт = МодульОбщегоНазначения275.НайтиПодчиненныйКонтракт(ДанныеШапки.ДоговорКонтрагента);
			Если ЗначениеЗаполнено(Контракт) Тогда
				ИдентификаторГосКонтракта = Контракт.Код;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Контент.GovernmentContractInfo = ИдентификаторГосКонтракта;
	
КонецПроцедуры

Функция МожноИспользоватьКонтракты_УПП13(РеквизитыДоговора)
	
	_ВестиУчетПлатежейПоГосКонтрактам = глЗначениеПеременной("ВестиУчетПлатежейПоГосКонтрактам");
	_ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Результат = _ВестиУчетПлатежейПоГосКонтрактам И
		(РеквизитыДоговора.ВалютаВзаиморасчетов = _ВалютаРегламентированногоУчета ИЛИ РеквизитыДоговора.РасчетыВУсловныхЕдиницах) И
		(РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ 
		 РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);

	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтражениеНачисленияНДС()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СпрДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	СпрДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	СпрДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(СпрДоговорыКонтрагентов.ВалютаВзаиморасчетов, """""""") КАК ВалютаВзаиморасчетов,
	|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(СпрДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	ЕСТЬNULL(СпрДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО Как ПодразделениеОрганизации,
	|	Т.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО Как АдресДоставки
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК СпрДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = СпрДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейОтражениеНачисленияНДС()
	
	Результат =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокШапка.ПрямаяЗаписьВКнигу
	|			ТОГДА ""Услуги""
	|		КОГДА Т.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ""Услуги""
	|		ИНАЧЕ ""Товары""
	|	КОНЕЦ КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Т.НомерСтроки КАК ИдентификаторСтроки,
	|	""ТоварыИУслуги"" КАК ИмяТабличнойЧасти,
	|	ВЫБОР
	|		КОГДА ДокШапка.ПрямаяЗаписьВКнигу
	|			ТОГДА Т.ВидЦенности
	|		ИНАЧЕ Т.Номенклатура
	|	КОНЕЦ КАК Товар,
	|	ВЫБОР
	|		КОГДА ДокШапка.ПрямаяЗаписьВКнигу
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Т.ВидЦенности)
	|		ИНАЧЕ ВЫРАЗИТЬ(Т.Номенклатура.Наименование КАК СТРОКА(1000))
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА ДокШапка.ПрямаяЗаписьВКнигу
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Т.ВидЦенности)
	|		КОГДА Т.Номенклатура ССЫЛКА Справочник.ОбъектыСтроительства
	|			ТОГДА ВЫРАЗИТЬ(Т.Номенклатура.Наименование КАК СТРОКА(1000))
	|		ИНАЧЕ ВЫРАЗИТЬ(Т.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|	КОНЕЦ КАК ТоварПолноеНаименование,
	|	Т.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(Т.ХарактеристикаНоменклатуры, """") КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(Т.СерияНоменклатуры, """") КАК СерияНоменклатуры,
	|	Т.Цена КАК Цена,
	|	Т.Сумма КАК Сумма,
	|	Т.СуммаНДС КАК СуммаНДС,
	|	Т.СерияНоменклатуры.НомерГТД КАК НомерГТД,
	|	Т.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрЕдиницыИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияЕдиницаПоКлассификатору,
	|	СпрЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СпрЕдиницыИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	Т.Номенклатура.Артикул КАК ТоварАртикул,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Количество КАК Количество,
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура.Код КАК ТоварКод,
	|	Т.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Т.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	Т.СерияНоменклатуры.СтранаПроисхождения.УчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.ОтражениеРеализацииТоваровИУслугНДС.ТоварыИУслуги КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ДокШапка
	|		ПО Т.Ссылка = ДокШапка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницыИзмерения
	|		ПО Т.ЕдиницаИзмерения = СпрЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

//} УПП 1.3

//{ Функции и процедуры для БП 2.0

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_БП20(ДокументСсылка, СчетФактура, ФункцияДокумента)
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанные_РеализацияТоваровУслуг(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_КорректировкаРеализации(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомитентуОПродажах(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_ИсходныеДанные_ВозвратуТоваровПоставщику(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоОказаниеУслуг_БП20(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_ОказаниеУслуг_БП20(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ЭтоПередачаОС(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_ПередачеОС(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанные_АктОбОказанииПроизводственныхУслуг(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		Результат = УПД970_ИсходныеДанные_РеализацияУслугПоПереработке(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомиссионераОПродажах(ДокументСсылка, СчетФактура);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ИсходныеДанные_ОказаниеУслуг_БП20(ДокументСсылка, СчетФактура)
	
	ТекстЗапросаРеквизиты = УПД970_ТекстЗапросаДанныхШапкиОказанияУслуг_БП20();
	ТекстЗапросаТабличныеЧасти = УПД970_ТекстЗапросаТабличнойЧастиОказанияУслуг_БП20();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРеквизиты);
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличныеЧасти);
	
	ТекстЗапроса = Ядро.СоединитьСтроку(ТекстыЗапросов, ТекстЗапроса_РазделительЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатыЗапроса[0]);
	Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[1]);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьРеквизитыОснованияОтгрузкиТоваровПоСчетФактуре_БП20(Контент, СчетФактура, ДокументыОснования, ДополнительныеПараметры)
	
	ОснованияОтгрузки = Новый Массив;
	Для Каждого ДокументОснования Из ДокументыОснования Цикл
		
		Если ЭтоОказаниеУслуг_БП20(ДокументОснования) Тогда
			ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументуОказанияУслуг_БП20(ДокументОснования, СчетФактура);
		Иначе
			ОснованиеОтгрузки = УПД970_ОснованиеОтгрузкиТоваровПоДокументу_БП20(ДокументОснования);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеОтгрузки)
			И ОснованияОтгрузки.Найти(ОснованиеОтгрузки) = Неопределено Тогда
			ОснованияОтгрузки.Добавить(ОснованиеОтгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	РеквизитыОснованийОтгрузки = Новый Массив;
	Для Каждого ОснованиеОтгрузки Из ОснованияОтгрузки Цикл
		
		РеквизитыОснования = УПД970_РеквизитыОснованияОтгрузкиТоваров_БП20(ОснованиеОтгрузки);
		РеквизитыОснованийОтгрузки.Добавить(РеквизитыОснования);
		
	КонецЦикла;
	
	УПД970_ЗаполнитьСведенияОПередачеТоваров(Контент, РеквизитыОснованийОтгрузки, ДополнительныеПараметры);

КонецПроцедуры

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ Т.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.РеализацияТоваровУслуг;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "Т.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_БП20(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТоварыУслугиАгентскиеУслуги = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ Товары.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираТовары.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	3,
	|	Услуги.НомерСтроки,
	|	""Услуги"",
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	ЕдиницыИзмерения.Представление,
	|	ЕдиницыИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	Услуги.Сумма,
	|	Услуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентскиеУслуги"",
	|	4,
	|	АгентскиеУслуги.НомерСтроки,
	|	""АгентскиеУслуги"",
	|	АгентскиеУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(АгентскиеУслуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	ЕдиницыИзмерения.Представление,
	|	ЕдиницыИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	АгентскиеУслуги.Количество,
	|	АгентскиеУслуги.Цена,
	|	АгентскиеУслуги.СтавкаНДС,
	|	АгентскиеУслуги.СуммаНДС,
	|	АгентскиеУслуги.Сумма,
	|	АгентскиеУслуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА АгентскиеУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	АгентскиеУслуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО АгентскиеУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	АгентскиеУслуги.Ссылка = &Ссылка";
	
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМираТовары.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда
		// БП 2.0.67.4 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ВЫБОР
	|		КОГДА Товары.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	МетаданныеТовары = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары;
	Если Не ЕстьРеквизитОбъектаЛок("РНПТ", МетаданныеТовары) Тогда
		// БП 2.0.66.150 и ниже
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапросаТоварыУслугиАгентскиеУслуги = СтрЗаменить(ТекстЗапросаТоварыУслугиАгентскиеУслуги,
			Элемент.Значение,
			Элемент.Представление
		);
	КонецЦикла;
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТоварыУслугиАгентскиеУслуги);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	2 КАК Порядок,
		|	ВозвратнаяТара.НомерСтроки КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	"""" КАК ТоварКодТНВЭД,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕдиницыИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
		|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	0 КАК ЕстьНДС,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	ВозвратнаяТара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
		|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиРеализацииТоваровУслуг_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.НомерСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Количество КАК КоличествоПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК Сумма,
	|	ЕСТЬNULL(НомераГТД.Код, """") КАК НомерРНПТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТаблицаТоваров.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ТаблицаТоваров.РНПТ = НомераГТД.Ссылка
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ Т.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК КурсВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Т.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ Товары.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираТовары.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	&ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	Услуги.НомерСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	ЕдиницыИзмерения.Представление,
	|	ЕдиницыИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	Услуги.Сумма,
	|	Услуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентскиеУслуги"",
	|	АгентскиеУслуги.НомерСтроки,
	|	""АгентскиеУслуги"" КАК ИмяТабличнойЧасти,
	|	АгентскиеУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(АгентскиеУслуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	ЕдиницыИзмерения.Представление,
	|	ЕдиницыИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	АгентскиеУслуги.Количество,
	|	АгентскиеУслуги.Цена,
	|	АгентскиеУслуги.СтавкаНДС,
	|	АгентскиеУслуги.СуммаНДС,
	|	АгентскиеУслуги.Сумма,
	|	АгентскиеУслуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА АгентскиеУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	АгентскиеУслуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО АгентскиеУслуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	АгентскиеУслуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМираТовары.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда
		// БП 2.0.67.4 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ВыражениеПрослеживаемыйТовар = "ВЫБОР
	|		КОГДА Товары.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	МетаданныеТовары = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары;
	Если Не ЕстьРеквизитОбъектаЛок("РНПТ", МетаданныеТовары) Тогда
		// БП 2.0.66.150 и ниже
		ВыражениеПрослеживаемыйТовар = "ЛОЖЬ";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	Замены.Добавить("&ПрослеживаемыйТовар", ВыражениеПрослеживаемыйТовар);
	
	Для Каждого Элемент Из Замены Цикл
		Результат = СтрЗаменить(Результат, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиКорректировкиРеализации_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.НомерСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Количество КАК КоличествоПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК Сумма,
	|	ЕСТЬNULL(НомераГТД.Код, """") КАК НомерРНПТ
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТаблицаТоваров.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ТаблицаТоваров.РНПТ = НомераГТД.Ссылка
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|	И ТаблицаТоваров.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_БП20()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
	|	ВозвратТоваровПоставщику.Номер КАК Номер,
	|	ВозвратТоваровПоставщику.Дата КАК Дата,
	|	ВозвратТоваровПоставщику.Организация КАК Организация,
	|	ВозвратТоваровПоставщику.Сделка КАК Сделка,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ВозвратТоваровПоставщику.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ВозвратТоваровПоставщику.Ответственный КАК Ответственный,
	|	ВозвратТоваровПоставщику.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВозвратТоваровПоставщику.Грузоотправитель КАК Грузоотправитель,
	|	ВозвратТоваровПоставщику.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВозвратТоваровПоставщику.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВозвратТоваровПоставщику.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВозвратТоваровПоставщику.Организация = Организации.Ссылка
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.ВозвратТоваровПоставщику;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ВозвратТоваровПоставщику.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_БП20(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТовары =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ Товары.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираТовары.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД
	|
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМираТовары.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда
		// БП 2.0.67.4 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстЗапросаТовары = СтрЗаменить(ТекстЗапросаТовары, "&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТовары);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	2 КАК Порядок,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	ВозвратнаяТара.Ссылка КАК Ссылка,
		|	ВозвратнаяТара.НомерСтроки КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	"""" КАК НомерГТД
		|
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПередачиОС_БП20()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаОС.Ссылка КАК Ссылка,
	|	ПередачаОС.Номер,
	|	ПередачаОС.Дата,
	|	ПередачаОС.Организация,
	|	НЕОПРЕДЕЛЕНО КАК Сделка,
	|	ПередачаОС.Контрагент КАК Контрагент,
	|	ПередачаОС.ВалютаДокумента КАК ВалютаДокумента,
	|	ПередачаОС.УчитыватьНДС КАК УчитыватьНДС,
	|	ПередачаОС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПередачаОС.СуммаДокумента КАК СуммаДокумента,
	|	ПередачаОС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ПередачаОС.Грузоотправитель КАК Грузоотправитель,
	|	ПередачаОС.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ПередачаОС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ПередачаОС.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПередачаОС.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ПередачаОС.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПередачаОС.Организация = Организации.Ссылка
	|ГДЕ
	|	ПередачаОС.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_БП20()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.НомерСтроки КАК ИдентификаторСтроки,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	ОсновныеСредства.ОсновноеСредство КАК Товар,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрОсновныеСредства.Код КАК ТоварКод,
	|	СпрОсновныеСредства.Код КАК ТоварАртикул,
	|	ОсновныеСредства.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОсновныеСредства.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ОсновныеСредства.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Цена КАК Цена,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СтавкаНДС КАК СтавкаНДС,
	|	ОсновныеСредства.СуммаНДС КАК СуммаНДС,
	|	ОсновныеСредства.КодТНВЭД КАК КодТНВЭД,
	|	ОсновныеСредства.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	ОсновныеСредства.СтранаПроисхождения КАК СтранаПроисхождения,
	|	КлассификаторСтранМира.Код КАК СтранаПроисхожденияКод,
	|	КлассификаторСтранМира.УчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК СпрОсновныеСредства
	|		ПО ОсновныеСредства.ОсновноеСредство = СпрОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО ОсновныеСредства.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	ОсновныеСредства.НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхПрослеживаемостиПередачиОС_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.НомерСтроки КАК ИдентификаторСтроки,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ОсновныеСредства.Количество КАК КоличествоПрослеживаемости,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ЕСТЬNULL(НомераГТД.Код, """") КАК НомерРНПТ
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК СпрОсновныеСредства
	|		ПО ОсновныеСредства.ОсновноеСредство = СпрОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО ОсновныеСредства.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ОсновныеСредства.РНПТ = НомераГТД.Ссылка
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредства.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОПродажах_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНДС,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ОтчетКомитентуОПродажах.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ОтчетКомитентуОПродажах.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОтчетКомитентуОПродажах.Организация = Организации.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.ОтчетКомитентуОПродажах;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ОтчетКомитентуОПродажах.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОПродажах_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуги"" КАК ВидПоступления,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНДС,
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СпрНоменклатура.Ссылка, ""Комиссионное вознаграждение"") КАК Товар,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)), ""Комиссионное вознаграждение"") КАК ТоварПолноеНаименование,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)), ""Комиссионное вознаграждение"") КАК ТоварНаименование,
	|	ЕСТЬNULL(СпрНоменклатура.Код, """") КАК ТоварКод,
	|	ЕСТЬNULL(СпрНоменклатура.Артикул, """") КАК ТоварАртикул,
	|	0 КАК Цена,
	|	СуммаПоДокументу.СуммаВознаграждения КАК Сумма,
	|	СуммаПоДокументу.СуммаНДСВознаграждения КАК СуммаНДС,
	|	0 КАК Количество,
	|	1 КАК НомерСтроки,
	|	"""" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК ЕдиницаИзмеренияНаименование,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ОтчетКомитентуОПродажах.УслугаПоВознаграждению = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК СуммаВознаграждения,
	|			СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения,
	|			ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ГДЕ
	|			ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтчетКомитентуОПродажахТовары.Ссылка) КАК СуммаПоДокументу
	|		ПО ОтчетКомитентуОПродажах.Ссылка = СуммаПоДокументу.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомитентуОтИмениПродавца_БП20()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Поставщик КАК Организация,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажахСсылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажахСсылка.УчитыватьНДС КАК ЕстьНДС,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ОтчетКомитентуОПродажахСсылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомитентуОПродажахСсылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомитентуОПродажахСсылка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ОтчетКомитентуОПродажах.СчетФактура.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.СчетФактура.Дата КАК Дата,
	|	ОтчетКомитентуОПродажахСсылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомитентуОПродажахСсылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахСсылка.ВыписыватьСчетаФактурыСводно
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетКомитентуОПродажах.Партия.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ОтчетКомитентуОПродажах.Партия.Грузоотправитель
	|					ИНАЧЕ ОтчетКомитентуОПродажах.Поставщик
	|				КОНЕЦ
	|		КОГДА ОтчетКомитентуОПродажах.Партия.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Партия.Грузоотправитель
	|		ИНАЧЕ ОтчетКомитентуОПродажах.Партия.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Партия.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ОтчетКомитентуОПродажах.Партия.Грузополучатель
	|		ИНАЧЕ ОтчетКомитентуОПродажахСсылка.Организация
	|	КОНЕЦ КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомитентуОПродажах.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Организации
	|		ПО ОтчетКомитентуОПродажах.Поставщик = Организации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажахСсылка
	|		ПО ОтчетКомитентуОПродажах.Ссылка = ОтчетКомитентуОПродажахСсылка.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажах.СчетФактура = &СчетФактура";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.ОтчетКомитентуОПродажах;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ОтчетКомитентуОПродажах.Ссылка.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиОтчетаКомитентуОтИмениПродавца_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуОПродажах.КлючСтроки КАК КлючСтроки,
	|	ОтчетКомитентуОПродажах.Партия КАК Партия
	|ПОМЕСТИТЬ ВТ_КлючиСтроки
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажах.СчетФактура = &СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажах.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиСтроки.КлючСтроки КАК КлючСтроки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ПоступлениеТоваровУслугТовары.НомерСтроки) КАК НомерСтроки,
	|	ВТ_КлючиСтроки.Партия КАК Партия
	|ПОМЕСТИТЬ ВТ_ГТД_Вспомогательная
	|ИЗ
	|	ВТ_КлючиСтроки КАК ВТ_КлючиСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_КлючиСтроки.Партия = ПоступлениеТоваровУслугТовары.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ВТ_КлючиСтроки.КлючСтроки,
	|	ВТ_КлючиСтроки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГТД_Вспомогательная.КлючСтроки КАК КлючСтроки,
	|	ВТ_ГТД_Вспомогательная.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.НомерГТД КАК НомерГТД,
	|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ГТД
	|ИЗ
	|	ВТ_ГТД_Вспомогательная КАК ВТ_ГТД_Вспомогательная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_ГТД_Вспомогательная.Партия = ПоступлениеТоваровУслугТовары.Ссылка
	|			И ВТ_ГТД_Вспомогательная.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ВТ_ГТД_Вспомогательная.НомерСтроки = ПоступлениеТоваровУслугТовары.НомерСтроки
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомитентуОПродажахТовары.Номенклатура.Услуга, ИСТИНА)
	|			ТОГДА ""Услуги""
	|		ИНАЧЕ ""Товары""
	|	КОНЕЦ КАК ВидПоступления,
	|	ОтчетКомитентуОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.УчитыватьНДС КАК ЕстьНДС,
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ОтчетКомитентуОПродажахТовары.Цена КАК Цена,
	|	ОтчетКомитентуОПродажахТовары.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомитентуОПродажахТовары.Количество КАК Количество,
	|	ОтчетКомитентуОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахТовары.Количество = 0
	|			ТОГДА """"
	|		ИНАЧЕ ЕдиницыИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахТовары.Количество = 0
	|			ТОГДА """"
	|		ИНАЧЕ ЕдиницыИзмерения.НаименованиеПолное
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахТовары.Количество = 0
	|			ТОГДА """"
	|		ИНАЧЕ ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВТ_ГТД.СтранаПроисхождения, ОтчетКомитентуОПродажахТовары.Номенклатура.СтранаПроисхождения) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ВТ_ГТД.СтранаПроисхождения.Код, ОтчетКомитентуОПродажахТовары.Номенклатура.СтранаПроисхождения.Код) КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ВТ_ГТД.СтранаПроисхождения.УчастникЕАЭС, ОтчетКомитентуОПродажахТовары.Номенклатура.СтранаПроисхождения.УчастникЕАЭС) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ЕСТЬNULL(ВТ_ГТД.НомерГТД.Код, ОтчетКомитентуОПродажахТовары.Номенклатура.НомерГТД.Код) КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	ОтчетКомитентуОПродажахТовары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГТД КАК ВТ_ГТД
	|		ПО ОтчетКомитентуОПродажахТовары.КлючСтроки = ВТ_ГТД.КлючСтроки
	|			И ОтчетКомитентуОПродажахТовары.Номенклатура = ВТ_ГТД.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлючиСтроки КАК ВТ_КлючиСтроки
	|		ПО ОтчетКомитентуОПродажахТовары.КлючСтроки = ВТ_КлючиСтроки.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ОтчетКомитентуОПродажахТовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|	И ВТ_КлючиСтроки.КлючСтроки ЕСТЬ НЕ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КлючиСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ГТД_Вспомогательная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ГТД";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиАктаОбОказанииПроизводственныхУслуг_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК Ссылка,
	|	АктОбОказанииПроизводственныхУслуг.Номер КАК Номер,
	|	АктОбОказанииПроизводственныхУслуг.Дата КАК Дата,
	|	АктОбОказанииПроизводственныхУслуг.Организация КАК Организация,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	АктОбОказанииПроизводственныхУслуг.Контрагент КАК Контрагент,
	|	АктОбОказанииПроизводственныхУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	АктОбОказанииПроизводственныхУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	АктОбОказанииПроизводственныхУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	АктОбОказанииПроизводственныхУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО АктОбОказанииПроизводственныхУслуг.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО АктОбОказанииПроизводственныхУслуг.Организация = Организации.Ссылка
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.АктОбОказанииПроизводственныхУслуг;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "АктОбОказанииПроизводственныхУслуг.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиАктаОбОказанииПроизводственныхУслуг_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Услуги.Ссылка КАК Ссылка,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	""Услуги"" КАК ВидПоступления,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	Услуги.НомерСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииУслугПоПереработке_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияУслугПоПереработке.Ссылка КАК Ссылка,
	|	РеализацияУслугПоПереработке.Номер КАК Номер,
	|	РеализацияУслугПоПереработке.Дата КАК Дата,
	|	РеализацияУслугПоПереработке.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияУслугПоПереработке.Контрагент КАК Контрагент,
	|	РеализацияУслугПоПереработке.Организация КАК Организация,
	|	РеализацияУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	РеализацияУслугПоПереработке.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РеализацияУслугПоПереработке.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО РеализацияУслугПоПереработке.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияУслугПоПереработке.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеализацияУслугПоПереработке.Организация = Организации.Ссылка
	|ГДЕ
	|	РеализацияУслугПоПереработке.Ссылка = &Ссылка";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.РеализацияУслугПоПереработке;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "РеализацияУслугПоПереработке.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиРеализацииУслугПоПереработке_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Услуги"" КАК ВидПоступления,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.Ссылка КАК Ссылка,
	|	Услуги.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))
	|	КОНЕЦ КАК ТоварПолноеНаименование,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000))
	|		ИНАЧЕ ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))
	|	КОНЕЦ КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА СпрНоменклатура.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТоварКод,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000))) = """"
	|			ТОГДА СпрНоменклатура.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТоварАртикул,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	Услуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	Услуги.НомерСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО Услуги.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	Услуги.НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.Организация КАК Организация,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.СчетОрганизации, Организации.ОсновнойБанковскийСчет) КАК БанковскийСчетОрганизации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО СчетФактураВыданный.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактураВыданный.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СчетФактураВыданный.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|		ПО СчетФактураВыданный.ДокументОснование = ПоступлениеНаРасчетныйСчет.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_БП20()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ВидПоступления,
	|	СчетФактураВыданныйАвансы.Ссылка КАК Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйАвансы.Сумма КАК Сумма,
	|	СчетФактураВыданныйАвансы.СуммаНДС КАК СуммаНДС,
	|	СчетФактураВыданныйАвансы.СтавкаНДС КАК СтавкаНДС,
	|	СчетФактураВыданныйАвансы.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	СчетФактураВыданныйАвансы.Номенклатура КАК Товар,
	|	СчетФактураВыданныйАвансы.Содержание КАК Содержание,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК ИдентификаторСтроки,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СчетФактураВыданныйАвансы.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОказанияУслуг_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОказаниеУслугКонтрагенты.Ссылка КАК Ссылка,
	|	ОказаниеУслуг.Номер КАК Номер,
	|	ОказаниеУслуг.Дата КАК Дата,
	|	ОказаниеУслугКонтрагенты.Контрагент КАК Контрагент,
	|	ОказаниеУслуг.Организация КАК Организация,
	|	ОказаниеУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ОказаниеУслугКонтрагенты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК КурсВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	ОказаниеУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Контрагенты КАК ОказаниеУслугКонтрагенты
	|		ПО ОказаниеУслуг.Ссылка = ОказаниеУслугКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ОказаниеУслуг.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ОказаниеУслугКонтрагенты.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОказаниеУслуг.Организация = Организации.Ссылка
	|ГДЕ
	|	ОказаниеУслугКонтрагенты.Ссылка = &ДокСсылка
	|	И ОказаниеУслугКонтрагенты.СчетФактура = &СчетФактура";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.ОказаниеУслуг;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ОказаниеУслуг.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличнойЧастиОказанияУслуг_БП20()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОказаниеУслуг.Ссылка КАК Ссылка,
	|	1 КАК НомерСтроки,
	|	""Услуги"" КАК ВидПоступления,
	|	ОказаниеУслуг.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ОказаниеУслугКонтрагенты.Количество КАК Количество,
	|	ОказаниеУслугКонтрагенты.Цена КАК Цена,
	|	ОказаниеУслугКонтрагенты.Сумма КАК Сумма,
	|	ОказаниеУслугКонтрагенты.СуммаНДС КАК СуммаНДС,
	|	ОказаниеУслуг.СтавкаНДС КАК СтавкаНДС,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	""Контрагенты"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Контрагенты КАК ОказаниеУслугКонтрагенты
	|		ПО ОказаниеУслуг.Ссылка = ОказаниеУслугКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ОказаниеУслуг.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ОказаниеУслугКонтрагенты.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОказаниеУслуг.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ОказаниеУслуг.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ОказаниеУслугКонтрагенты.Ссылка = &ДокСсылка
	|	И ОказаниеУслугКонтрагенты.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомиссионераОПродажах.Номер КАК Номер,
	|	ОтчетКомиссионераОПродажах.Дата КАК Дата,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомиссионераОПродажах.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомиссионераОПродажах.Грузоотправитель КАК Грузоотправитель,
	|	ОтчетКомиссионераОПродажах.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Сделка,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЛОЖЬ КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомиссионераОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОтчетКомиссионераОПродажах.Организация = Организации.Ссылка
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &ДокСсылка
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура";
	
	ВыражениеПодразделение = "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)";
	МетаданныеИсточника = Метаданные.Документы.ОтчетКомиссионераОПродажах;
	Если ЕстьРеквизитОбъектаЛок("ПодразделениеОрганизации", МетаданныеИсточника) Тогда
		ВыражениеПодразделение = "ОтчетКомиссионераОПродажах.ПодразделениеОрганизации";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&ПодразделениеОрганизации", ВыражениеПодразделение);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_БП20()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ Товары.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираТовары.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	&СтранаПроисхожденияУчастникЕАЭС КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	Товары.НомерГТД.Код КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираТовары
	|		ПО Товары.СтранаПроисхождения = КлассификаторСтранМираТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК Покупатели
	|		ПО Товары.Ссылка = Покупатели.Ссылка
	|			И Товары.КлючСтроки = Покупатели.КлючСтроки
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Покупатели.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	ВыражениеСтранаУчастникЕАЭС = "ВЫБОР
	|		КОГДА Товары.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.УчастникЕАЭС
	|		ИНАЧЕ КлассификаторСтранМираТовары.УчастникЕАЭС
	|	КОНЕЦ";
	
	Если Не ЕстьРеквизитОбъектаЛок("УчастникЕАЭС", Метаданные.Справочники.КлассификаторСтранМира) Тогда
		// БП 2.0.67.4 и ниже
		ВыражениеСтранаУчастникЕАЭС = "ЛОЖЬ";
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "&СтранаПроисхожденияУчастникЕАЭС", ВыражениеСтранаУчастникЕАЭС);
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
	|	Шапка.Организация.ИНН КАК ОрганизацияИНН,
	|	Шапка.Организация.КПП КАК ОрганизацияКПП,
	|	Шапка.СкладОтправитель КАК СкладОтправитель,
	|	Шапка.СкладОтправитель.Наименование КАК СкладОтправительПредставление,
	|	Шапка.СкладПолучатель КАК СкладПолучатель,
	|	Шапка.СкладПолучатель.Наименование КАК СкладПолучательПредставление,
	|	Шапка.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	Шапка.ПодразделениеПолучатель КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_БП20()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Товар,
	|	ТЧ.Номенклатура.Код КАК ТоварКод,
	|	ТЧ.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ТЧ.Номенклатура.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	|	ЕСТЬNULL(ТЧ.Номенклатура.НомерГТД.Код, """") КАК ПолныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.Номенклатура.НомерГТД.РегистрационныйНомер, """") КАК РегистрационныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.Номенклатура.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТЧ.Номенклатура.СтранаПроисхождения.Наименование, """") КАК СтранаПроисхожденияНаименование,
	|	ЕСТЬNULL(ТЧ.Номенклатура.СтранаПроисхождения.УчастникЕАЭС, ЛОЖЬ) КАК СтранаПроисхожденияУчастникЕАЭС,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	"""" КАК ХарактеристикаПредставление,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
	|	"""" КАК СерияПредставление,
	|	ТЧ.ЕдиницаИзмерения КАК Упаковка,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена * ТЧ.Количество КАК Сумма,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Ссылка,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Номенклатура.Артикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)),
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код, """"""""),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование, """"""""),
	|	0,
	|	ТЧ.Количество,
	|	0,
	|	ЛОЖЬ,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	2
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Ссылка,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваров_БП20(ОснованиеОтгрузки)
	
	Перем Результат;
	
	Если ЗначениеЗаполнено(ОснованиеОтгрузки) Тогда
		Результат = УПД970_РеквизитыОснованияОтгрузкиТоваровПоДоговору(ОснованиеОтгрузки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОснованиеОтгрузкиТоваровПоДокументу_БП20(ДокументСсылка)
	
	Результат = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ДоговорКонтрагента");
	Возврат Результат;
	
КонецФункции

Функция УПД970_ОснованиеОтгрузкиТоваровПоДокументуОказанияУслуг_БП20(ДокументСсылка, СчетФактура)
	
	Перем Результат;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОказаниеУслугКонтрагенты.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОказаниеУслуг.Контрагенты КАК ОказаниеУслугКонтрагенты
	|ГДЕ
	|	ОказаниеУслугКонтрагенты.Ссылка = &ДокСсылка
	|	И ОказаниеУслугКонтрагенты.СчетФактура = &СчетФактура"
	);
	Запрос.УстановитьПараметр("ДокСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДоговорКонтрагента;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьИдентификаторГосКонтракта_БП20(Контент, ДанныеШапки)

	Если ЭтоСчетФактураВыданный(ДанныеШапки.Ссылка) Тогда
		Контент.GovernmentContractInfo = ДанныеШапки.ИдентификаторГосКонтракта;
	КонецЕсли;
	
КонецПроцедуры

//} БП 2.0

//{ Функции и процедуры для КА 1.1

Функция УПД970_ИсходныеДанныеДокументаОснованияСчетаФактуры_КА11(ДокументСсылка, СчетФактура, ФункцияДокумента)
	
	Перем Результат;
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Результат = УПД970_ИсходныеДанные_РеализацияТоваровУслуг(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоИсправлениеРеализации(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_КорректировкаРеализации(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомитентуОПродажах(ДокументСсылка, СчетФактура);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Результат = УПД970_ИсходныеДанные_ВозвратуТоваровПоставщику(ДокументСсылка, ФункцияДокумента);
		
	ИначеЕсли ЭтоПередачаОС(ДокументСсылка) Тогда
		
		Результат = УПД970_ИсходныеДанные_ПередачеОС(ДокументСсылка);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		Результат = УПД970_ИсходныеДанные_ОтчетКомиссионераОПродажах(ДокументСсылка, СчетФактура);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неподдерживаемый тип документа: %1'");
		
		ТекстОшибки = Ядро.Общее_ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТипЗнч(ДокументСсылка));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиРеализацииТоваровУслуг_КА11()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ Т.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейРеализацииТоваровУслуг_КА11(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТоварыУслуги =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ СерииНоменклатуры.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираСерии.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	3,
	|	Услуги.НомерСтроки,
	|	""Услуги"",
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	ЕдиницыИзмерения.Представление,
	|	ЕдиницыИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	Услуги.Сумма,
	|	Услуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТоварыУслуги);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	2 КАК Порядок,
		|	ВозвратнаяТара.НомерСтроки КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	"""" КАК ТоварКодТНВЭД,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕдиницыИзмерения.Представление КАК ЕдиницаИзмеренияНаименование,
		|	ЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	0 КАК ЕстьНДС,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	ВозвратнаяТара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
		|		ПО СпрНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиКорректировкиРеализации_КА11()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Дата КАК Дата,
	|	Т.ВалютаДокумента КАК ВалютаДокумента,
	|	Т.Организация КАК Организация,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Грузоотправитель КАК Грузоотправитель,
	|	Т.Грузополучатель КАК Грузополучатель,
	|	Т.АдресДоставки КАК АдресДоставки,
	|	Т.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА Т.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Т.Организация.ОсновнойБанковскийСчет
	|		ИНАЧЕ Т.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	Т.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Т.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Т.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейКорректировкиРеализации_КА11()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ СерииНоменклатуры.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираСерии.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьНДС,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	Услуги.НомерСтроки КАК ИдентификаторСтроки,
	|	""Услуги"" КАК ИмяТабличнойЧасти,
	|	Услуги.Номенклатура,
	|	ВЫРАЗИТЬ(Услуги.Содержание КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)),
	|	"""",
	|	СпрНоменклатура.Код,
	|	СпрНоменклатура.Артикул,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ЛОЖЬ,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Представление,
	|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код,
	|	НЕОПРЕДЕЛЕНО,
	|	Услуги.Количество,
	|	Услуги.Цена,
	|	Услуги.СтавкаНДС,
	|	Услуги.СуммаНДС,
	|	Услуги.Сумма,
	|	Услуги.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Услуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Услуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Услуги.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиВозвратаТоваровПоставщику_КА11()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
	|	ВозвратТоваровПоставщику.Номер КАК Номер,
	|	ВозвратТоваровПоставщику.Дата КАК Дата,
	|	ВозвратТоваровПоставщику.Организация КАК Организация,
	|	ВозвратТоваровПоставщику.Сделка КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации,
	|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ВозвратТоваровПоставщику.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ВозвратТоваровПоставщику.Ответственный КАК Ответственный,
	|	ВозвратТоваровПоставщику.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВозвратТоваровПоставщику.Грузоотправитель КАК Грузоотправитель,
	|	ВозвратТоваровПоставщику.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.БанковскийСчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА Организации.ОсновнойБанковскийСчет
	|		ИНАЧЕ ВозвратТоваровПоставщику.БанковскийСчетОрганизации
	|	КОНЕЦ КАК БанковскийСчетОрганизации,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВозвратТоваровПоставщику.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВозвратТоваровПоставщику.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВозвратТоваровПоставщику.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВозвратТоваровПоставщику.Организация = Организации.Ссылка
	|
	|ГДЕ
	|	ВозвратТоваровПоставщику.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейВозвратаТоваровПоставщику_КА11(ФункцияДокумента)
	
	ЧастиЗапроса = Новый Массив;
	
	ТекстЗапросаТовары =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	1 КАК Порядок,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ СерииНоменклатуры.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираСерии.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.Сумма КАК Сумма,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	"""" КАК НомерГТД
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаТовары);
	
	ДобавитьВозвратнуюТару = (ФункцияДокумента = ФункцияДокументаУПД_ДОП());
	
	Если ДобавитьВозвратнуюТару Тогда
		
		ТекстЗапросаВозвратнаяТара =
		"ВЫБРАТЬ
		|	""ВозвратнаяТара"" КАК ВидПоступления,
		|	2 КАК Порядок,
		|	ВозвратнаяТара.Номенклатура КАК Товар,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
		|	СпрНоменклатура.Код КАК ТоварКод,
		|	СпрНоменклатура.Артикул КАК ТоварАртикул,
		|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияКод,
		|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
		|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
		|	ВозвратнаяТара.Количество КАК Количество,
		|	ВозвратнаяТара.Цена КАК Цена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ВозвратнаяТара.Сумма КАК Сумма,
		|	ВозвратнаяТара.НомерСтроки КАК НомерСтроки,
		|	ВозвратнаяТара.Ссылка КАК Ссылка,
		|	ВозвратнаяТара.НомерСтроки КАК ИдентификаторСтроки,
		|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
		|	ЛОЖЬ КАК ПрослеживаемыйТовар,
		|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		|	СпрНоменклатура.БазоваяЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	"""" КАК НомерГТД
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.ВозвратнаяТара КАК ВозвратнаяТара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ВозвратнаяТара.Номенклатура = СпрНоменклатура.Ссылка
		|
		|ГДЕ
		|	ВозвратнаяТара.Ссылка = &Ссылка";
		
		ЧастиЗапроса.Добавить(ТекстЗапроса_ОбъединитьВсе());
		ЧастиЗапроса.Добавить(ТекстЗапросаВозвратнаяТара);
		
	КонецЕсли;
	
	ТекстЗапросаИтоги = "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	ЧастиЗапроса.Добавить(ТекстЗапросаИтоги);
	
	Результат = Общее_СоединитьСтроку(ЧастиЗапроса, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПередачиОС_КА11()

	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаОС.Ссылка КАК Ссылка,
	|	ПередачаОС.Номер КАК Номер,
	|	ПередачаОС.Дата КАК Дата,
	|	ПередачаОС.Организация КАК Организация,
	|	ПередачаОС.Подразделение КАК Подразделение,
	|	ПередачаОС.Сделка КАК Сделка,
	|	ПередачаОС.Контрагент КАК Контрагент,
	|	ПередачаОС.ВалютаДокумента КАК ВалютаДокумента,
	|	ПередачаОС.УчитыватьНДС КАК УчитыватьНДС,
	|	ПередачаОС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПередачаОС.СуммаДокумента КАК СуммаДокумента,
	|	ПередачаОС.Ответственный КАК Ответственный,
	|	ПередачаОС.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ПередачаОС.Грузоотправитель КАК Грузоотправитель,
	|	ПередачаОС.Грузополучатель КАК Грузополучатель,
	|	ПередачаОС.АдресДоставки КАК АдресДоставки,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ПередачаОС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ПередачаОС.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПередачаОС.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ПередачаОС.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ПередачаОС.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПередачаОС.Организация = Организации.Ссылка
	|ГДЕ
	|	ПередачаОС.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиПередачиОС_КА11()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК Товар,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрОсновныеСредства.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрОсновныеСредства.Код КАК ТоварКод,
	|	СпрОсновныеСредства.Код КАК ТоварАртикул,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	"""" КАК ЕдиницаИзмеренияКод,
	|	"""" КАК ЕдиницаИзмеренияНаименование,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СтавкаНДС КАК СтавкаНДС,
	|	ОсновныеСредства.СуммаНДС КАК СуммаНДС,
	|	ОсновныеСредства.КодТНВЭД КАК КодТНВЭД,
	|	ОсновныеСредства.НомерСтроки КАК ИдентификаторСтроки,
	|	""ОС"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	"""" КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	"""" КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК СпрОсновныеСредства
	|		ПО ОсновныеСредства.ОсновноеСредство = СпрОсновныеСредства.Ссылка
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	ОсновныеСредства.НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиОтчетаКомиссионераОПродажах_КА11()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомиссионераОПродажах.Номер КАК Номер,
	|	ОтчетКомиссионераОПродажах.Дата КАК Дата,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОтчетКомиссионераОПродажах.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОтчетКомиссионераОПродажах.Грузоотправитель КАК Грузоотправитель,
	|	ОтчетКомиссионераОПродажах.Грузополучатель КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомиссионераОПродажах.Сделка КАК Сделка,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Организации.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОтчетКомиссионераОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОтчетКомиссионераОПродажах.Организация = Организации.Ссылка
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка = &ДокСсылка
	|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаТабличнойЧастиОтчетаКомиссионераОПродажах_КА11()

	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Товары"" КАК ВидПоступления,
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Товар,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА Товары.КодТНВЭД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ СерииНоменклатуры.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ КлассификаторСтранМираСерии.Код
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	СерииНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (СпрНоменклатура.СтранаПроисхождения = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Товары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираСерии
	|		ПО СерииНоменклатуры.СтранаПроисхождения = КлассификаторСтранМираСерии.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК Покупатели
	|		ПО Товары.Ссылка = Покупатели.Ссылка
	|			И Товары.КлючСтроки = Покупатели.КлючСтроки
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|	И Покупатели.СчетФактура = &СчетФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПоступления,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиСчетФактураВыданныйНаАванс_КА11()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.Организация КАК Организация,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
	|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВалютаВзаиморасчетов, """") КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РеализацияТоваровОблагаемыхНДСУПокупателя, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	ЕСТЬNULL(ПлатежноеПоручениеВходящее.СчетОрганизации, Организации.ОсновнойБанковскийСчет) КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО СчетФактураВыданный.ВалютаДокумента = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактураВыданный.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СчетФактураВыданный.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|		ПО СчетФактураВыданный.ДокументОснование = ПлатежноеПоручениеВходящее.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличнойЧастиСчетФактураВыданныйНаАванс_КА11()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Прочее"" КАК ВидПоступления,
	|	СчетФактураВыданныйАвансы.Ссылка КАК Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйАвансы.Сумма КАК Сумма,
	|	СчетФактураВыданныйАвансы.СуммаНДС КАК СуммаНДС,
	|	СчетФактураВыданныйАвансы.СтавкаНДС КАК СтавкаНДС,
	|	СчетФактураВыданныйАвансы.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(СпрНоменклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	СпрНоменклатура.Код КАК ТоварКод,
	|	СпрНоменклатура.Артикул КАК ТоварАртикул,
	|	СчетФактураВыданныйАвансы.Номенклатура КАК Товар,
	|	СчетФактураВыданныйАвансы.Содержание КАК Содержание,
	|	НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК НомерГТД,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ЛОЖЬ КАК ПрослеживаемыйКомплект,
	|	СчетФактураВыданныйАвансы.НомерСтроки КАК ИдентификаторСтроки,
	|	""Авансы"" КАК ИмяТабличнойЧасти,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК СерияНоменклатуры
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СчетФактураВыданныйАвансы.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхШапкиПеремещенияТоваров_КА11()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Номер КАК Номер,
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
	|	Шапка.Организация.ИНН КАК ОрганизацияИНН,
	|	Шапка.Организация.КПП КАК ОрганизацияКПП,
	|	Шапка.СкладОтправитель КАК СкладОтправитель,
	|	Шапка.СкладОтправитель.Наименование КАК СкладОтправительПредставление,
	|	Шапка.СкладПолучатель КАК СкладПолучатель,
	|	Шапка.СкладПолучатель.Наименование КАК СкладПолучательПредставление,
	|	Шапка.Подразделение КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТекстЗапросаДанныхТабличныхЧастейПеремещенияТоваров_КА11()
	
	Результат =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка КАК Ссылка,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Номенклатура КАК Товар,
	|	ТЧ.Номенклатура.Код КАК ТоварКод,
	|	ТЧ.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварПолноеНаименование,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.Код, """") КАК ПолныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.НомерГТД.РегистрационныйНомер, """") КАК РегистрационныйНомерГТД,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Код, """") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.СтранаПроисхождения.Наименование, """") КАК СтранаПроисхожденияНаименование,
	|	ЛОЖЬ КАК СтранаПроисхожденияУчастникЕАЭС,
	|	ТЧ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ТЧ.ХарактеристикаНоменклатуры.Наименование, """") КАК ХарактеристикаПредставление,
	|	ТЧ.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЕСТЬNULL(ТЧ.СерияНоменклатуры.Наименование, """") КАК СерияПредставление,
	|	ТЧ.ЕдиницаИзмерения КАК Упаковка,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(ТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена * ТЧ.Количество КАК Сумма,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	1 КАК Порядок
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ.Ссылка,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	ТЧ.Номенклатура.Код,
	|	ТЧ.Номенклатура.Артикул,
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТЧ.Номенклатура.Наименование КАК СТРОКА(1000)),
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТЧ.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Код, """"""""),
	|	ЕСТЬNULL(ТЧ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование, """"""""),
	|	0,
	|	ТЧ.Количество,
	|	0,
	|	ЛОЖЬ,
	|	ТЧ.НомерСтроки КАК ИдентификаторСтроки,
	|	""ВозвратнаяТара"" КАК ИмяТабличнойЧасти,
	|	2
	|ИЗ
	|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Ссылка,
	|	НомерСтроки";
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента_КА11(ДанныеУчастникаЭДО, Ссылка)
	
	СведенияОКонтрагенте = УПД970_СведенияОКонтрагенте_КА11(Ссылка);
	
	ЭтоИностраннаяОрганизация = СведенияОКонтрагенте.НеЯвляетсяРезидентом;
	
	Если Не ЭтоИностраннаяОрганизация Тогда
		
		СведенияОСтране = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Справочники.КлассификаторСтранМира.Россия, "Ссылка, Код, Наименование");
		
		ДанныеУчастникаЭДО.Страна = СведенияОСтране.Ссылка;
		ДанныеУчастникаЭДО.СтранаКод = СведенияОСтране.Код;
		ДанныеУчастникаЭДО.СтранаНаименование = СведенияОСтране.Наименование;
		
	КонецЕсли;
	
	ДанныеУчастникаЭДО.ЮрФизЛицо = СведенияОКонтрагенте.ЮрФизЛицо;
	ДанныеУчастникаЭДО.Наименование = СведенияОКонтрагенте.НаименованиеПолное;
	
	ДанныеУчастникаЭДО.ЭлектроннаяПочта = УПД970_АдресЭлектроннойПочты(Ссылка);
	
КонецПроцедуры

Функция УПД970_СведенияОКонтрагенте_КА11(Ссылка)
	
	РеквизитыКонтрагента = Новый Структура;
	РеквизитыКонтрагента.Вставить("ЮрФизЛицо", "ЮрФизЛицо");
	РеквизитыКонтрагента.Вставить("НаименованиеПолное", "НаименованиеПолное");
	РеквизитыКонтрагента.Вставить("НеЯвляетсяРезидентом", "НеЯвляетсяРезидентом");
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыКонтрагента);
	
	Возврат Результат;
	
КонецФункции

//} КА 1.1

//} УПД970 ПОЛУЧЕНИЕ ИСХОДНЫХ ДАННЫХ

//{ Вспомогательные процедуры и функции сбора контента

Функция УПД970_РезультатыЗапросовИсходныхДанныхДокумента(Запросы, ДокСсылка)
	
	СтрОбъединениеЗапросов = ТекстЗапроса_РазделительЗапросов();
	
	ТекстЗапроса = Общее_СоединитьСтроку(Запросы, СтрОбъединениеЗапросов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоШапке", РезультатыЗапроса[0]);
	Результат.Вставить("РезультатПоТабличнойЧасти", РезультатыЗапроса[1]);
	
	КоличествоЗапросовВПакетеСДанными = 3;
	
	Если РезультатыЗапроса.Количество() = КоличествоЗапросовВПакетеСДанными Тогда
		Результат.Вставить("РезультатСведенияПрослеживаемости", РезультатыЗапроса[2]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ДанныеУчастникаЭДО(Ссылка, ДатаСведений, БанковскийСчет = Неопределено)

	Результат = Контракт_ДанныеУчастникаЭДО();
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	СведенияОЮрФизЛице = МодульУправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Ссылка, ДатаСведений, , БанковскийСчет);
	
	Результат.Ссылка = Ссылка;
	
	Результат.ИНН = СокрЛП(СведенияОЮрФизЛице.ИНН);
	Результат.КПП = СокрЛП(СведенияОЮрФизЛице.КПП);
	Результат.КодПоОКПО = СокрЛП(СведенияОЮрФизЛице.КодПоОКПО);
	
	Если ЗначениеЗаполнено(СведенияОЮрФизЛице.Банк) Тогда
		Результат.НаименованиеБанка = СведенияОЮрФизЛице.Банк.Наименование;
	Иначе
		Результат.НаименованиеБанка = "";
	КонецЕсли;
	
	Результат.НомерСчета = СокрЛП(СведенияОЮрФизЛице.НомерСчета);
	Результат.КоррСчет = СокрЛП(СведенияОЮрФизЛице.КоррСчет);
	Результат.БИК = СокрЛП(СведенияОЮрФизЛице.БИК);
	
	Результат.Телефоны = СведенияОЮрФизЛице.Телефоны;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(Результат, Ссылка);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если ЭтоКонфигурацияКА() Тогда
			УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента_КА11(Результат, Ссылка);
		Иначе
			УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента(Результат, Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОПодразделенииОрганизации(Организация, ПодразделениеОрганизации, ДатаСведений)
	
	Результат = Контракт_ДанныеУчастникаЭДО();
	
	СведенияОбОрганизации = УПД970_ДанныеУчастникаЭДО(Организация, ДатаСведений);
	АдресПодразделения = УПД970_СведенияОФактическомАдресе(ПодразделениеОрганизации);
	
	Результат.Ссылка = ПодразделениеОрганизации;
	Результат.Адрес = АдресПодразделения;
	
	// Реквизит НаименованиеПолное в ПодразделенииОрганизации появился с версии 1.3.217
	ИмяРеквизитаНаименование = "НаименованиеПолное";
	ЕстьРеквизитПолноеНаименование = ЕстьРеквизитОбъектаЛок(
		ИмяРеквизитаНаименование,
		ПодразделениеОрганизации.Метаданные()
	);
	
	Если ЕстьРеквизитПолноеНаименование Тогда
		
		ИменаРеквизитов = "КПП, НаименованиеПолное";
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ПодразделениеОрганизации,
				ИменаРеквизитов);
		
		Результат.Наименование = РеквизитыПодразделения.НаименованиеПолное;
		Результат.КПП = РеквизитыПодразделения.КПП;
		
	Иначе
		
		ИменаРеквизитов = "КПП, Наименование";
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ПодразделениеОрганизации,
				ИменаРеквизитов);
		
		Результат.Наименование = РеквизитыПодразделения.Наименование;
		Результат.КПП = РеквизитыПодразделения.КПП;
		
	КонецЕсли;
	
	Результат.ИНН = СведенияОбОрганизации.ИНН;
	Результат.Страна = СведенияОбОрганизации.Страна;
	Результат.СтранаНаименование = СведенияОбОрганизации.СтранаНаименование;
	Результат.СтранаКод = СведенияОбОрганизации.СтранаКод;
	Результат.ЮрФизЛицо = СведенияОбОрганизации.ЮрФизЛицо;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиОрганизации(ДанныеУчастникаЭДО, Ссылка)
	
	СведенияОбОрганизации = УПД970_СведенияОбОрганизации(Ссылка);
	
	ЭтоИндивидуальныйПредприниматель = ЗначениеЗаполнено(СведенияОбОрганизации.ИндивидуальныйПредприниматель);
	ЭтоИностраннаяОрганизация = СведенияОбОрганизации.ИностраннаяОрганизация;
	
	Если Не ЗначениеЗаполнено(СведенияОбОрганизации.Страна)
		И Не ЭтоИностраннаяОрганизация Тогда
		
		СведенияОСтране = ЗначенияРеквизитовОбъектаЛок(
			Справочники.КлассификаторСтранМира.Россия, "Ссылка, Код, Наименование");
			
		СведенияОбОрганизации.Страна = СведенияОСтране.Ссылка;
		СведенияОбОрганизации.СтранаКод = СведенияОСтране.Код;
		СведенияОбОрганизации.СтранаНаименование = СведенияОСтране.Наименование;
		
	КонецЕсли;
	
	ДанныеУчастникаЭДО.ЮрФизЛицо = СведенияОбОрганизации.ЮрФизЛицо;

	Если ЭтоИндивидуальныйПредприниматель Тогда
		
		ДанныеУчастникаЭДО.Наименование = СведенияОбОрганизации.НаименованиеИП;
		
		ДанныеУчастникаЭДО.ОГРНИП = СведенияОбОрганизации.ОГРН;
		ДанныеУчастникаЭДО.ДатаОГРНИП = СведенияОбОрганизации.ДатаРегистрации;
		
	ИначеЕсли ЭтоИностраннаяОрганизация Тогда
		
		ДанныеУчастникаЭДО.Наименование = СведенияОбОрганизации.НаименованиеИнострОрганизации;
		
		ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации = СведенияОбОрганизации.КодВСтранеРегистрации;
		
	Иначе
		
		НаименованиеОрганизации = СведенияОбОрганизации.НаименованиеСокращенное;
		Если НЕ ЗначениеЗаполнено(НаименованиеОрганизации) Тогда
			НаименованиеОрганизации = СведенияОбОрганизации.НаименованиеПолное;
		КонецЕсли;
		
		ДанныеУчастникаЭДО.Наименование = НаименованиеОрганизации;
		
	КонецЕсли;

	ДанныеУчастникаЭДО.Страна = СведенияОбОрганизации.Страна;
	ДанныеУчастникаЭДО.СтранаКод = СведенияОбОрганизации.СтранаКод;
	ДанныеУчастникаЭДО.СтранаНаименование = СведенияОбОрганизации.СтранаНаименование;
	
	Свидетельство = "";
	Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоСерияНомер) Тогда
		Свидетельство = "свидетельство " + СведенияОбОрганизации.СвидетельствоСерияНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоДатаВыдачи) Тогда
		Свидетельство = Свидетельство + " от " + Формат(СведенияОбОрганизации.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ДанныеУчастникаЭДО.Свидетельство = Свидетельство;
	ДанныеУчастникаЭДО.ЭлектроннаяПочта = УПД970_АдресЭлектроннойПочты(Ссылка);
	
КонецПроцедуры

Функция УПД970_СведенияОбОрганизации(Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Т.НаименованиеПолное КАК НаименованиеПолное,
	|	Т.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	&СтранаРегистрацииСсылка КАК Страна,
	|	&СтранаРегистрацииКод КАК СтранаКод,
	|	&СтранаРегистрацииНаименование КАК СтранаНаименование,
	|	&НаименованиеИнострОрганизации КАК НаименованиеИнострОрганизации,
	|	&ИностраннаяОрганизация КАК ИностраннаяОрганизация,
	|	&КодВСтранеРегистрации КАК КодВСтранеРегистрации,
	|	Т.ИндивидуальныйПредприниматель КАК ИндивидуальныйПредприниматель,
	|	Т.ИндивидуальныйПредприниматель.Наименование КАК НаименованиеИП,
	|	Т.СвидетельствоСерияНомер КАК СвидетельствоСерияНомер,
	|	Т.СвидетельствоДатаВыдачи КАК СвидетельствоДатаВыдачи,
	|	Т.ОГРН КАК ОГРН,
	|	Т.ДатаРегистрации КАК ДатаРегистрации
	|ИЗ
	|	Справочник.Организации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	СтранаРегистрацииСсылка = "Т.СтранаРегистрации";
	СтранаРегистрацииКод = "ЕСТЬNULL(Т.СтранаРегистрации.Код, """")";
	СтранаРегистрацииНаименование = "ЕСТЬNULL(Т.СтранаРегистрации.Наименование, """")";
	ИностраннаяОрганизация = "Т.ИностраннаяОрганизация";
	КодВСтранеРегистрации = "Т.КодВСтранеРегистрации";
	НаименованиеИнострОрганизации = "Т.НаименованиеИнострОрганизации";
	
	ОбъектМД = Метаданные.Справочники.Организации;
	Если Не ЕстьРеквизитОбъектаЛок("СтранаРегистрации", ОбъектМД) Тогда
		СтранаРегистрацииСсылка = "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
		СтранаРегистрацииКод = """""";
		СтранаРегистрацииНаименование = """""";
		ИностраннаяОрганизация = "ЛОЖЬ";
		КодВСтранеРегистрации = """""";
		НаименованиеИнострОрганизации = """""";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаРегистрацииСсылка", СтранаРегистрацииСсылка);
	Замены.Добавить("&СтранаРегистрацииКод", СтранаРегистрацииКод);
	Замены.Добавить("&СтранаРегистрацииНаименование", СтранаРегистрацииНаименование);
	Замены.Добавить("&ИностраннаяОрганизация", ИностраннаяОрганизация);
	Замены.Добавить("&КодВСтранеРегистрации", КодВСтранеРегистрации);
	Замены.Добавить("&НаименованиеИнострОрганизации", НаименованиеИнострОрганизации);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Ошибка = СтрШаблонЛок("Не удалось прочитать данные организации (Ссылка = %1)", Ссылка);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЮрФизЛицо", Выборка.ЮрФизЛицо);
	Результат.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);
	Результат.Вставить("НаименованиеСокращенное", Выборка.НаименованиеСокращенное);
	Результат.Вставить("Страна", Выборка.Страна);
	Результат.Вставить("СтранаКод", Выборка.СтранаКод);
	Результат.Вставить("СтранаНаименование", Выборка.СтранаНаименование);
	Результат.Вставить("НаименованиеИнострОрганизации", Выборка.НаименованиеИнострОрганизации);
	Результат.Вставить("ИностраннаяОрганизация", Выборка.ИностраннаяОрганизация);
	Результат.Вставить("КодВСтранеРегистрации", Выборка.КодВСтранеРегистрации);
	Результат.Вставить("ИндивидуальныйПредприниматель", Выборка.ИндивидуальныйПредприниматель);
	Результат.Вставить("НаименованиеИП", Выборка.НаименованиеИП);
	Результат.Вставить("СвидетельствоСерияНомер", Выборка.СвидетельствоСерияНомер);
	Результат.Вставить("СвидетельствоДатаВыдачи", Выборка.СвидетельствоДатаВыдачи);
	Результат.Вставить("ОГРН", Выборка.ОГРН);
	Результат.Вставить("ДатаРегистрации", Выборка.ДатаРегистрации);
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбУчастникеЭДОДаннымиКонтрагента(ДанныеУчастникаЭДО, Ссылка)
	
	СведенияОКонтрагенте = УПД970_СведенияОКонтрагенте(Ссылка);
	
	ЭтоИностраннаяОрганизация = СведенияОКонтрагенте.НеЯвляетсяРезидентом;
	
	Если Не ЗначениеЗаполнено(СведенияОКонтрагенте.Страна)
		И Не ЭтоИностраннаяОрганизация Тогда
		
		СведенияОСтране = ЗначенияРеквизитовОбъектаЛок(
			Справочники.КлассификаторСтранМира.Россия, "Ссылка, Код, Наименование");
		
		СведенияОКонтрагенте.Страна = СведенияОСтране.Ссылка;
		СведенияОКонтрагенте.СтранаКод = СведенияОСтране.Код;
		СведенияОКонтрагенте.СтранаНаименование = СведенияОСтране.Наименование;
		
	КонецЕсли;
	
	Если ЭтоИностраннаяОрганизация Тогда
		ДанныеУчастникаЭДО.НалоговыйНомерВСтранеРегистрации = СведенияОКонтрагенте.РегистрационныйНомер;
	КонецЕсли;
	
	Если ЭтоКонфигурацияБП() Тогда
		Если НЕ ЭтоИностраннаяОрганизация Тогда
			ДанныеУчастникаЭДО.ОГРНИП = СведенияОКонтрагенте.РегистрационныйНомер;
		КонецЕсли;
	Иначе
		ДанныеУчастникаЭДО.ОГРНИП = СведенияОКонтрагенте.ОГРН;
	КонецЕсли;
	
	ДанныеУчастникаЭДО.ЮрФизЛицо = СведенияОКонтрагенте.ЮрФизЛицо;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.НаименованиеПолное) Тогда
		ДанныеУчастникаЭДО.Наименование = СведенияОКонтрагенте.НаименованиеПолное;
	Иначе 
		ДанныеУчастникаЭДО.Наименование = СведенияОКонтрагенте.Наименование;
	КонецЕсли;
	
	ДанныеУчастникаЭДО.Страна = СведенияОКонтрагенте.Страна;
	ДанныеУчастникаЭДО.СтранаКод = СведенияОКонтрагенте.СтранаКод;
	ДанныеУчастникаЭДО.СтранаНаименование = СведенияОКонтрагенте.СтранаНаименование;
	ДанныеУчастникаЭДО.НеЯвляетсяРезидентом = ЭтоИностраннаяОрганизация;
	ДанныеУчастникаЭДО.ЭлектроннаяПочта = УПД970_АдресЭлектроннойПочты(Ссылка);
	
КонецПроцедуры

Функция УПД970_СведенияОКонтрагенте(Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Т.НаименованиеПолное КАК НаименованиеПолное,
	|	Т.Наименование КАК Наименование,
	|	&СтранаРегистрацииСсылка КАК Страна,
	|	&СтранаРегистрацииКод КАК СтранаКод,
	|	&СтранаРегистрацииНаименование КАК СтранаНаименование,
	|	Т.НеЯвляетсяРезидентом КАК НеЯвляетсяРезидентом,
	|	&РегистрационныйНомер КАК РегистрационныйНомер,
	|	&ОГРН КАК ОГРН	
	|ИЗ
	|	Справочник.Контрагенты КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	СтранаРегистрацииСсылка = "Т.СтранаРегистрации";
	СтранаРегистрацииКод = "ЕСТЬNULL(Т.СтранаРегистрации.Код, """")";
	СтранаРегистрацииНаименование = "ЕСТЬNULL(Т.СтранаРегистрации.Наименование, """")";
	РегистрационныйНомер = "Т.РегистрационныйНомер";
	
	ОбъектМД = Метаданные.Справочники.Контрагенты;
	Если Не ЕстьРеквизитОбъектаЛок("СтранаРегистрации", ОбъектМД) Тогда
		СтранаРегистрацииСсылка = "ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
		СтранаРегистрацииКод = """""";
		СтранаРегистрацииНаименование = """""";
		РегистрационныйНомер = """""";
	КонецЕсли;
	
	Если ЕстьРеквизитОбъектаЛок("ОГРН", ОбъектМД) Тогда
		ОГРН = "Т.ОГРН";
	ИначеЕсли ЕстьРеквизитОбъектаЛок("РегистрационныйНомер", ОбъектМД) Тогда
		ОГРН = "Т.РегистрационныйНомер";
	Иначе
		ОГРН = """""";
	КонецЕсли;
	
	Замены = Новый СписокЗначений;
	Замены.Добавить("&СтранаРегистрацииСсылка", СтранаРегистрацииСсылка);
	Замены.Добавить("&СтранаРегистрацииКод", СтранаРегистрацииКод);
	Замены.Добавить("&СтранаРегистрацииНаименование", СтранаРегистрацииНаименование);
	Замены.Добавить("&ОГРН", ОГРН);
	Замены.Добавить("&РегистрационныйНомер", РегистрационныйНомер);
	
	Для Каждого Элемент Из Замены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Ошибка = СтрШаблонЛок("Не удалось прочитать данные контрагента (Ссылка = %1)", Ссылка);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЮрФизЛицо", Выборка.ЮрФизЛицо);
	Результат.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);
	Результат.Вставить("НеЯвляетсяРезидентом", Выборка.НеЯвляетсяРезидентом);
	Результат.Вставить("Страна", Выборка.Страна);
	Результат.Вставить("СтранаКод", Выборка.СтранаКод);
	Результат.Вставить("СтранаНаименование", Выборка.СтранаНаименование);
	Результат.Вставить("РегистрационныйНомер", Выборка.РегистрационныйНомер);
	Результат.Вставить("ОГРН", Выборка.ОГРН);
	Результат.Вставить("Наименование", Выборка.Наименование);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбЮридическомАдресе(Ссылка)
	
	Перем Результат;
	
	ЗаписьКИ = УПД970_ПолучитьАдресИзКонтактнойИнформации(
		Ссылка, 
		Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес);
	
	Если ЗаписьКИ <> Неопределено Тогда
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОФактическомАдресе(Ссылка)
	
	Перем Результат;
	
	ЗаписьКИ = УПД970_ПолучитьАдресИзКонтактнойИнформации(
		Ссылка, 
		Перечисление_ВидыКонтактнойИнформации().ФактическийАдрес);
	
	Если ЗаписьКИ <> Неопределено Тогда
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеДоставки(Ссылка, АдресДоставки)
	
	Перем Результат;
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	ПредставлениеАдреса = МодульУправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(АдресДоставки);
	
	ЗаписьКИ = УПД970_ПолучитьАдресИзПредставленияАдреса(Ссылка, ПредставлениеАдреса);
	
	Если ЗаписьКИ <> Неопределено Тогда
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
		Результат.ТипАдреса = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеСклада(Ссылка)
	
	Результат = Неопределено;
	ЗаписьКИ = УПД970_ПолучитьАдресИзКонтактнойИнформации(Ссылка);
	
	Если ЗаписьКИ <> Неопределено Тогда
		Результат = УПД970_СведенияОбАдресе(ЗаписьКИ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресе(ЗаписьКИ)
	
	Если ЕстьФункциональностьРаботаСАдресами() Тогда
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Значение) Тогда
			Адрес = ЗаписьКИ.Значение;
		Иначе
			Адрес = ЗаписьКИ;
		КонецЕсли;
		
		Результат = СведенияОбАдресеЛок(Адрес);
		
	Иначе
		
		Результат = УПД970_НовыйСведенияОбАдресе();
		УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(Результат, ЗаписьКИ);
		
	КонецЕсли;
	
	УПД970_ДополнитьСведенияОбАдресеОсновнойСтраной(Результат);
	
	СохраненноеПредставление = ПредставлениеАдреса(ЗаписьКИ);
	Результат.Вставить("СохраненноеПредставление", СохраненноеПредставление);

	ЭтоАдминистративноТерриториальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressRF(Результат);
	
	ЭтоМуниципальныйАдрес = Ложь;
	Если Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		ЭтоМуниципальныйАдрес = УПД970_АдресСоответствуетСтруктуреAddressSAR(Результат);
	КонецЕсли;
	
	Если Не ЭтоМуниципальныйАдрес
		И Не ЭтоАдминистративноТерриториальныйАдрес Тогда
		
		Результат.Представление = Результат.СохраненноеПредставление;
		Результат.ТипАдреса = ТипАдресаВСвободнойФорме();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressSAR(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ЭтоМуниципальныйАдрес = ЭтоМуниципальныйАдресЛок(СведенияОбАдресе.ТипАдреса);
	Если Не ЭтоМуниципальныйАдрес
		Или ЭтоКонфигурацияБП() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	ЕстьНаименованиеМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.МуниципальныйРайон);
	
	ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(СведенияОбАдресе.КодМуниципальногоРайона);
	Если Не ЕстьКодМуниципальногоРайона Тогда
		КодМуниципальногоРайона = УПД970_КодМуниципальногоРайона(СведенияОбАдресе.МуниципальныйРайонСокращение);
		ЕстьКодМуниципальногоРайона = ЗначениеЗаполнено(КодМуниципальногоРайона);
	КонецЕсли;
	
	ЕстьИдентификаторАдресногоОбъекта = ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторАдресногоОбъекта);
	
	ЕстьНесколькоТиповПомещенийЗдания = УПД970_АдресСодержитНесколькоТиповПомещенийЗдания(СведенияОбАдресе);
	ЕстьНесколькоТиповПомещенийКвартиры = УПД970_АдресСодержитНесколькоТиповПомещенийКвартиры(СведенияОбАдресе);
	
	Результат = ЕстьКодРегиона
		И ЕстьНаименованиеМуниципальногоРайона
		И ЕстьКодМуниципальногоРайона
		И ЕстьИдентификаторАдресногоОбъекта
		И Не ЕстьНесколькоТиповПомещенийЗдания
		И Не ЕстьНесколькоТиповПомещенийКвартиры;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСоответствуетСтруктуреAddressRF(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ЭтоАдминистративноТерриториальныйАдрес = ЭтоАдминистративноТерриториальныйАдресЛок(СведенияОбАдресе.ТипАдреса);
	Если Не ЭтоАдминистративноТерриториальныйАдрес
		Или ЭтоКонфигурацияБП() Тогда
		Возврат Результат;
	КонецЕсли;

	ЕстьКодРегиона = ЗначениеЗаполнено(СведенияОбАдресе.КодРегиона);
	
	ПомещенияНеЗаполнены = (СведенияОбАдресе.Помещения.Количество() = 0);
	ТипПомещенияСоответствуетАдрРФ = (СведенияОбАдресе.Помещения.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Помещения[0].ТипПомещения) = ВРЕГ(ТипПомещенияАдрРФ()));
		
	ПомещенияСоответствуютАдрРФ = (ПомещенияНеЗаполнены Или ТипПомещенияСоответствуетАдрРФ);
	
	КорпусаНеЗаполнены = (СведенияОбАдресе.Корпуса.Количество() = 0);
	ТипКорпусаСоответствуетАдрРФ = (СведенияОбАдресе.Корпуса.Количество() = 1
		И ВРЕГ(СведенияОбАдресе.Корпуса[0].ТипКорпуса) = ВРЕГ(ТипКорпусаАдрРФ()));
		
	КорпусаСоответствуютАдрРФ = (КорпусаНеЗаполнены Или ТипКорпусаСоответствуетАдрРФ);
		
	ТипЗданияСоответствуетАдрРФ = Не ЗначениеЗаполнено(СведенияОбАдресе.Здание.ТипЗдания)
		Или ВРЕГ(СведенияОбАдресе.Здание.ТипЗдания) = ВРЕГ(ТипЗданияАдрРФ());
		
	ЕстьНесоответствующиеСтруктуреАдрРФПоля = ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе);
	
	ПредставлениеАдреса = СведенияОбАдресе.Представление;
	ПредставленияАдресаСовпадают = (ПредставлениеАдреса = СведенияОбАдресе.СохраненноеПредставление);

	Результат = ЕстьКодРегиона
		И ПомещенияСоответствуютАдрРФ
		И КорпусаСоответствуютАдрРФ
		И ТипЗданияСоответствуетАдрРФ
		И ПредставленияАдресаСовпадают
		И Не ЕстьНесоответствующиеСтруктуреАдрРФПоля;

	Возврат Результат;
	
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповПомещенийЗдания(СведенияОбАдресе)
	
Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();

	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		Если ТипыПомещенийЗдания.Найти(Элемент.ТипПомещения) <> Неопределено Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция УПД970_АдресСодержитНесколькоТиповПомещенийКвартиры(СведенияОбАдресе)

Результат = Ложь;
	
	ТипыПомещенийЗдания = УПД970_ТипыПомещенийЗдания();
	ТипыПомещенийКвартиры = УПД970_ТипыПомещенийКвартиры();

	КоличествоТиповПомещений = 0;
	
	Для Каждого Элемент Из СведенияОбАдресе.Помещения Цикл
		
		ТипПомещения = Элемент.ТипПомещения;
		
		ЭтоПомещениеЗдания = (ТипыПомещенийЗдания.Найти(ТипПомещения) <> Неопределено);
		ЭтоПомещениеКвартиры = (ТипыПомещенийКвартиры.Найти(ТипПомещения) <> Неопределено);
		
		ЭтоНеклассифицированноеПомещениеКвартиры = (Не ЭтоПомещениеЗдания И Не ЭтоПомещениеКвартиры);
		
		Если ЭтоПомещениеКвартиры Или ЭтоНеклассифицированноеПомещениеКвартиры Тогда
			КоличествоТиповПомещений = КоличествоТиповПомещений + 1;
		КонецЕсли;
		
		Если КоличествоТиповПомещений > 1 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция УПД970_ТипыПомещенийКвартиры()
	
	Результат = Новый Массив;
	Результат.Добавить("Комната");
	Результат.Добавить("Бокс");
	Результат.Добавить("А/Я");
	Результат.Добавить("В/Ч");
	Результат.Добавить("П/О");
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ТипыПомещенийЗдания()
	
	Результат = Новый Массив;
	Результат.Добавить("Офис");
	Результат.Добавить("Квартира");
	Результат.Добавить("Помещение");
	Результат.Добавить("Этаж");
	Результат.Добавить("Гараж");
	Результат.Добавить("Павильон");
	Результат.Добавить("Котельная");
	Результат.Добавить("Погреб");
	Результат.Добавить("Рабочий Участок");
	Результат.Добавить("Склад");
	Результат.Добавить("Торговый Зал");
	Результат.Добавить("Цех");
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_АдаптироватьПоляСтруктурыАдресов(СведенияОбАдресе)
	
	Если ТипЗнч(СведенияОбАдресе.Страна) <> Тип("Строка") Тогда
		СведенияОбАдресе.Страна = НРег(XMLСтрока(СведенияОбАдресе.Страна));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипДома) <> Тип("Строка") Тогда
		СведенияОбАдресе.ТипДома = НРег(XMLСтрока(СведенияОбАдресе.ТипДома));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКвартиры) <> Тип("Строка") Тогда
		СведенияОбАдресе.ТипКвартиры = НРег(XMLСтрока(СведенияОбАдресе.ТипКвартиры));
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбАдресе.ТипКорпуса) <> Тип("Строка") Тогда
		СведенияОбАдресе.ТипКорпуса = НРег(XMLСтрока(СведенияОбАдресе.ТипКорпуса));
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_ПолучитьАдресИзКонтактнойИнформации(Ссылка, ВидАдреса = Неопределено)
	
	Результат = Неопределено;
	
	РезультатЗапроса = УПД970_СведенияОбАдресеИзКонтактнойИнформацииОбъекта(Ссылка, ВидАдреса);

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		ЗаполнитьТипЗданияКорпусаПомещения(Результат);
		
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(Результат, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьАдресИзПредставленияАдреса(Ссылка, ПредставлениеАдреса)
	
	Результат = Неопределено;
	
	РезультатЗапроса = УПД970_СведенияОбАдресеПоПредставлениюИзИБ(Ссылка, ПредставлениеАдреса);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		ЗаполнитьТипЗданияКорпусаПомещения(Результат);
		
		Если ЗначениеЗаполнено(Результат.Значение) Тогда
			ДополнитьКонтактнуюИнформациюДаннымиJson(Результат, Выборка.Значение, Выборка.Тип);
		КонецЕсли;
		
		УПД970_АдаптироватьПоляСтруктурыАдресов(Результат);
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		
		Результат = НоваяЗаписьКонтактнойИнформации();
		Результат.Представление = ПредставлениеАдреса;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ДополнитьСведенияОбАдресеОсновнойСтраной(Результат)
	
	Если НЕ ЗначениеЗаполнено(Результат.КодСтраны)
		И НЕ ЗначениеЗаполнено(Результат.Страна) Тогда
		
		Результат.КодСтраны = ОсновнаяСтрана().Код;
		Результат.Страна = ОсновнаяСтрана().Наименование;
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_СведенияОбАдресеИзКонтактнойИнформацииОбъекта(Ссылка, ВидАдреса)
	
	Перем ВидКИ;
	
	ВладелецКИ = ХранилищеКонтактнойИнформацииОбъекта(Ссылка);
	
	Если ВидАдреса <> Неопределено Тогда
		ВидКИ = ВидАдресаЮрФизЛица(Ссылка, ВидАдреса);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ВладелецКИ);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", ВидКИ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.Тип = &Тип
	|	И (Т.Вид = &Вид
	|		ИЛИ &Вид = НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;

КонецФункции

Функция УПД970_АдресЭлектроннойПочты(Объект)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация
	|ГДЕ
	|	Объект = &Объект
	|	И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И (НЕ Вид.ПометкаУдаления)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат = Выборка.Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ХранилищеКонтактнойИнформацииОбъекта(Ссылка)
	
	Результат = Ссылка;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации")
		И Ссылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		Результат = Ссылка.ИндивидуальныйПредприниматель;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_СведенияОбАдресеПоПредставлениюИзИБ(Ссылка, ПредставлениеАдреса)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Представление", ПредставлениеАдреса);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И ВЫРАЗИТЬ(Т.Представление КАК СТРОКА(&ДлинаСтроки)) = &Представление";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДлинаСтроки", Формат(СтрДлина(ПредставлениеАдреса), "ЧГ=0"));
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияОтгрузкиТоваровПоДоговору(Договор)

	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Договор,
		"Номер, Дата");
			
	Результат = УПД970_НовыйРеквизитыОснованияОтгрузки(
		"Договор",
		РеквизитыДоговора.Номер,
		РеквизитыДоговора.Дата,
		Договор);
		
	Возврат Результат;

КонецФункции

Функция УПД970_НовыйРеквизитыОснованияОтгрузки(Наименование = "", Номер = "", Дата = '00010101', ОснованиеСсылка = Неопределено)

	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	Результат.Вставить("ОснованиеСсылка", ОснованиеСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_РеквизитыОснованияЗаполнены(РеквизитыОснования)
	
	Результат = Ложь;
	
	Если РеквизитыОснования <> Неопределено
		И ЗначениеЗаполнено(РеквизитыОснования.Наименование)
		И ЗначениеЗаполнено(РеквизитыОснования.Номер)
		И ЗначениеЗаполнено(РеквизитыОснования.Дата) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПризнакТовараИлиУслугиПоСтрокеДокумента(ВидПоступления)
	
	ТипыНоменклатуры = ГенерацияXML.Перечисление_ItemMarks();
	ВидПоступленияУслуги = "Услуги";
	ВидПоступленияАгентскиеУслуги = "АгентскиеУслуги";
	
	Если ВидПоступления = ВидПоступленияУслуги
		Или ВидПоступления = ВидПоступленияАгентскиеУслуги Тогда
		Результат = ТипыНоменклатуры.Услуга;
	Иначе
		Результат = ТипыНоменклатуры.Имущество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьОбстоятельстваФормированияДокумента(ДанныеДокумента, ФункцияДокумента)
	
	Если ФункцияДокумента = ФункцияДокументаУПД_СЧФ() Тогда
		Результат = УПД970_ПолучитьОбстоятельстваФормированияСчетФактуры(ДанныеДокумента);
	Иначе
		Результат = УПД970_ПолучитьОбстоятельстваФормированияУПД(ДанныеДокумента.ВидДоговора);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьОбстоятельстваФормированияУПД(ВидДоговора)
	
	Результат = Неопределено;
	
	ПолноеИмяВидаДоговораСКомитентомНаЗакупку = "Перечисление.ВидыДоговоровКонтрагентов.ЗначениеПеречисления.СКомитентомНаЗакупку";
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		Результат = "00005";
	ИначеЕсли Метаданные.НайтиПоПолномуИмени(ПолноеИмяВидаДоговораСКомитентомНаЗакупку) <> Неопределено
		И ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку Тогда
		Результат = "00007";
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПолучитьОбстоятельстваФормированияСчетФактуры(ДанныеДокумента)
	
	Перем Результат;
	
	ЭтоКомиссионнаяТорговля = ЭтоВидДоговораНаКомиссионнуюТорговлю(ДанныеДокумента.ВидДоговора);
	
	ЭтоСчетФактураВыданныйНаАванс = Ложь;
	КодВидаОперации = "";
	
	Если ЭтоСчетФактураВыданный(ДанныеДокумента.Ссылка) Тогда
		ЭтоСчетФактураВыданныйНаАванс = ЭтоСчетФактураНаАванс(ДанныеДокумента.Ссылка);
		КодВидаОперации = ЗначениеРеквизитаОбъектаЛок(ДанныеДокумента.Ссылка, "КодВидаОперации");
	КонецЕсли;
	
	Если КодВидаОперации = "01" И ЭтоКомиссионнаяТорговля Тогда
		Результат = "1";	
	ИначеЕсли ЭтоСчетФактураВыданныйНаАванс Тогда
		Результат = "2";
	ИначеЕсли КодВидаОперации = "27" Тогда // Сводный комиссионный
		Результат = "3";
	ИначеЕсли КодВидаОперации = "06" Тогда // Налоговый агент
		Результат = "4";
	ИначеЕсли КодВидаОперации = "34" Тогда // НДСИНА
		Результат = "5";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидАдресаЮрФизЛица(ЮрФизЛицо, ТипАдреса)
	
	Результат = Неопределено;
	
	ПринадлежностьАдреса = "";
	
	ТипОбъекта = ТипЗнч(ЮрФизЛицо);
	
	Если ТипОбъекта = Тип("СправочникСсылка.Организации") Тогда
		
		Если ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ПринадлежностьАдреса = "Организации";
		Иначе
			ПринадлежностьАдреса = "ФизЛица";
		КонецЕсли;
		
	ИначеЕсли ЭтоКонфигурацияБП()
		И ТипОбъекта = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		ПринадлежностьАдреса = "ПодразделенияОрганизации";
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПринадлежностьАдреса = "Контрагента";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПринадлежностьАдреса) Тогда
		ИмяВидаКИ = ?(ТипАдреса = Перечисление_ВидыКонтактнойИнформации().ЮридическийАдрес, "ЮрАдрес", "ФактАдрес") + ПринадлежностьАдреса;
		Результат = Справочники.ВидыКонтактнойИнформации[ИмяВидаКИ];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьЭлементыАдресногоОбъекта(Элемент1, Элемент2)

	ЭлементыАдресногоОбъекта = Новый Массив;
	ЭлементыАдресногоОбъекта.Добавить(Элемент1);
	ЭлементыАдресногоОбъекта.Добавить(Элемент2);
	
	Результат = СокрЛП(Ядро.СоединитьСтроку(ЭлементыАдресногоОбъекта, " "));
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ПересчитатьЦенуВТабличнойЧасти(Items, Точность)
	
	Для Каждого Item Из Items Цикл
		
		Если НЕ ЗначениеЗаполнено(Item.Quantity) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТипЗнч(Item.Price) = Тип("Число") Тогда
			Продолжить;
		КонецЕсли;
		
		РасчетнаяЦена = Окр(Item.SubtotalWithVatExcluded / Item.Quantity, Точность);
		ОтклонениеОтРасчетной = (РасчетнаяЦена - Item.Price) * Item.Quantity;
		
		Если Макс(ОтклонениеОтРасчетной, -ОтклонениеОтРасчетной) > 0.03 Тогда
			Item.Price = РасчетнаяЦена;
		Иначе
			Item.Price = Окр(Item.Price, Точность);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УПД970_ТребуетсяПересчетВРубли(ДанныеШапки, ФункцияУПД)
	
	Результат = Ложь;
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ДанныеШапки.ВалютаДокумента <> ВалютаРеглУчета // Документ в иностранной валюте.
		И ЕстьУчетнаяПолитикаНаДатуДокумента(ДанныеШапки.Дата, ДанныеШапки.Организация) Тогда
		
		Если ДанныеШапки.РасчетыВУсловныхЕдиницах Тогда
			Результат = Истина; // Документ в у.е. всегда пересчитываем в рубли.
		Иначе
			Результат = (ФункцияУПД = ФункцияДокументаУПД_ДОП()); // Валютный Счет-фактуру в рубли пересчитывать не нужно.
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ПересчетВалюты_ПересчитатьСуммыСУчетомАвансов(Table, СуммаАвансов, ДатаДокумента)
	
	//1. Распределяем сумму регл пропорционально Сумме с НДС
	МассивРаспределения = Новый Массив;
	
	Для Каждого Item Из Table.Items Цикл
		МассивРаспределения.Добавить(Item.Subtotal);
	КонецЦикла;
	
	УчетНДС.РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаАвансов, Table.Items, "СуммаРублевая");
	
	РасчетСуммыНДСПоСтавке = УчетНДС.РасчетНДСвРубляхПоСтавкеДокумента(ДатаДокумента);
	
	//2. Пересчитываем СуммаНДС и Сумму
	Для Каждого Item Из Table.Items Цикл
		
		Если РасчетСуммыНДСПоСтавке Тогда
			
			ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(Item.СлужебнаяИнформация.СтавкаНДС);
			
			Item.Vat = ?(ЗначениеСтавкиНДС = 0, 0, Окр(Item.СуммаРублевая * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
			Item.SubtotalWithVatExcluded = Item.СуммаРублевая - Item.Vat;
			
		Иначе
			
			МассивРаспределения.Очистить();
			МассивРаспределения.Добавить(Item.SubtotalWithVatExcluded);
			МассивРаспределения.Добавить(Item.Vat);
			
			МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьПропорционально(Item.СуммаРублевая, МассивРаспределения);
			
			Если МассивРаспределенныхСумм <> Неопределено Тогда
				Item.SubtotalWithVatExcluded = МассивРаспределенныхСумм[0];
				Item.Vat = МассивРаспределенныхСумм[1];
			КонецЕсли;
			
		КонецЕсли;
		
		Item.Subtotal = Item.SubtotalWithVatExcluded + Item.Vat;
		
		Item.Удалить("СуммаРублевая");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД970_ПересчетВалюты_ПересчитатьИтоговыеСуммыУПД(Table)
	
	TotalWithVatExcluded = 0;
	Vat = 0;
	Total = 0;
	
	Для Каждого Item Из Table.Items Цикл
		TotalWithVatExcluded = TotalWithVatExcluded + Item.SubtotalWithVatExcluded;
		Vat = Vat + Item.Vat;
		Total = Total + Item.Subtotal;
	КонецЦикла;
	
	Table.TotalWithVatExcluded = Окр(TotalWithVatExcluded, 2);
	Table.Vat = Окр(Vat, 2);
	Table.Total = Окр(Total, 2);
	
КонецПроцедуры

Функция УПД970_ПересчетВалюты_СуммаАвансов(ДанныеДляПересчета)
	
	Если ЭтоКонфигурацияБП() Тогда
		
		ДокСсылка = ДанныеДляПересчета.ДокСсылка;
		
		Результат = УПД970_ПересчетВалюты_СуммаАвансов_БП(ДокСсылка);
		
	Иначе
		
		Результат = УПД970_ПересчетВалюты_СуммаАвансов_УПП(ДанныеДляПересчета);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПересчетВалюты_СуммаАвансов_БП(ДокСсылка)
	
	ТипДокумента = ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Результат = УПД970_ПересчетВалюты_СуммаАвансов_БП_РТУ(ДокСсылка);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		Результат = УПД970_ПересчетВалюты_СуммаАвансов_БП_АктОбОказанииПроизводственныхУслуг(ДокСсылка);	
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПересчетВалюты_СуммаАвансов_БП_РТУ(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("Содержание", "Реализация услуг");
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ДокСсылка.СчетУчетаРасчетовСКонтрагентом);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Ссылка
	|	И Хозрасчетный.СчетДт = &СчетУчетаРасчетовСКонтрагентом
	|	И Хозрасчетный.СчетКт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РеализацияТоваровУслугТовары.СчетДоходов
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ГДЕ
	|				РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|		
	|			ОБЪЕДИНИТЬ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РеализацияТоваровУслугУслуги.СчетДоходов
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|			ГДЕ
	|				РеализацияТоваровУслугУслуги.Ссылка = &Ссылка)
	|
	|ИМЕЮЩИЕ
	|	СУММА(Хозрасчетный.Сумма) ЕСТЬ НЕ NULL ";
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		Результат = ВыборкаРезультатаЗапроса.Сумма;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПересчетВалюты_СуммаАвансов_БП_АктОбОказанииПроизводственныхУслуг(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ДокСсылка.СчетУчетаРасчетовСКонтрагентом);
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Ссылка
	|	И Хозрасчетный.СчетДт = &СчетУчетаРасчетовСКонтрагентом
	|	И Хозрасчетный.СчетКт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АктОбОказанииПроизводственныхУслуг.СчетДоходов
	|			ИЗ
	|				Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслуг
	|			ГДЕ
	|				АктОбОказанииПроизводственныхУслуг.Ссылка = &Ссылка)
	|";
	Запрос.Текст = Текст;
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		Результат = ВыборкаРезультатаЗапроса.Сумма;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ПересчетВалюты_СуммаАвансов_УПП(ДанныеДляПересчета)
	
	ДокСсылка = ДанныеДляПересчета.ДокСсылка;
	
	Если ДокСсылка.Метаданные().ТабличныеЧасти.Найти("ДокументыРасчетовСКонтрагентом") = Неопределено Тогда
		
		Результат = 0;
		
	Иначе
		
		Результат = УчетНДСФормированиеДвижений.ПолучитьСуммуВзаиморасчетов(
			ДанныеДляПересчета.СчетФактура,
			ДанныеДляПересчета.ДокСсылка,
			ДанныеДляПересчета
		);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ДанныеДляПересчетаВалюты(ДанныеШапки)
	
	Результат = Новый Структура;
	Результат.Вставить("ДокСсылка", ДанныеШапки.Ссылка);
	Результат.Вставить("Организация", ДанныеШапки.Организация);
	Результат.Вставить("Контрагент", ДанныеШапки.Контрагент);
	Результат.Вставить("ДоговорКонтрагента", ДанныеШапки.ДоговорКонтрагента);
	Результат.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Результат.Вставить("СчетФактура", Документы.СчетФактураВыданный.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ПараметрыЗаполненияСтрокиТаблицыТоваров()
	
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяПересчетВРубли");
	Результат.Вставить("Курс");
	Результат.Вставить("Кратность");
	Результат.Вставить("СуммаВключаетНДС");
	Результат.Вставить("НДСИсчисляетсяНалоговымАгентом");
	Результат.Вставить("СуммаАвансов");
	Результат.Вставить("ТочностьКоличества");
	Результат.Вставить("ВыводитьАртикулВместоКодаТовара");
	
	Возврат Результат;
	
КонецФункции

Процедура УПД970_ЗаполнитьСведенияОбАдресеПоДаннымРегистра(СведенияОбАдресе, ЗаписьКИ)
	
	СведенияОбАдресе.Представление = ЗаписьКИ.Представление;
	
	Индекс = Неопределено;
	КодСтраны = Неопределено;
	НаименованиеСтраны = Неопределено;
	
	Если Не Общее_ВСтрокеТолькоЦифры(ЗаписьКИ.Поле1) Тогда 
		НаименованиеСтраны = СокрП(ЗаписьКИ.Поле1);
		КодСтраны = ГенерацияXML.КодСтраны(НаименованиеСтраны);
	Иначе 
		Индекс = СокрП(ЗаписьКИ.Поле1);
	КонецЕсли;
	
	СведенияОбАдресе.Регион = СокрЛП(ЗаписьКИ.Поле2);
	КодРегиона = УПД970_КодРегиона(СведенияОбАдресе.Регион);
	
	Если ЗначениеЗаполнено(КодРегиона) Тогда // Это структурированный адрес РФ
		
		СведенияОбАдресе.ТипАдреса = АдминистративноТерриториальныйАдрес();
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.Индекс = Индекс;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		СведенияОбАдресе.КодРегиона = КодРегиона;
		СведенияОбАдресе.Район = ЗаписьКИ.Поле3;
		СведенияОбАдресе.Город = ЗаписьКИ.Поле4;
		СведенияОбАдресе.НаселенныйПункт = ЗаписьКИ.Поле5;
		СведенияОбАдресе.Улица = ЗаписьКИ.Поле6;
		
		СведенияОбАдресе.Здание.ТипЗдания = ЗаписьКИ.ТипДома;
		СведенияОбАдресе.Здание.Номер = ЗаписьКИ.Поле7;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле8) Тогда
			
			Корпус = Новый Структура;
			Корпус.Вставить("ТипКорпуса", ЗаписьКИ.ТипКорпуса);
			Корпус.Вставить("Номер", ЗаписьКИ.Поле8);
			
			СведенияОбАдресе.Корпуса.Добавить(Корпус);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьКИ.Поле9) Тогда
			
			Помещение = Новый Структура;
			Помещение.Вставить("ТипПомещения", ЗаписьКИ.ТипКвартиры);
			Помещение.Вставить("Номер", ЗаписьКИ.Поле9); 
			СведенияОбАдресе.Помещения.Добавить(Помещение);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда // Это иностранный или российский адрес в свободной форме
		
		СведенияОбАдресе.КодСтраны = КодСтраны;
		СведенияОбАдресе.Страна = НаименованиеСтраны;
		
	ИначеЕсли ЗначениеЗаполнено(Индекс) Тогда // Это российский адрес, который не удалось разложить в структуру
		
		СведенияОбАдресе.Страна = ОсновнаяСтрана().Наименование;
		СведенияОбАдресе.КодСтраны = ОсновнаяСтрана().Код;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УПД970_КодРегиона(Знач НаименованиеРегиона)
	
	Результат = ГенерацияXML.КодРегиона(НаименованиеРегиона);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_НовыйСведенияОбАдресе()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Представление", "");
	Результат.Вставить("ТипАдреса", "");
	Результат.Вставить("Страна", "");
	Результат.Вставить("КодСтраны", "");
	Результат.Вставить("Индекс", "");
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("Регион", "");
	Результат.Вставить("Район", "");
	Результат.Вставить("Город", "");
	Результат.Вставить("ГородСокращение", "");
	Результат.Вставить("НаселенныйПункт", "");
	Результат.Вставить("НаселенныйПунктСокращение", "");
	Результат.Вставить("Улица", "");
	Результат.Вставить("УлицаСокращение", "");
	
	Здание = Новый Структура;
	Здание.Вставить("ТипЗдания", "");
	Здание.Вставить("Номер", "");
	
	Результат.Вставить("Здание", Здание);
	Результат.Вставить("Корпуса", Новый Массив);
	Результат.Вставить("Помещения", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция УПД970_ВыводитьАртикулВместоКодаТовара()
	
	Результат = Ложь;
	
	ЗначениеКонстанты = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ЗначениеКонстанты = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтранаУчастникЕАЭС(Знач КодСтраны)
	
	СтраныТС = Новый Массив;
	СтраныТС.Добавить("643"); // Россия
	СтраныТС.Добавить("051"); // Армения
	СтраныТС.Добавить("112"); // Беларусь
	СтраныТС.Добавить("398"); // Казахстан
	СтраныТС.Добавить("417"); // Киргизия
	СтраныТС.Добавить("981"); // ЕАЭС
	
	КодСтраны = СокрЛП(КодСтраны);
	
	Результат = СтраныТС.Найти(КодСтраны) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

//} СБОР КОНТЕНТА УПД970

//{ УПД970 КОНТРАКТЫ

Функция Контракт_ДанныеУчастникаЭДО()

	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("ЮрФизЛицо");
	Результат.Вставить("КодПоОКПО");
	Результат.Вставить("ОГРНИП");
	Результат.Вставить("ДатаОГРНИП");
	Результат.Вставить("Телефоны");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("Страна");
	Результат.Вставить("СтранаНаименование");
	Результат.Вставить("СтранаКод");
	Результат.Вставить("НалоговыйНомерВСтранеРегистрации");
	Результат.Вставить("Свидетельство");
	Результат.Вставить("НаименованиеБанка");
	Результат.Вставить("НомерСчета");
	Результат.Вставить("КоррСчет");
	Результат.Вставить("БИК");
	Результат.Вставить("Адрес");
	Результат.Вставить("НеЯвляетсяРезидентом", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ПротоСтруктураУПД970()
	
	ИмяТипа = "Utd970SellerContent";
	
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформация();
	
	Результат.AdditionalInfoId = Контракт_AdditionalInfoId();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформация()
	
	ИмяТипа = "СлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.ContentsDocumentProductsType = Контракт_ContentsDocumentProductsType();
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияTransferBases970()
	
	ИмяТипа = "ItemTransferBasesСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ContentsDocumentProductsType()
	
	ИмяТипа = "ContentsDocumentProductsType";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ExtendedOrganizationInfo970()

	ИмяТипа = "ExtendedOrganizationInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Результат.СлужебнаяИнформация = Контракт_СлужебнаяИнформацияОрганизации();
	
	Возврат Результат;

КонецФункции

Функция Контракт_Shipper970()

	ИмяТипа = "Shipper970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_СлужебнаяИнформацияОрганизации()
	
	ИмяТипа = "OrganizationСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_AddressInfo970()

	ИмяТипа = "AddressInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressRFInfo()

	ИмяТипа = "AddressRFInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressSARInfo()

	ИмяТипа = "AddressSARInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressTextInfo()

	ИмяТипа = "AddressTextInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AddressObjectNumberInfo()

	ИмяТипа = "AddressObjectNumberInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentShipments970()

	ИмяТипа = "DocumentShipment970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferInfo970()

	ИмяТипа = "TransferInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_TransferBases970()

	ИмяТипа = "TransferBase970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_Employee970()
	
	ИмяТипа = "Employee970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_InvoiceTable970()
	
	ИмяТипа = "InvoiceTable970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Результат.TotalNet = 0;
	Результат.TotalWithVatExcluded = 0;
	Результат.Vat = 0;
	Результат.Total = 0;
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_ItemTracingInfo970()
	
	ИмяТипа = "ItemTracingInfo970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_CustomDeclarations()

	ИмяТипа = "CustomDeclaration";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_СлужебнаяИнформацияСтроки()
	
	ИмяТипа = "ItemСлужебнаяИнформация";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_Item970()
	
	ИмяТипа = "Item970";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;
	
КонецФункции

Функция Контракт_PaymentDocumentInfo()

	ИмяТипа = "PaymentDocumentInfo";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

Функция Контракт_AdditionalInfoId()
	
	ИмяТипа = "AdditionalInfoId";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);
	
	Возврат Результат;
	
КонецФункции

Функция Контракт_DocumentCreatorBase()

	ИмяТипа = "DocumentCreatorBase";
	Результат = Новый_ЭлементПротоКонтента(ИмяТипа);

	Возврат Результат;

КонецФункции

// Заполняет модель данных электронного счета на оплату.
//
// Параметры:
//  МодельШапка - Структура - Контракт шапки неформализованного счета на оплату по форме ДД
//  			(см. МенеджерИнтеграции.Новый_ШапкаСчетаНаОплату()
//  МодельТабличнаяЧасть - Структура - Контракт табличной части неформализованного счета на оплату по форме ДД
//  			(см. МенеджерИнтеграции.Новый_ТабличнаяЧастьСчетаНаОплату()
//  ОснованиеЭлектронногоСчета	 - ЛюбаяСсылка	 - Основание электронного счета
//
Процедура СчетаНаОплату_ЗаполнитьДанные(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета) Экспорт
	
	Если ЭтоСчетНаОплатуПокупателю(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_СчетНаОплату(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоЗаказПокупателя_УПП13(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ЗаказПокупателя(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ЭтоДокументПродажи(ОснованиеЭлектронногоСчета) Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа: %1'");
		
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_СчетНаОплату(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_СчетНаОплату();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ДокументПродажи(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	Если ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_РеализацияТоваровУслуг(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_АктОбОказанииПроизводственныхУслуг(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли  ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				
		СчетаНаОплату_ЗаполнитьДанные_КорректировкаРеализации(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.ПередачаОС") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ПередачаОС(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_ОтчетКомитентуОПродажах(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	ИначеЕсли ТипЗнч(ОснованиеЭлектронногоСчета) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		
		СчетаНаОплату_ЗаполнитьДанные_РеализацияУслугПоПереработке(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета);
		
	Иначе
		
		ШаблонТекстаОшибки = НСтр("ru='Неожиданный тип документа продажи: %1'");
			
		ТекстОшибки = СтрШаблонЛок(ШаблонТекстаОшибки, ТипЗнч(ОснованиеЭлектронногоСчета));
		
		ВызватьИсключение ТекстОшибки;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_РеализацияТоваровУслуг(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	
	МетаданныеРеализацияТоваровУслуг =  Метаданные.Документы.РеализацияТоваровУслуг;
	
	ЕстьАгентскиеУслуги = МетаданныеРеализацияТоваровУслуг.ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено;
	
	Если ЕстьАгентскиеУслуги Тогда
	
		Запрос.Текст = ТекстЗапроса_ДанныеДокумента_РеализацияТоваровУслуг_БП();
		
	Иначе
		
		Запрос.Текст = ТекстЗапроса_ДанныеДокумента_РеализацияТоваровУслуг_УПП();
	
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_АктОбОказанииПроизводственныхУслуг(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_АктОбОказанииПроизводственныхУслуг();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_КорректировкаРеализации(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	МетаданныеКорректировкаРеализации = Метаданные.Документы.КорректировкаРеализации;
	
	ЕстьАгентскиеУслуги = МетаданныеКорректировкаРеализации.ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	
	Если ЕстьАгентскиеУслуги Тогда
		
		Запрос.Текст = ТекстЗапроса_ДанныеДокумента_КорректировкаРеализации_БП();
		
	Иначе
		
		Запрос.Текст = ТекстЗапроса_ДанныеДокумента_КорректировкаРеализации_УПП();
		
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Ссылка);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = Ложь;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	
	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчет = БанковскийСчет;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			СтрокаТЧ.НаименованиеПолное,
			СтрокаТЧ.ХарактеристикаНоменклатуры,
			СтрокаТЧ.Содержание
		);
		
		НоваяСтрока.НоменклатураПредставление = НоменклатураПредставление;
		
		НоваяСтрока.НоменклатураАртикул = СтрокаТЧ.НоменклатураАртикул;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ПередачаОС(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_ПередачаОС();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ОтчетКомитентуОПродажах(МодельШапка,
	МодельТабличнаяЧасть,
	ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_ОтчетКомитентуОПродажах();
	
	ДанныеШапки =  Запрос.Выполнить().Выгрузить()[0];
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Ссылка);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = ДанныеШапки.УчетАгентскогоНДС;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ДанныеШапки.Организация, ДанныеШапки.Дата);

	МодельШапка.РуководительФИО = Руководители.Руководитель;
	
	Если ЗначениеЗаполнено(ДанныеШапки.БанковскийСчетОрганизации) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(ДанныеШапки.БанковскийСчетОрганизации);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
		
	НоваяСтрока = МодельТабличнаяЧасть.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШапки);
	
	НоваяСтрока.НоменклатураПредставление = ДанныеШапки.НаименованиеПолное;
	
	СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(ДанныеШапки.СтавкаНДС);
	
	НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(
		ДанныеШапки.Сумма,
		ДанныеШапки.УчитыватьНДС, 
		ДанныеШапки.СуммаВключаетНДС,
		СтавкаНДС
	);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_РеализацияУслугПоПереработке(МодельШапка,
			МодельТабличнаяЧасть,
			ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_РеализацияУслугПоПереработке();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка,
			МодельТабличнаяЧасть,
			ДанныеШапки,
			ДанныеТабличнойЧасти)
	
	НомерДокумента = ПредставлениеНомера(ДанныеШапки.Ссылка);
	ДатаДокумента = ДанныеШапки.Дата;
	
	СведенияОбОрганизации = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Организация, ДатаДокумента);
	СведенияОКонтрагенте = СчетаНаОплату_ДанныеЮрФизЛица(ДанныеШапки.Контрагент, ДатаДокумента);
	
	МодельШапка.Заголовок = СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента);
	МодельШапка.Продавец = ДанныеШапки.Организация;
	МодельШапка.ПродавецПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОбОрганизации);
	МодельШапка.ПродавецИНН = СведенияОбОрганизации.ИНН;
	МодельШапка.ПродавецКПП = СведенияОбОрганизации.КПП;
	МодельШапка.Покупатель = ДанныеШапки.Контрагент;
	МодельШапка.ПокупательПредставление = СчетаНаОплату_ПредставлениеЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.ПокупательОписание = СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(СведенияОКонтрагенте);
	МодельШапка.Номер = НомерДокумента;
	МодельШапка.Дата = ДатаДокумента;
	МодельШапка.ЦенаВключаетНДС = ДанныеШапки.СуммаВключаетНДС;
	МодельШапка.ОблагаетсяНДСУПокупателя = Ложь;
	МодельШапка.Валюта = ДанныеШапки.Валюта;
	МодельШапка.ВалютаКод = ДанныеШапки.ВалютаКод;
	МодельШапка.УчитыватьНДС = ДанныеШапки.УчитыватьНДС;
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ДанныеШапки.Организация, ДанныеШапки.Дата);

	МодельШапка.РуководительФИО = Руководители.Руководитель;

	БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизации;
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		БанковскийСчет = ДанныеШапки.БанковскийСчетОрганизацииПоУмолчанию;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		РеквизитыСчета = РеквизитыБанковскогоСчета(БанковскийСчет);
		
		МодельШапка.ПродавецБанк = РеквизитыСчета.Банк;
		МодельШапка.ПродавецБанкБИК = РеквизитыСчета.БИК;
		МодельШапка.ПродавецБанкПредставление = РеквизитыСчета.БанкНаименование;
		МодельШапка.ПродавецБанковскийСчет = БанковскийСчет;
		МодельШапка.ПродавецБанковскийСчетНомер = РеквизитыСчета.НомерСчета;
		МодельШапка.ПродавецБанковскийСчетКорСчет = РеквизитыСчета.КоррСчет;
		
	КонецЕсли;
	
	МодульЦенообразование = ОбщийМодульПоИмениЛок("Ценообразование");
	
	Для Каждого СтрокаТЧ Из ДанныеТабличнойЧасти Цикл
		
		НоваяСтрока = МодельТабличнаяЧасть.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		НоменклатураПредставление = ПредставлениеНоменклатурыЛок(
			СтрокаТЧ.НаименованиеПолное,
			СтрокаТЧ.ХарактеристикаНоменклатуры,
			СтрокаТЧ.Содержание
		);
		
		Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
			НоваяСтрока.СуммаСкидки = МодульЦенообразование.ПолучитьСуммуСкидки(СтрокаТЧ.Сумма, СтрокаТЧ.Скидка);
		КонецЕсли;
		
		НоваяСтрока.НоменклатураПредставление = НоменклатураПредставление;
		
		НоваяСтрока.НоменклатураАртикул = СтрокаТЧ.НоменклатураАртикул;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СчетаНаОплату_ЗаполнитьДанные_ЗаказПокупателя(МодельШапка, МодельТабличнаяЧасть, ОснованиеЭлектронногоСчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ОснованиеЭлектронногоСчета);
	Запрос.Текст = ТекстЗапроса_ДанныеДокумента_ЗаказПокупателя();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатыЗапроса[0].Выгрузить()[0];
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выгрузить();
	
	СчетаНаОплату_ЗаполнитьДанные_ПоУмолчанию(МодельШапка, МодельТабличнаяЧасть, ДанныеШапки, ДанныеТабличнойЧасти);
	
КонецПроцедуры

Функция ТекстЗапроса_ДанныеДокумента_СчетНаОплату()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ДанныеДокумента.СтруктурнаяЕдиница КАК Справочник.БанковскиеСчета) КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	&ПолеСкидка КАК Скидка,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное,
	|	"""",
	|	&ПолеСкидка,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";

	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЕдиницаИзмерения(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСкидка(
		Результат,
		ПсевдонимТаблицы
	);
	
	Возврат Результат;
  
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_РеализацияТоваровУслуг_БП()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	&ПолеСкидка КАК Скидка,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное,
	|	"""",
	|	0 КАК СуммаСкидки,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
    |ВЫБРАТЬ
	|	3,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное,
	|	"""",
	|	0 КАК СуммаСкидки,
    |	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.БазоваяЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСкидка(
		Результат,
		ПсевдонимТаблицы
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_РеализацияТоваровУслуг_УПП()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	&ПолеСкидка КАК Скидка,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.Номенклатура.НаименованиеПолное,
	|	"""",
	|	0 КАК СуммаСкидки,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСкидка(
		Результат,
		ПсевдонимТаблицы
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_АктОбОказанииПроизводственныхУслуг()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	"""" КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	"""" КАК ХарактеристикаНоменклатуры,
	|	&ПолеНоменклатураСодержание КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	0 КАК Скидка,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";

	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураСодержание(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЕдиницаИзмерения(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		Результат,
		ПсевдонимТаблицы
	);

	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_КорректировкаРеализации_БП()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер + ""/"" + ДанныеДокумента.ИсправляемыйДокументРеализации.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|	И ДанныеДокумента.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	"""" КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|	И ДанныеДокумента.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
    |ВЫБРАТЬ
	|	3,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	"""" КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|	И ДанныеДокумента.Сумма > 0
    |
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЕдиницаИзмерения(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		Результат,
		ПсевдонимТаблицы
	);

	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_КорректировкаРеализации_УПП()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер + ""/"" + ДанныеДокумента.ИсправляемыйДокументРеализации.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	&ПолеЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|	И ДанныеДокумента.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	"""" КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|	И ДанныеДокумента.Сумма > 0
    |
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабличнойЧасти,
	|	НомерСтроки";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЕдиницаИзмерения(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		Результат,
		ПсевдонимТаблицы
	);

	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_ПередачаОС()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	"""" КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.ПередачаОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ОсновноеСредство КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.ОсновноеСредство.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.ОсновноеСредство.Наименование
	|		ИНАЧЕ ДанныеДокумента.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеПолное,
	|	ДанныеДокумента.ОсновноеСредство.Код КАК НоменклатураАртикул,
	|   """" КАК ХарактеристикаНоменклатуры,
	|	"""" КАК Содержание,
	|	0 КАК Скидка,
	|	1 КАК Количество,
	|	ДанныеДокумента.Сумма КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";

	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_ОтчетКомитентуОПродажах()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.УслугаПоВознаграждению КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.УслугаПоВознаграждению = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""Комиссионное вознаграждение""
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.УслугаПоВознаграждению.НаименованиеПолное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.УслугаПоВознаграждению.Наименование
	|		ИНАЧЕ ДанныеДокумента.УслугаПоВознаграждению.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеПолное,
	|	ДанныеДокумента.УслугаПоВознаграждению.Артикул КАК НоменклатураАртикул,
	|	"""" КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.СуммаВознаграждения КАК Цена,
	|	1 КАК Количество,
	|	ДанныеДокумента.СуммаВознаграждения КАК Сумма,
	|	ДанныеДокумента.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	&ПолеСуммаВключаетНДС КАК СуммаВключаетНДС 
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";
	
	ПолеСуммаВключаетНДС = "ИСТИНА";
	
	Если ЭтоКонфигурацияБП() Тогда
		ПолеСуммаВключаетНДС = "ДанныеДокумента.СуммаВключаетНДС";
	КонецЕсли;
	
	Результат = СтрЗаменить(
		Результат,
		"&ПолеСуммаВключаетНДС",
		ПолеСуммаВключаетНДС
	);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_РеализацияУслугПоПереработке()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	"""" КАК ХарактеристикаНоменклатуры,
	|	0 КАК Скидка,
	|	ДанныеДокумента.Содержание КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		
		Результат = Результат + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ДанныеДокумента.НомерСтроки,
		|	ДанныеДокумента.Номенклатура,
		|	&ПолеНоменклатураНаименование,
		|	"""",
		|	NULL,
		|	"""",
		|	&ПолеНоменклатураАртикул,
		|	ДанныеДокумента.ЕдиницаИзмерения,
		|	ДанныеДокумента.Количество,
		|	ДанныеДокумента.Цена,
		|	ДанныеДокумента.СтавкаНДС,
		|	ДанныеДокумента.Сумма,
		|	ДанныеДокумента.СуммаНДС
		|ИЗ
		|	Документ.РеализацияУслугПоПереработке.Продукция КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТабличнойЧасти,
		|	НомерСтроки";
		
	КонецЕсли;	
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		Результат,
		ПсевдонимТаблицы
	);
		
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДанныеДокумента_ЗаказПокупателя()
	
	Результат =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ВалютаДокумента.Код КАК ВалютаКод,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ДанныеДокумента.СтруктурнаяЕдиница КАК Справочник.БанковскиеСчета)КАК БанковскийСчетОрганизации,
	|	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчетОрганизацииПоУмолчанию,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ДанныеДокумента.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ДанныеДокумента.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабличнойЧасти,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	&ПолеНоменклатураНаименование КАК НаименованиеПолное,
	|	&ПолеХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	&ПолеСкидка КАК Скидка,
	|	"""" КАК Содержание,
	|	&ПолеНоменклатураАртикул КАК НоменклатураАртикул,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура,
	|	&ПолеНоменклатураНаименование,
	|	"""",
	|	0,
	|	ДанныеДокумента.Содержание,
	|	&ПолеНоменклатураАртикул,
	|	"""",
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.ЗаказПокупателя.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ТекущийДокумент";
	
	ПсевдонимТаблицы = "ДанныеДокумента";
	
	ЗаполнитьВыражениеЗапросаНоменклатураАртикул(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаСкидка(
		Результат,
		ПсевдонимТаблицы
	);
	
	ЗаполнитьВыражениеЗапросаНоменклатураНаименование(
		Результат,
		ПсевдонимТаблицы
	);
	
	Возврат Результат;

КонецФункции

Функция СчетаНаОплату_ПредставлениеЮрФизЛица(РеквизитыЮрФизЛица)
	
	Результат = РеквизитыЮрФизЛица.ПолноеНаименование;
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_СтрокаРеквизитыЮрФизЛица(Реквизиты)
	
	ШаблонПредставления = "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	Результат = ПредставлениеЮрФизЛицаСлужебный(Реквизиты, ШаблонПредставления);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ДанныеЮрФизЛица(Участник, ДатаСведений)
	
	Модель = Новый Структура;
	Модель.Вставить("ПолноеНаименование", "");
	Модель.Вставить("ИНН", "");
	Модель.Вставить("КПП", "");
	Модель.Вставить("Телефоны", "");
	Модель.Вставить("ЮридическийАдрес", "");
	Модель.Вставить("НомерСчета", "");
	Модель.Вставить("Банк", "");
	Модель.Вставить("БИК", "");
	Модель.Вставить("КоррСчет", "");
	
	МодульУправлениеКонтактнойИнформацией = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
	
	Данные = МодульУправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Участник, ДатаСведений);
	
	Модель.ПолноеНаименование = Данные.ПолноеНаименование;
	Модель.ИНН = Данные.ИНН;
	Модель.КПП = Данные.КПП;
	Модель.Телефоны = Данные.Телефоны;
	Модель.ЮридическийАдрес = Данные.ЮридическийАдрес;
	Модель.НомерСчета = Данные.НомерСчета;
	Модель.Банк = Данные.Банк;
	Модель.БИК = Данные.БИК;
	Модель.КоррСчет = Данные.КоррСчет;
	
	Если ЭтоКонфигурацияБП()
		И Данные.Свойство("НаименованиеДляПечатныхФорм") Тогда
		
		Модель.ПолноеНаименование = Данные.НаименованиеДляПечатныхФорм;
		
	КонецЕсли;
	
	Результат = Новый ФиксированнаяСтруктура(Модель);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаНаОплату_ЗаголовокПечатнойФормы(НомерДокумента, ДатаДокумента)
	
	Результат = СтрШаблонЛок(
		"Счет на оплату № %1 от %2",
		НомерДокумента,
		Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")
	);
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЮрФизЛицаСлужебный(Реквизиты, Знач ШаблонПредставления = "")
	
	Перем Префикс, СтрокаДополнения;
	
	СоответствиеПараметров = Новый Структура;
	СоответствиеПараметров.Вставить("ПолноеНаименование", " ");
	СоответствиеПараметров.Вставить("Представление", " ");
	СоответствиеПараметров.Вставить("ИНН", " ИНН ");
	СоответствиеПараметров.Вставить("КПП", " КПП ");
	СоответствиеПараметров.Вставить("Свидетельство", " ");
	СоответствиеПараметров.Вставить("СвидетельствоДатаВыдачи", " от ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес", " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес", " ");
	СоответствиеПараметров.Вставить("Телефоны", " тел.: ");
	СоответствиеПараметров.Вставить("Факс", " факс: ");
	СоответствиеПараметров.Вставить("НомерСчета", " р/с ");
	СоответствиеПараметров.Вставить("Банк", " в банке ");
	СоответствиеПараметров.Вставить("БИК", " БИК ");
	СоответствиеПараметров.Вставить("КоррСчет", " к/с ");
	СоответствиеПараметров.Вставить("КодПоОКПО", " Код по ОКПО ");
	
	Если ПустаяСтрока(ШаблонПредставления) Тогда
		
		Если НЕ Реквизиты.Свойство("Представление")
			ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.Представление) Тогда
			
			ШаблонПредставления = "ПолноеНаименование," + ШаблонПредставления;
			
		Иначе
			
			ШаблонПредставления = "Представление," + ШаблонПредставления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПропускатьПустыеСтроки = Истина;
	Разделитель = ",";
	СписокПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			ШаблонПредставления,
			Разделитель,
			ПропускатьПустыеСтроки
		);
	
	Результат = Новый Массив;
	
	Для Каждого ИмяПараметра Из СписокПараметров Цикл
		
		Если Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения) Тогда
			
			Реквизиты.Свойство(ИмяПараметра, СтрокаДополнения);
			Если ПустаяСтрока(СтрокаДополнения) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СоответствиеПараметров.Свойство(ИмяПараметра, Префикс) Тогда
				Результат.Добавить(Префикс + СтрокаДополнения);
			Иначе
				Результат.Добавить(СтрокаДополнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаРезультата = Общее_СоединитьСтроку(Результат, ",");
	СтрокаРезультата = СтрЗаменить(СтрокаРезультата, "  ", " ");
	
	Возврат СокрЛП(СтрокаРезультата);
	
КонецФункции

Функция ПредставлениеНоменклатурыЛок(НаименованиеПолное, Характеристика, Содержание)
	
	Результат = Содержание;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		Результат = СокрЛП(НаименованиеПолное);
			
		ХарактеристикаНоменклатуры = СокрЛП(Характеристика);
		
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
			
			Результат = Результат + "/" + ХарактеристикаНоменклатуры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция РеквизитыБанковскогоСчета(БанковскийСчет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Банк.Наименование КАК БанкНаименование,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьВыражениеЗапросаНоменклатураНаименование(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = 
	"ВЫБОР
	|		КОГДА НЕ (ПсевдонимТаблицы.Номенклатура.НаименованиеПолное ПОДОБНО """")
	|			ТОГДА ПсевдонимТаблицы.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ПсевдонимТаблицы.Номенклатура.Наименование
	|	КОНЕЦ";
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеНоменклатураНаименование",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаНоменклатураСодержание(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = "ПсевдонимТаблицы.Содержание";
	Если ЭтоКонфигурацияБП() Тогда
		Выражение = """""";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеНоменклатураСодержание",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаДоговорПоДаннымОрганизации(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = "ПсевдонимТаблицы.ДоговорКонтрагента";
	Если ЭтоКонфигурацияБП() Тогда
		Выражение = "ПсевдонимТаблицы.Договор";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеДоговорКонтрагентаПоОрганизации",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаДоговорПоДаннымКонтрагента(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = "ПсевдонимТаблицы.ДоговорКонтрагента";
	Если ЭтоКонфигурацияБП() Тогда
		Выражение = "ПсевдонимТаблицы.Договор";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеДоговорКонтрагентаПоКонтрагенту",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЕдиницаИзмерения(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = "ПсевдонимТаблицы.ЕдиницаИзмерения";
	Если ЭтоКонфигурацияБП() Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.БазоваяЕдиницаИзмерения";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеЕдиницаИзмерения",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаНоменклатураАртикул(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	ЗначениеКонстанты = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	
	Если ЗначениеКонстанты = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.Артикул";
	ИначеЕсли ЗначениеКонстанты = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		Выражение = "ПсевдонимТаблицы.Номенклатура.Код";
	Иначе
		Выражение = """""";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеНоменклатураАртикул",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаХарактеристикаНоменклатуры(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = """""";
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		Выражение = "ПсевдонимТаблицы.ХарактеристикаНоменклатуры";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеХарактеристикаНоменклатуры",
		Выражение
	);
	
КонецПроцедуры

Процедура ЗаполнитьВыражениеЗапросаСкидка(ТекстЗапроса, ПсевдонимТаблицы = "ДанныеДокумента")
	
	Выражение = 0;
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		Выражение = "ПсевдонимТаблицы.ПроцентСкидкиНаценки + ПсевдонимТаблицы.ПроцентАвтоматическихСкидок";
	КонецЕсли;
	
	ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПолеСкидка",
		Выражение
	);
	
КонецПроцедуры

Процедура ПодставитьПсевдонимТаблицыВВыражениеЗапроса(Выражение, ПсевдонимТаблицы)
	
	ПодстрокаПоиска = "ПсевдонимТаблицы";
	Если Не ЗначениеЗаполнено(ПсевдонимТаблицы) Тогда
		ПодстрокаПоиска = ПодстрокаПоиска + ".";
	КонецЕсли;
	
	Выражение = СтрЗаменить(Выражение, ПодстрокаПоиска, ПсевдонимТаблицы);
	
КонецПроцедуры

//} УПД970 КОНТРАКТЫ

//*****************************************************************************
//{ СБОР КОНТЕНТА ФНС29

Функция СчетФНС29(СсылкаНаОбъект) Экспорт
	Ошибка = "ИнтеграцияБП20: формирование электронных счетов в формате ФНС 29@ не реализовано";
	ВызватьИсключение Ошибка;
КонецФункции

//} СБОР КОНТЕНТА ФНС29
//*****************************************************************************

//****************************************************************************
//{ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// ВАЖНО: В результирующую строку добавляются только непустые значения!
// Платформенный метод СтрСоединить объединяет строки безусловно.
// Нужно это учитывать, если в качестве разделителя задана непустая строка.
// 
// Параметры:
//  Строки - Массив, ФиксированныйМассив - коллекция объединяемых строк.
//  Разделитель - Строка - Строка, которая будет вставлена между объединяемыми строками.
//                         Если параметр не задан, строки будут объединены слитно друг с другом.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
// Пример:
//   
//   Строки = Новый Массив;
//   Строки.Добавить("Элемент0");
//   Строки.Добавить("");
//   Строки.Добавить("Элемент2");
//   
//   СоединитьСтроку(Строки, "#") = "Элемент0#Элемент2"
//   СтрСоединить(Строки, "#") = "Элемент0##Элемент2"
//   СоединитьСтроку(Строки, "") = СтрСоединить(Строки, "") = "Элемент0Элемент2"
//
Функция Общее_СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Общее_ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов)
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Если НЕ Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения") = Неопределено Тогда
			СтрокаСообщения = "Неверный тип параметра ""МассивСсылок""";
			Выполнить("ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция Общее_ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблонЛок("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция СтрШаблонЛок(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	, Параметр6 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктурыЛок(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Результат = Ядро.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	Возврат Результат;
КонецФункции

Функция ЕстьРеквизитОбъектаЛок(ИмяРеквизита, ОбъектМетаданных)
	
	Результат = (ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, Реквизиты)
	
	Результат = Ядро.Общее_ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(СсылкаНаОбъект, ИмяРеквизита)
	
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("ОбщегоНазначения");
	Результат = ИнтерфейсБСП.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция РезультатФункцииОшибка(ОшибкаИлиМассив)
	
	Если ТипЗнч(ОшибкаИлиМассив) = Тип("Массив") Тогда
		КоллекцияОшибок = ОшибкаИлиМассив;
	Иначе
		КоллекцияОшибок = Новый Массив;
		КоллекцияОшибок.Добавить(ОшибкаИлиМассив);
	КонецЕсли;
	
	Результат = ОсновнойМодуль.НовыйРезультатФункции();
	Результат.ОписаниеОшибки = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(КоллекцияОшибок);
	
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаНоменклатурыДляСопоставления()
	
	Результат = Новый ТаблицаЗначений;
	
	Если ЭтоКонфигурацияБП() Тогда
		
		МетаданныеСправочника = Метаданные.Справочники.НоменклатураПоставщиков;
		
		// Ограничения типам реквизитов для текущей конфигурации
		ВладелецТип = МетаданныеСправочника.СтандартныеРеквизиты.Владелец.Тип;
		
		НоменклатураТип = МетаданныеСправочника.Реквизиты.Номенклатура.Тип;
		ХарактеристикаТип = Неопределено;
		ЕстьХарактеристики = Ложь;
		
		НаименованиеТип = Новый ОписаниеТипов("Строка");
		КодТип = МетаданныеСправочника.Реквизиты.Идентификатор.Тип;
		АртикулТип = МетаданныеСправочника.Реквизиты.Артикул.Тип;
		
	Иначе // УПП, КА
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.НоменклатураКонтрагентов;
		
		// Ограничения типам реквизитов для текущей конфигурации
		ВладелецТип = МетаданныеРегистра.Измерения.Контрагент.Тип;
		
		НоменклатураТип = МетаданныеРегистра.Измерения.Номенклатура.Тип;
		ХарактеристикаТип = МетаданныеРегистра.Измерения.ХарактеристикаНоменклатуры.Тип;
		ЕстьХарактеристики = Истина;
		
		НаименованиеТип = МетаданныеРегистра.Ресурсы.НаименованиеНоменклатурыКонтрагента.Тип;
		КодТип = МетаданныеРегистра.Ресурсы.Идентификатор.Тип;
		АртикулТип = МетаданныеРегистра.Ресурсы.АртикулНоменклатурыКонтрагента.Тип;
		
	КонецЕсли;
	
	ШиринаМалая = 10;
	
	// Ограничения типам реквизитов для текущей конфигурации
	Результат.Колонки.Добавить("Контрагент"             , ВладелецТип);
	Результат.Колонки.Добавить("Наименование"           , НаименованиеТип);
	Результат.Колонки.Добавить("Код"                    , КодТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Артикул"                , АртикулТип, , ШиринаМалая);
	Результат.Колонки.Добавить("Номенклатура"           , НоменклатураТип);
	Результат.Колонки.Добавить("НоменклатураКонтрагента", Неопределено);
	
	Если ЕстьХарактеристики Тогда
		Результат.Колонки.Добавить("Характеристика", ХарактеристикаТип);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьНоменклатуруДляСопоставления(Результат, Контрагент, Наименование, Код = "", Артикул = "")
	
	Если Не Результат.Свойство("ТаблицаНоменклатурыДляСопоставления") Тогда
		
		ТаблицаНоменклатуры = НоваяТаблицаНоменклатурыДляСопоставления();
		Результат.Вставить("ТаблицаНоменклатурыДляСопоставления", ТаблицаНоменклатуры);
		
	КонецЕсли;
	
	НоваяСтрока = Результат.ТаблицаНоменклатурыДляСопоставления.Добавить();
	НоваяСтрока.Контрагент	 = Контрагент;
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Код			 = Код;
	НоваяСтрока.Артикул		 = Артикул;
	
КонецПроцедуры

Функция ПолучитьРеквизитыПодписантаПоОрганизации1С(Организация, Дата)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Должность", "", "", "", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК ФизЛицо,
	|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо.Наименование
	|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК СокрФИО
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&Дата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо ССЫЛКА Справочник.ФизическиеЛица) КАК ФИОФизЛицСрезПоследних
	|		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.Фамилия 	= Выборка.Фамилия;
		Результат.Имя 		= Выборка.Имя;
		Результат.Отчество 	= Выборка.Отчество;
		Результат.Должность = Выборка.Должность;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет операцию по умолчанию при создании учетного документа.
//
// Параметры:
//  ТипЭД - Структура - Тип электронного документа (см. Документ.Тип)
// 
// Возвращаемое значение:
//  Строка - Идентификатор операции по умолчанию (см. СписокТиповДокументовДляСоздания).
//  Неопределено - Если не удалось определить тип операциии.
//
Функция ИдентификаторОперацииПоУмолчанию(ТипЭД)
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоПередаточныйДокумент(ТипЭД) Тогда
		
		Результат = ОперацияПоступлениеТоваровУслуг();
		
	ИначеЕсли ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипЭД)
		Или ОсновнойМодуль.ЭтоСоглашениеОбИзмененииСтоимости(ТипЭД) Тогда
		
		Результат = ОперацияКорректировкаПоступления();
		
	ИначеЕсли ОсновнойМодуль.ЭтоСчетФактура(ТипЭД)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипЭД) Тогда
		
		Результат = ОперацияСчетФактураПолученный();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнитьДокументОснование(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = Неопределено;
	Если ПараметрыСобытия.ДополнительныеПараметры.Свойство("ДокументОснование", ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ИдентификаторОперации = ПараметрыСобытия.ИдентификаторОперации;
	
	Если ИдентификаторОперации = ОперацияКорректировкаПоступления() Тогда
		
		ДокументОснование = НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки);
		
	КонецЕсли;
	
	ПараметрыСобытия.ДополнительныеПараметры.Вставить("ДокументОснование", ДокументОснование);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьИдентификаторОперации(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки)
		Или ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	ПараметрыСобытия.ИдентификаторОперации = ИдентификаторОперацииПоУмолчанию(ТипЭД);
	
	Если Не ЗначениеЗаполнено(ПараметрыСобытия.ИдентификаторОперации) Тогда
		
		Если Не Документ.Тип.Формализованный Тогда
			Ошибки.Добавить("Документ неформализованный.");
		КонецЕсли;
		
		Ошибки.Добавить("Для этого формата или типа документа нельзя создать документ.");
		Ошибки.Добавить("Сопоставьте документ вручную из карточки документа.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФункциюДокумента(ПараметрыСобытия, Ошибки)
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПараметрыСобытия.Документ;
	ТипЭД = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоАгентскиеФункцииУПДУКД(ТипЭД.ФункцияДокумента) Тогда
		ТекстОшибки = "Не задана операция для создания учетного документа!";
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры


Функция ОперацияПоступлениеТоваровУслуг()
	Возврат "ПоступлениеТоваровУслуг";
КонецФункции

Функция ОперацияКорректировкаПоступления()
	Возврат "КорректировкаПоступления";
КонецФункции

Функция ОперацияСчетФактураПолученный()
	Возврат "СчетФактураПолученный";
КонецФункции

Функция ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных)
	
	МетаданныеОснованийСФ = Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании;
	Результат = МетаданныеОснованийСФ.Содержит(ОбъектМетаданных);
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяСоздатьСчетФактуру(ДокументОбъект)
	
	Результат = Ложь;
	
	ОбъектМетаданных = ДокументОбъект.Метаданные();
	
	Если ЭтоМетаданныеОснованияСчетаФактурыПолученного(ОбъектМетаданных) Тогда
		
		Результат = (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.СчетФактураПолученный"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ищем в пакете документ счета-фактуры: если есть, то сразу создаем его в 1С.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Основание для создания счета-фактуры полученного.
//  Документ - Структура - электронный документ (см. Контракт_Документ).
//  ИспользоватьДатуЭД - Булево - Истина, заполнять дату документа из документа ЭДО
//
Процедура СоздатьСчетФактуру(ДокументОбъект, Документ, ИспользоватьДатуЭД)
	
	Если ДокументОбъект = Неопределено
		ИЛИ НЕ ТребуетсяСоздатьСчетФактуру(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйСФ = ЭлектронныйСчетФактураПакета(Документ);
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйСФ)
		ИЛИ ЗначениеЗаполнено(ЭлектронныйСФ.ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Если ИспользоватьДатуЭД Тогда
		ДатаДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	КонецЕсли;
	
	ДокументСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	ДокументСФ.Заполнить(ДокументОбъект.Ссылка);
	ДокументСФ.НомерВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Номер;
	ДокументСФ.ДатаВходящегоДокумента = ЭлектронныйСФ.Реквизиты.Дата;
	ДокументСФ.Дата = ДатаДокумента;
	ДокументСФ.КодСпособаПолучения = 2;
	ДокументСФ.ОбменДанными.Загрузка = Истина;
	ДокументСФ.Записать();
	
	Если НЕ ЭлектронныеДокументыРавны(Документ, ЭлектронныйСФ) Тогда
		ОсновнойМодуль.ОбновлениеРеквизитовДокумента(ЭлектронныйСФ.Идентификаторы, ДокументСФ.Ссылка);
		ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокументаУчета(Документ, ДокументСФ);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск счета-фактуры, полученного в одном пакете с указанным электронным документом.
//
// Параметры:
//  Документ - Структура - электронный документ (см. Контракт_Документ).
// 
// Возвращаемое значение:
//  Структура - электронный счет-фактура (см. Контракт_Документ).
//  Неопределено - если в пакете с указанным документом не найден счет-фактура.
//
Функция ЭлектронныйСчетФактураПакета(Документ)
	
	Результат = Неопределено;
	
	ТипДокумента = Документ.Тип;
	
	Если ОсновнойМодуль.ЭтоУниверсальныйПередаточныйДокумент(ТипДокумента)
		Или ОсновнойМодуль.ЭтоСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокумента)
		Или ОсновнойМодуль.ЭтоУниверсальныйКорректировочныйДокумент(ТипДокумента) Тогда
		
		Результат = Документ;
		
	Иначе
		
		ТаблицаДокументовПакета = ОсновнойМодуль.Пакеты_ДокументыПакетов(Документ.Идентификаторы);
		
		Для Каждого ДокументПакета Из ТаблицаДокументовПакета Цикл
			
			Если ЭлектронныеДокументыРавны(Документ, ДокументПакета) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипДокументаПакета = ДокументПакета.Тип;
			
			Если ОсновнойМодуль.ЭтоСчетФактура(ТипДокументаПакета) 
				Или ОсновнойМодуль.ЭтоКорректировочныйСчетФактура(ТипДокументаПакета) Тогда
				Результат = ДокументПакета;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Находит учетный документ, на основании которого нужно создать корректировку поступления.
//
// Параметры:
//  Документ - Структура - электронный УКД или КСФ (см. Контракт_Документ).
//  Ошибки - Массив из Строка- (возвращаемый параметр) Описания ошибок подбора документа-основания.
// 
// Возвращаемое значение:
//  ЛюабяСсылка - ссылка на документ-основание корректировки поступления.
//
Функция НайтиОснованиеДляСозданияКорректировкиПоступления(Документ, Ошибки)
	
	ДвоичныеДанные = Документ.Документооборот.ХранилищеКонтента.Данные;
	ДеревоКонтента = ОсновнойМодуль.XML_В_XDTO(ДвоичныеДанные);
	НомерДатаСФ = ДеревоКонтента.Документ.СвКСчФ.СчФ;
	
	ДокументОснование = Неопределено;
	
	Если ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ) Тогда
		
		Ошибки.Добавить("Создание корректировки по нескольким документам-оснований недоступно.");
		Ошибки.Добавить("Вы можете вручную создать документ в 1С и сопоставить его с текущим документом.");
		
	Иначе
		
		ДокументОснование = НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ЭтоКорректировкаПоНесколькимОснованиям(НомерДатаСФ)
	
	Результат = (ТипЗнч(НомерДатаСФ) = Тип("СписокXDTO"));
	Возврат Результат;
	
КонецФункции

Функция НайтиОснованиеКорректировки(Документ, НомерДатаСФ, Ошибки)
	
	ДокументОснование = Неопределено;
	
	НомерОснования = НомерДатаСФ.НомерСчФ;
	ДатаОснования  = ОсновнойМодуль.ДатаXML_в_Дата1С(НомерДатаСФ.ДатаСчФ);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Организация",		Документ.Получатель.Организация);
	ПараметрыОтбора.Вставить("Контрагент",		Документ.Отправитель.Организация);
	ПараметрыОтбора.Вставить("ДатаДокумента",	ДатаОснования);
	ПараметрыОтбора.Вставить("НомерДокумента",	НомерОснования);
	
	Если Документ.Тип.ФункцияДокумента = "InvoiceAndBasic" Тогда
		
		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "СчетФактураПолученный");
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 
			И ДокументыОснования1С[0].ДокументыОснования.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0].ДокументыОснования[0].ДокументОснование;
		КонецЕсли;
		
	ИначеЕсли Документ.Тип.ФункцияДокумента = "Basic" Тогда

		ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеТоваровУслуг");
		
		Если ДокументыОснования1С = Неопределено Тогда
			ДокументыОснования1С = ПолучитьДокументы1С(ПараметрыОтбора, "ПоступлениеДопРасходов");
		КонецЕсли;
		
		Если ДокументыОснования1С <> Неопределено И ДокументыОснования1С.Количество() = 1 Тогда
			ДокументОснование = ДокументыОснования1С[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ТекстОшибки = "Для корректировки не найден документ-основание №%НомерДокумента% от %ДатаДокумента%.";
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерДокумента%", НомерОснования);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаДокумента%", ДатаОснования);
		
		СоздаватьСчетаФактуры = ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СоздаватьСчетаФактуры;
		
		Если СоздаватьСчетаФактуры = Истина Тогда
			ТекстРешения = "Создайте счет-фактуру для документа-основания и повторите создание документа.";
		Иначе 
			ТекстРешения = "Сопоставьте документ вручную из карточки документа.";
		КонецЕсли;	
		
		Ошибки.Добавить(ТекстОшибки);
		Ошибки.Добавить(ТекстРешения);
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

Функция ПолучитьДокументы1С(ПараметрыОтбора, ВидДокумента1С)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	Для Каждого Элемент Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ВидДокумента1С = "ПоступлениеТоваровУслуг" Тогда				
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерДокумента";
	
	ИначеЕсли ВидДокумента1С = "ПоступлениеДопРасходов" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоступлениеДопРасходов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	НЕ ПоступлениеДопРасходов.ПометкаУдаления
		|	И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Контрагент = &Контрагент
		|	И ПоступлениеДопРасходов.ДатаВходящегоДокумента = &ДатаДокумента
		|	И ПоступлениеДопРасходов.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "КорректировкаПоступления" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаПоступления.Ссылка
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|ГДЕ
		|	НЕ КорректировкаПоступления.ПометкаУдаления
		|	И КорректировкаПоступления.Организация = &Организация
		|	И КорректировкаПоступления.Контрагент = &Контрагент
		|	И КорректировкаПоступления.ДатаВходящегоДокумента = &ДатаДокумента
		|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетФактураПолученный" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	НЕ СчетФактураПолученный.ПометкаУдаления
		|	И СчетФактураПолученный.Организация = &Организация
		|	И СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерДокумента";
		
	ИначеЕсли ВидДокумента1С = "СчетНаОплатуПоставщика" Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплатуПоставщика.Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &ДатаДокумента
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента = &НомерДокумента";		
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьКомментарийДокументаУчета(Параметры)
	
	Документ = Параметры.Документ;
	
	ДокументУчета		= Документ.ДокументУчета;
	ФункцияДокумента	= Документ.Тип.ФункцияДокумента;
	    	
	ДобавляемыйКомментарий = Параметры.Комментарий;
	
	Если Параметры.ДокументОбъект = Неопределено Тогда
		Документ1С = ДокументУчета;
	Иначе
		Документ1С = Параметры.ДокументОбъект;
	КонецЕсли;

	// меняем комментарий в самом документе
	ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(Документ1С, ДобавляемыйКомментарий);

	// далее при необходимости поменяем комментарий в документах-основаниях
	ЭтоПолныйУПД_УКД = ФункцияДокумента = "СЧФДОП" ИЛИ ФункцияДокумента = "КСЧФДИС"; 
	
	ЭтоСФ = ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ЭтоПолныйУПД_УКД И ЭтоСФ Тогда
		
		Для Каждого СтрокаОснование Из ДокументУчета.ДокументыОснования Цикл
			ОсновнойМодуль.ЭДО_ОбновитьКомментарийДокумента1С(СтрокаОснование.ДокументОснование, ДобавляемыйКомментарий);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеДокумента(ДокументОбъект, Ошибки, ОтключитьПроверкуСопоставленияНоменклатуры)
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОтключитьПроверкуСопоставленияНоменклатуры Тогда
		
		ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЧтоНоменклатураЗаполнена(ДокументОбъект, Ошибки)
	
	ПроверяемыеТаблицы = Новый Структура;
	ПроверяемыеТаблицы.Вставить("Товары", Неопределено);
	ПроверяемыеТаблицы.Вставить("Услуги", Неопределено);
	
	ЗаполнитьЗначенияСвойств(ПроверяемыеТаблицы, ДокументОбъект);
	
	Для Каждого ЭлементСтруктуры Из ПроверяемыеТаблицы Цикл
		
		ПроверяемаяТаблица = ЭлементСтруктуры.Значение;
		
		Если ПроверяемаяТаблица = Неопределено
			Или ЗначениеЗаполнено(Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТовар Из ПроверяемаяТаблица Цикл
			
			Номенклатура = СтрокаТовар.Номенклатура;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				ТекстОшибки = НСтр(
						"ru = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.';
						|en = 'Не сопоставлена номенклатура. Проверьте сопоставление номенклатуры.'"
					);
				
				Ошибки.Добавить(ТекстОшибки);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Общее_СтрокаВДату(Значение)
	
	Результат = РегламентированнаяОтчетность.СтрокаВДату(Значение);
	
	Возврат Результат;
	
КонецФункции

Функция ВедениеВзаиморасчетовПоЗаказам(ДокументСсылка)

	Результат = Ложь;
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		
		ВедениеВзаиморасчетов = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
		Результат = (ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициализирует структуру полей записи регистра КонтактнаяИнформация.
// 
// Возвращаемое значение:
//  Структура - свойства структуры соответствуют полям типового регистра КонтактнаяИнформация.
//
Функция НоваяЗаписьКонтактнойИнформации()
	
	Результат = Новый Структура;
	Результат.Вставить("ТипАдреса");
	Результат.Вставить("Представление");
	Результат.Вставить("Значение");
	Результат.Вставить("КодСтраны");
	Результат.Вставить("Страна");
	Результат.Вставить("Поле1");
	Результат.Вставить("Поле2");
	Результат.Вставить("Поле3");
	Результат.Вставить("Поле4");
	Результат.Вставить("Поле5");
	Результат.Вставить("Поле6");
	Результат.Вставить("Поле7");
	Результат.Вставить("Поле8");
	Результат.Вставить("Поле9");
	Результат.Вставить("Поле10");
	Результат.Вставить("ТипДома", "дом");
	Результат.Вставить("ТипКорпуса", "корпус");
	Результат.Вставить("ТипКвартиры", "кв.");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТипЗданияКорпусаПомещения(ЗначенияПолей)
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипДома) Тогда 
		ЗначенияПолей.ТипДома = "дом";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКорпуса) Тогда 
		ЗначенияПолей.ТипКорпуса = "корпус";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПолей.ТипКвартиры) Тогда 
		ЗначенияПолей.ТипКвартиры = "кв.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКонтактнуюИнформациюДаннымиJson(КонтактнаяИнформация, ЗначениеJson, Тип)
	
	ИмяМодуля = "УправлениеКонтактнойИнформациейСлужебный";
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено Тогда
		
		МодульУправлениеКонтактнойИнформациейСлужебный = ОбщийМодульПоИмениЛок(ИмяМодуля);
		
		ДанныеАдреса = Неопределено;
		
		Попытка
			ДанныеАдреса = МодульУправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ЗначениеJson, Тип);
		Исключение
		КонецПопытки;
		
		Если ДанныеАдреса <> Неопределено Тогда
			
			Если  ДанныеАдреса.Свойство("addressType") И ДанныеАдреса.addressType = "ВСвободнойФорме" 
				И ДанныеАдреса.Свойство("Country") Тогда
				
				КонтактнаяИнформация.Поле1 = ДанныеАдреса.Country;	// Страна
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОсновнаяСтрана()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "РОССИЯ");
	Результат.Вставить("Код", "643");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеНаОтдельномБалансе(Ссылка)

	Результат = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		ГоловнаяОрганизация = ЗначениеРеквизитаОбъектаЛок(Ссылка, "ГоловнаяОрганизация");
		Результат = ЗначениеЗаполнено(ГоловнаяОрганизация);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Результат = ЗначениеРеквизитаОбъектаЛок(Ссылка, "ОбособленноеПодразделение");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеНаОбщемБалансе(Ссылка)

	Если ЭтоКонфигурацияБП() Тогда
		Результат = ЭтоОбособленноеПодразделениеНаОбщемБалансе_БП20(Ссылка);
	Иначе
		Результат = ЭтоОбособленноеПодразделениеНаОбщемБалансе_УПП13(Ссылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеНаОбщемБалансе_УПП13(Ссылка)

	Результат = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций")
		И ЗначениеЗаполнено(Ссылка) Тогда
		
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Ссылка, "КодПоОКТМО, КодПоОКАТО");
			
		Результат = (ЗначениеЗаполнено(РеквизитыПодразделения.КодПоОКТМО) И ЗначениеЗаполнено(РеквизитыПодразделения.КодПоОКАТО));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеНаОбщемБалансе_БП20(Ссылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций")
		И ЕстьРеквизитОбъектаЛок("ОбособленноеПодразделение", Метаданные.Справочники.ПодразделенияОрганизаций)
		И ЗначениеЗаполнено(Ссылка) Тогда
		Результат = ЗначениеРеквизитаОбъектаЛок(
				Ссылка, "ОбособленноеПодразделение");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьУчетнаяПолитикаНаДатуДокумента(Дата, Организация)
	
	ПараметрыУчетнойПолитики = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Неопределено, Организация);
	
	Результат = ПараметрыУчетнойПолитики <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция МуниципальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	Если НЕ Метаданные.ОбщиеМодули.Найти(ОбщийМодульИмя) = Неопределено Тогда
		ОбщийМодульРаботаСАдресами = ОбщийМодульПоИмениЛок(ОбщийМодульИмя);
		
		Результат = ОбщийМодульРаботаСАдресами.МуниципальныйАдрес();
	Иначе
		Результат = "Муниципальный";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АдминистративноТерриториальныйАдрес()
	
	ОбщийМодульИмя = "РаботаСАдресамиКлиентСервер";
	
	Если НЕ Метаданные.ОбщиеМодули.Найти(ОбщийМодульИмя) = Неопределено Тогда
		ОбщийМодульРаботаСАдресами = ОбщийМодульПоИмениЛок(ОбщийМодульИмя);
		
		Результат = ОбщийМодульРаботаСАдресами.АдминистративноТерриториальныйАдрес();
	Иначе
		Результат = "Административно-территориальный";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОбАдресеЛок(Адрес)

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("БезПредставлений", Ложь);
	ДопПараметры.Вставить("КодыАдреса", Истина);
	ДопПараметры.Вставить("КодыКЛАДР", Ложь);
	ДопПараметры.Вставить("ПолныеНаименованияСокращений", Ложь);
	ДопПараметры.Вставить("НаименованиеВключаетСокращение", Ложь);
	ДопПараметры.Вставить("ПроверитьАдрес", Ложь);
	
	МодульРаботыСАдресами = ОбщийМодульПоИмениЛок("РаботаСАдресами");

	Если ЭтоКонфигурацияБП() Тогда
		
		Результат = МодульРаботыСАдресами.СведенияОбАдресе(Адрес, ДопПараметры);
		
	Иначе // УПП 1.3
		
		Адреса = Новый Массив;
		Адреса.Добавить(Адрес);
		
		СведенияОбАдресах = МодульРаботыСАдресами.СведенияОбАдресахВВидеСтруктуры(Адреса, ДопПараметры);
		Результат = СведенияОбАдресах[0];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеАдреса(ЗаписьКИ)
	
	Если ЕстьФункциональностьРаботаСАдресами()
		И ЗначениеЗаполнено(ЗаписьКИ.Значение) Тогда
		
		МодульУправленияКИ = ОбщийМодульПоИмениЛок("УправлениеКонтактнойИнформацией");
		Результат = МодульУправленияКИ.ПолучитьПредставлениеАдреса(ЗаписьКИ);
		
	Иначе
		
		Результат = ЗаписьКИ.Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//TODO: Добавить проверку на версию конфигурации
Функция ЕстьФункциональностьРаботаСАдресами()
	
	Если ЭтоКонфигурацияБП() Тогда
		
		ТекущаяВерсияБСП = ВерсияСтандартнойПодсистемы();
		МинимальнаяВерсияБСП = "2.1.9";
		Результат = (Ядро.СравнитьВерсии(ТекущаяВерсияБСП, МинимальнаяВерсияБСП) > 0);
		
	ИначеЕсли ЭтоКонфигурацияУПП() Тогда
		
		ТекущаяВерсияУПП = ВерсияПодсистемыУправлениеПроизводственнымПредприятием();
		МинимальнаяВерсияУПП = "1.3.185";
		Результат = (Ядро.СравнитьВерсии(ТекущаяВерсияУПП, МинимальнаяВерсияУПП) > 0);
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКорпусаАдрРФ()
	
	Возврат "Корпус";
	
КонецФункции

Функция ТипПомещенияАдрРФ()
	
	Возврат "Квартира";
	
КонецФункции

Функция ТипЗданияАдрРФ()
	
	Возврат "Дом";
	
КонецФункции

Функция ТипАдресаВСвободнойФорме()
	Возврат "ВСвободнойФорме";
КонецФункции

Функция ЭтоМуниципальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Муниципальный"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоАдминистративноТерриториальныйАдресЛок(Знач ТипАдреса)
	
	Результат = (НРег(ТипАдреса) = НРег("Административно-территориальный"));
	Возврат Результат;
	
КонецФункции

// Проверяет, что в структуре адреса присутствуют поля, которых нет в структуре АдрРФ.
//
// Параметры:
//  СведенияОбАдресе - Структура - см. функцию СведенияОбАдресеЛок;
// 
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одно заполненное поле, не соответстующее структуре АдрРФ.
//
Функция ЕстьНесоответствующиеСтруктуреАдрРФПоля(СведенияОбАдресе)
	
	Результат = Ложь;
	
	ПоляНеПоАдресРФ = Новый Массив;
	ПоляНеПоАдресРФ.Добавить("Округ");
	ПоляНеПоАдресРФ.Добавить("МуниципальныйРайон");
	ПоляНеПоАдресРФ.Добавить("Поселение");
	ПоляНеПоАдресРФ.Добавить("ВнутригородскойРайон");
	ПоляНеПоАдресРФ.Добавить("Территория");
	ПоляНеПоАдресРФ.Добавить("ДополнительнаяТерритория");
	ПоляНеПоАдресРФ.Добавить("ЭлементДополнительнойТерритории");
	ПоляНеПоАдресРФ.Добавить("НомерЗемельногоУчастка");
	
	Для Каждого ИмяПоля Из ПоляНеПоАдресРФ Цикл 
		
		ЗначениеПоля = СвойствоСтруктурыЛок(СведенияОбАдресе, ИмяПоля);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()
	
	МодульСтандартныеПодсистемыПовтИсп = ОбщийМодульПоИмениЛок("СтандартныеПодсистемыПовтИсп");
	Результат = МодульСтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	Возврат Результат;
	
КонецФункции

Функция ВерсияСтандартнойПодсистемы()

	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить("СтандартныеПодсистемы");
	
	ЗначениеПоУмолчанию = "";
	Результат = СвойствоСтруктурыЛок(ОписаниеПодсистемы, "Версия", ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияПодсистемыУправлениеПроизводственнымПредприятием()

	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить("УправлениеПроизводственнымПредприятием");
	
	ЗначениеПоУмолчанию = "";
	Результат = СвойствоСтруктурыЛок(ОписаниеПодсистемы, "Версия", ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции


//} ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТЕКУЩЕЙ КОНФИГУРАЦИЕЙ БАЗЫ



//****************************************************************************
//{ СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЭДО_ВерсияAPIПодключаемогоМодуля() Экспорт
	
	Возврат 4; // Основной модуль проверяет указанную тут версию, в целях контроля совместимости с ПМ.
	
КонецФункции

Функция ЭлектронныеДокументыРавны(Документ1, Документ2)
	
	Результат = (Документ1.Идентификаторы.DocumentId = Документ2.Идентификаторы.DocumentId);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеВМассивЛок(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Результат = Значение;
		
	Иначе
		
		Результат = Новый Массив;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПодпись(КонтентПодписи, ФИО, Должность = "")
	
	Если ТипЗнч(ФИО) = Тип("Структура") Тогда
		
		КонтентПодписи.FirstName	= ФИО.Имя;
		КонтентПодписи.Surname		= ФИО.Фамилия;
		КонтентПодписи.Patronymic	= ФИО.Отчество;
		
	ИначеЕсли ТипЗнч(ФИО) = Тип("Массив") Тогда
		
		КонтентПодписи.FirstName	= ФИО[0];
		КонтентПодписи.Surname		= ФИО[1];
		КонтентПодписи.Patronymic	= ФИО[2];
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Должность) Тогда
		КонтентПодписи.JobTitle	= Должность;
	КонецЕсли;
	
КонецПроцедуры

Функция КатегорииПакетов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"ОсновнойПакет");
	Результат.Вставить("КорректировочныйПакет", "КорректировочныйПакет");
	Результат.Вставить("СчетФактураНаАванс", 	"СчетФактураНаАванс");
	Результат.Вставить("СчетНаОплату", 			"СчетНаОплату");
	Результат.Вставить("АктCверки", 			"АктCверки");
	Результат.Вставить("БезКатегории",			"БезКатегории");
	Результат.Вставить("ВнутренниеПеремещения",	"ВнутренниеПеремещения");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКатегории()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОсновнойПакет", 		"Первичные документы");
	Результат.Вставить("КорректировочныйПакет", "Корректировочные документы");
	Результат.Вставить("СчетФактураНаАванс", 	"Счет-фактура на аванс");
	Результат.Вставить("СчетНаОплату", 			"Счет на оплату");
	Результат.Вставить("АктCверки", 			"Акт сверки");
	Результат.Вставить("ВнутренниеПеремещения",	"Внутренние перемещения");
	Результат.Вставить("БезКатегории");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНаименованияКатегорийПакетов(ТЗ)
	
	НаименованиеКатегории = НаименованиеКатегории();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.КатегорияПакета) Тогда
			СтрокаТЗ.НаименованиеКатегории = НаименованиеКатегории[СтрокаТЗ.КатегорияПакета];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПакетамПризнакВнутреннегоДО(ТЗ)
	
	Пакет = ТЗ.Найти("ID_УПД_ВНУТР", "ID");
	Пакет.ВнутреннийДО = Истина;
	
КонецПроцедуры

Функция МожноСформироватьПередаточныйДокумент(Документ1С)
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС"));
	КонецЕсли;
	
	Если ЭтоКонфигурацияБП() Тогда
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ОказаниеУслуг"));
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(Документ1С);
	
	Результат = (ИсключаемыеТипы.Найти(ТипДокумента) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьИДобавитьДокументВПакет_УПДДОП(Пакет, Документ1С)
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_УПД_ДОП");
	
КонецПроцедуры

Процедура ПодготовитьИДобавитьДокументВПакет_ТОРГ12_Акт(Пакет, Документ1С) 
	
	Если Не МожноСформироватьПередаточныйДокумент(Документ1С) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Документ1С) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров") Тогда
		ДокументПроверки = Документ1С.ДокументОтгрузки;
	Иначе
		ДокументПроверки = Документ1С;
	КонецЕсли;
	
	ЕстьТовары = ДокументПроверки.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено;
	
	Если ЕстьТовары Тогда
		
		ВыборкаТоваров = ОсновнойМодуль.Общее_ВыборкаДанныхОбъекта(ДокументПроверки, "Товары", "Номенклатура");
		
		Если ВыборкаТоваров.Количество() = 0 Тогда
			ЕстьТовары = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоОтчетКомитенту = ТипЗнч(Документ1С) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");
				 
	Если ЕстьТовары И Не ЭтоОтчетКомитенту Тогда		
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_ТОРГ12");
	Иначе
		ОсновнойМодуль.ЭДО_ДокументМенеджер_ПодготовитьИДобавитьДокументВПакет(Пакет, Документ1С, "ID_АктФормализованный");
	КонецЕсли;

КонецПроцедуры
    
Функция ПроверитьДляНакладнойНаличиеДублей(ДокументДД, Документ1С, Результат)
		
	// Ищем ТОРГ-12 или УПД, относящийся к другому (не к текущему) пакету, и находящийся в статусе "Требуется подпись" или "Подписан".
	// Еще искомый документ должен быть уже проверен и признан "хорошим" (возможно, его еще не подписали, но уже проверили)
	// Если такой есть, то по текущему документу будем отказывать в подписи, т.к. это дубль
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить("XmlTorg12");
	ТипыДокументов.Добавить("UniversalTransferDocument");
	
	Статусы  = Новый Массив;
	Статусы.Добавить("Подписан");
	Статусы.Добавить("Требуется подпись");
	
	Если ОсновнойМодуль.ЭДО_Использовать1СЭДО() Тогда 
		//TODO добавить проверку дублей для 1С-ЭДО
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка,
		|	Диадок_Документы.АнализПроведен КАК АнализПроведен,
		|	Диадок_Документы.ТекстОшибки КАК ОшибкиПроверкиТекст
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Ссылка <> &ТекущийДокументДД
		|	И Диадок_Документы.LetterId <> &LetterId
		|	И Диадок_Документы.Документ = &Документ1С
		|	И (Диадок_Документы.Направление = ""Inbound"" ИЛИ Диадок_Документы.Направление = ""Входящее"" )  //переходный период перед релизом 1.0.0
		|	И Диадок_Документы.ТипДокумента В(&ТипДокумента)
		|	И Диадок_Документы.АнализПроведен
		|	И Диадок_Документы.Статус В(&Статусы)
		|	И Выразить(Диадок_Документы.ТекстОшибки как строка(1)) = """"     //  ТекстОшибки сейчас неограниченная строка. Выразить работает в сторону уменьшения длины, но не увеличения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диадок_Документы.ДатаЗагрузки";
		
		Запрос.УстановитьПараметр("ТекущийДокументДД",	ДокументДД);
		Запрос.УстановитьПараметр("Документ1С",			Документ1С);
		Запрос.УстановитьПараметр("ТипДокумента",		ТипыДокументов);
		Запрос.УстановитьПараметр("Статусы",			Статусы);		
		Запрос.УстановитьПараметр("LetterId",			ДокументДД.LetterId);
		Запрос.УстановитьПараметр("ДатаЗагрузки",		ДокументДД.ДатаЗагрузки);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 И ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда
			Док = Выборка[0].Ссылка;
			Результат.Добавить("ДУБЛИКАТ: накладная уже была учтена в электронном виде (дата " + формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy")
			+ ", номер " + Док.НомерДокумента + ", загружен из Диадок " + Док.ДатаЗагрузки + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКонтентОтвета(ДокументДД, Документ1С, ДействиеВДД, ТекстВсехОшибок)
	
	Content = ОсновнойМодуль.ЭДО_ПолучитьПустойКонтентОтветаДляДокумента(ДокументДД, ДействиеВДД);

	ИмяТипаОбъектаXDTO = НРег(Content.Тип().Имя);
	
	Если ИмяТипаОбъектаXDTO = "torg12buyercontent" Тогда
		
		Content.ShipmentReceiptDate = Документ1С.Дата;
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Receiver, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, получившее груз
		ЗаполнитьПодпись(Content.Accepter, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, принявшее груз

	ИначеЕсли ИмяТипаОбъектаXDTO = "utdbuyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.Creator				= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.CreatorBase			= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd820buyercontent" Тогда
		
		Content.AcceptanceDate		= Документ1С.Дата;
		Content.DocumentCreator		= "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.DocumentCreatorBase	= "";
		Content.OperationCode		= "";
		Content.OperationContent	= "Товары и услуги получены, претензий нет";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта); // работник организации покупателя
				
		Content.Employee.EmployeePosition	= ДанныеПодписанта.Должность;
		Content.Employee.EmployeeBase		= "Должностные обязанности";	
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "utd970buyercontent" Тогда
		
		Content.AcceptanceDate	 = Документ1С.Дата;
		Content.DocumentCreator	 = "" + Документ1С.Организация.НаименованиеПолное + ", ИНН " + Документ1С.Организация.ИНН + ", КПП " + Документ1С.Организация.КПП;
		Content.OperationContent = "Товары и услуги получены, претензий нет";
		
		Content.ContentOperCode.TotalCode = "1";
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		ЗаполнитьПодпись(Content.Employee, ДанныеПодписанта);
		
		Content.Employee.EmployeePosition = ДанныеПодписанта.Должность;
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "acceptancecertificatebuyercontent" Тогда
		
		ДанныеПодписанта = ПолучитьРеквизитыПодписантаПоОрганизации1С(Документ1С.Организация, Документ1С.Дата);
		
		ЗаполнитьПодпись(Content.Official, ДанныеПодписанта, ДанныеПодписанта.Должность); // лицо, подписывающее со стороны заказчика
		
	ИначеЕсли ИмяТипаОбъектаXDTO = "correctionrequestcontent"	// запрос на уточнение по СФ
		Или ИмяТипаОбъектаXDTO = "formalizedrejectioncontent"  // отказ по формализованному
		Или ИмяТипаОбъектаXDTO = "rejectioncontent" Тогда		// отказ по неформализованному
				
		Content.Comment = ТекстВсехОшибок;
		
	КонецЕсли;	
	
	Возврат Content;
	
КонецФункции

Функция ДобавитьОбъединениеВТекстЗапроса(ТекстЗапроса)
	
	Возврат ?(ТекстЗапроса = "",
					"",
					ТекстЗапроса + ТекстЗапроса_ОбъединитьВсе());

КонецФункции

Функция ТекстЗапроса_РазделительЗапросов()
	
	Возврат "
			|;
			|
			|//////////////////////////////////////////////////////////////////////////////// 
			|";

КонецФункции

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";

КонецФункции

Функция ТекстЗапроса_СчетаФактуры(ОписаниеВидаПакета, ВидСчетаФактуры, Исправление)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	СчетФактура.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И СчетФактура.Проведен
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Номер,
		|	СчетФактура.Дата,
		|	СчетФактура.Контрагент,
		|	СчетФактура.Организация,
		|	СчетФактура.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактура.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактура.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактура.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И НЕ СчетФактура.ПометкаУдаления
		|	И СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И НЕ СчетФактура.Исправление
		|	И &ДополнительныеОтборы";
	
	Если Исправление Тогда
		
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		Иначе
			ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат,
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
				"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = """ + ВидИсправляемогоПакета + """");
		
		Результат = СтрЗаменить(Результат, "НЕ СчетФактура.Исправление", "СчетФактура.Исправление");
		
	КонецЕсли;
	
	ТекстЗапросаДополнительныеОтборы = ТекстЗапроса_ДополнительныеОтборыСчетаФактуры();
	
	Результат = СтрЗаменить(Результат, "&ДополнительныеОтборы", ТекстЗапросаДополнительныеОтборы);
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	Результат = СтрЗаменить(Результат, "НаРеализацию", ВидСчетаФактуры);
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ДополнительныеОтборыСчетаФактуры()
	
	Результат = "НЕ СчетФактура.ДокументОснование Ссылка Документ.ОтчетКомиссионераОПродажах";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетФактурыПоОтчетуКомиссионера(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетФактурыПоОтчетуКомиссионера.Документ КАК Документ,
		|	СчетФактурыПоОтчетуКомиссионера.НомерДокумента КАК НомерДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.ДатаДокумента КАК ДатаДокумента,
		|	СчетФактурыПоОтчетуКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактурыПоОтчетуКомиссионера.Организация КАК Организация,
		|	СчетФактурыПоОтчетуКомиссионера.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_СчетФактурыПоОтчетуКомиссионера КАК СчетФактурыПоОтчетуКомиссионера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетФактурыПоОтчетуКомиссионера.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетФактурыПоОтчетуКомиссионера.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетФактурыПоОтчетуКомиссионера.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СчетФактурыПоОтчетуКомиссионера.Проведен
		|		КОНЕЦ";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДС(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И НЕ ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ВТ_ДокументыБезНДС.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДокументыБезНДС.Документ,
		|	ВТ_ДокументыБезНДС.НомерДокумента,
		|	ВТ_ДокументыБезНДС.ДатаДокумента,
		|	ВТ_ДокументыБезНДС.Контрагент,
		|	ВТ_ДокументыБезНДС.Организация,
		|	ВТ_ДокументыБезНДС.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	ВТ_ДокументыБезНДС КАК ВТ_ДокументыБезНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО ВТ_ДокументыБезНДС.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ВТ_ДокументыБезНДС.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|			И (ВТ_ДокументыБезНДС.ЭтоИсправление)
		|			И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ВТ_ДокументыБезНДС.Документ = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL 
		|	И ВТ_КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные";
	
	Если Найти(ВидПакетаID, "ID_И") = 0 Тогда
		Результат = СтрЗаменить(Результат,
				"И (ВТ_ДокументыБезНДС.ЭтоИсправление)",
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоИсправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		Результат = СтрЗаменить(Результат,
				"И (НЕ ВТ_ДокументыБезНДС.ЭтоКорректировка)",
				"И (ВТ_ДокументыБезНДС.ЭтоКорректировка)");
	КонецЕсли;
	
	Если ВидПакетаID = "ID_ТОРГ12_Акт_БезНДС" Тогда
		ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Иначе
		
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат,
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID",
			"ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID " + ВидПервичногоПакета);
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_СчетаНаОплату(ОписаниеВидаПакета)
	
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Документ,
		|	СчетНаОплатуПокупателю.Номер КАК НомерДокумента,
		|	СчетНаОплатуПокупателю.Дата КАК ДатаДокумента,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	СчетНаОплатуПокупателю.Организация КАК Организация,
		|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО СчетНаОплатуПокупателю.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И СчетНаОплатуПокупателю.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО СчетНаОплатуПокупателю.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаПоОснованиюДляСчетаНаОплату(Результат, ОписаниеВидаПакета, ИмяТаблицыМетаданных, ЗначениеОснования)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумент.Ссылка 			КАК Документ,
	|	ТаблицаДокумент.Номер 			КАК НомерДокумента,
	|	ТаблицаДокумент.Дата 			КАК ДатаДокумента,
	|	ТаблицаДокумент.Контрагент 		КАК Контрагент,
	|	ТаблицаДокумент.Организация 	КАК Организация,
	|	ТаблицаДокумент.СуммаДокумента 	КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ИЗ
	|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
	|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
	|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
	|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
	|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
	|			И (&УсловиеСвязиПоКатегорииПакета)
	|ГДЕ
	|	ОтправленныеДокументы.Документ ЕСТЬ NULL
	|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
	|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
	|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТаблицаДокумент.ПометкаУдаления";
	
	УчитыватьНастройкуОтправкиНепроведенных = (Метаданные.Документы[ИмяТаблицыМетаданных].Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить);
	
	Если УчитыватьНастройкуОтправкиНепроведенных Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|	И НЕ КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И ТаблицаДокумент.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумент.Ссылка,
		|	ТаблицаДокумент.Номер,
		|	ТаблицаДокумент.Дата,
		|	ТаблицаДокумент.Контрагент,
		|	ТаблицаДокумент.Организация,
		|	ТаблицаДокумент.СуммаДокумента,
		|	&ВидПакетаID
		|ИЗ
		|	&ИмяТаблицыМетаданных КАК ТаблицаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК КэшКонтрагентовПоВидамПакетов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамДокументов КАК КэшКонтрагентовПоВидамДокументов
		|		ПО ТаблицаДокумент.Организация = КэшКонтрагентовПоВидамДокументов.Организация1С
		|			И ТаблицаДокумент.Контрагент = КэшКонтрагентовПоВидамДокументов.Контрагент1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО ТаблицаДокумент.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И КэшКонтрагентовПоВидамПакетов.ОтправлятьНепроведенные
		|	И КэшКонтрагентовПоВидамДокументов.ВидДокументаID = &ВидДокументаID
		|	И КэшКонтрагентовПоВидамДокументов.ФормироватьНаОсновании = &ЗначениеНастройкиФормироватьНаОсновании
		|	И ТаблицаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ТаблицаДокумент.ПометкаУдаления";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыМетаданных", "Документ." + ИмяТаблицыМетаданных);
	
	ВидДокументаID = ВидДокументаIDПоВидуПакетаID(ВидПакетаID);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокументаID", """" + ВидДокументаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеНастройкиФормироватьНаОсновании", """" + ЗначениеОснования + """");
	
	ТекстЗапроса = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета);
	
	Результат = ДобавитьОбъединениеВТекстЗапроса(Результат) + ТекстЗапроса;
	
КонецПроцедуры

Функция ВидДокументаIDПоВидуПакетаID(ВидПакетаID)
	
	Результат = "";
	
	Если 	ВидПакетаID = "ID_Счет"
		Или ВидПакетаID = "ID_СчетФормализованный" Тогда
		
		Результат = ВидПакетаID;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_АктыСверок(ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	
	Результат =
		"ВЫБРАТЬ
		|	АктСверкиВзаиморасчетов.Ссылка КАК Документ,
		|	АктСверкиВзаиморасчетов.Номер КАК НомерДокумента,
		|	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
		|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
		|	АктСверкиВзаиморасчетов.Организация КАК Организация,
		|	0 КАК СуммаДокумента,
		|	&ВидПакетаID КАК ВидПакетаID
		|ИЗ
		|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КэшКонтрагентовПоВидамПакетов КАК ВТ_КэшКонтрагентовПоВидамПакетов
		|		ПО АктСверкиВзаиморасчетов.Организация = ВТ_КэшКонтрагентовПоВидамПакетов.Организация1С
		|			И АктСверкиВзаиморасчетов.Контрагент = ВТ_КэшКонтрагентовПоВидамПакетов.Контрагент1С
		|			И (ВТ_КэшКонтрагентовПоВидамПакетов.ВидПакетаID = &ВидПакетаID)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтправленныеДокументы КАК ОтправленныеДокументы
		|		ПО АктСверкиВзаиморасчетов.Ссылка = ОтправленныеДокументы.Документ
		|			И (&УсловиеСвязиПоКатегорииПакета)
		|ГДЕ
		|	ОтправленныеДокументы.Документ ЕСТЬ NULL
		|	И АктСверкиВзаиморасчетов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ АктСверкиВзаиморасчетов.ПометкаУдаления";
	
	Результат = СтрЗаменить(Результат, "&ВидПакетаID", """" + ВидПакетаID + """");
	
	Результат = ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(Результат, ОписаниеВидаПакета);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьТаблицу_ПеремещениеТоваров(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Организация КАК Организация,
	|	ВТ_Отправители.Подразделение1С КАК ПодразделениеОтправитель,
	|	ВТ_Получатели.Подразделение1С КАК ПодразделениеПолучатель,
	|	ТаблицаДокументов.Номер КАК НомерДокумента,
	|	ТаблицаДокументов.Дата КАК ДатаДокумента,
	|	0 КАК СуммаДокумента,
	|	ТаблицаДокументов.Ссылка КАК Документ
	|ПОМЕСТИТЬ Диадок_ПеремещениеТоваров
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиВнутреннегоДокументооборота КАК ВТ_Настройки
	|		ПО ТаблицаДокументов.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакета = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Отправители
	|		ПО ТаблицаДокументов.Организация = ВТ_Отправители.Организация1С
	|			И ТаблицаДокументов.СкладОтправитель = ВТ_Отправители.Подразделение1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчастникиВнутреннегоДокументооборота КАК ВТ_Получатели
	|		ПО ТаблицаДокументов.Организация = ВТ_Получатели.Организация1С
	|			И ТаблицаДокументов.СкладПолучатель = ВТ_Получатели.Подразделение1С
	|ГДЕ
	|	ТаблицаДокументов.Проведен
	|	И ТаблицаДокументов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ВТ_Отправители.Подразделение1С ЕСТЬ NULL
	|	И НЕ ВТ_Получатели.Подразделение1С ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Возврат "Диадок_ПеремещениеТоваров";
	
КонецФункции

Функция ТекстЗапроса_СкорректированныеСвязиДляОтправленныхДокументов(ТекстЗапроса, ОписаниеВидаПакета)
	
	ВидПакетаID = ОписаниеВидаПакета.ID;
	КатегорияПакета = ОписаниеВидаПакета.КатегорияПакета;
	КатегорииПакетов = КатегорииПакетов();
	ОсновнойПакет = КатегорииПакетов.ОсновнойПакет;
	
	ПодстрокаПоиска = "&УсловиеСвязиПоКатегорииПакета";
	
	Если ЗначениеЗаполнено(КатегорияПакета) Тогда
		ПодстрокаЗамены = "ОтправленныеДокументы.КатегорияПакета = """ + КатегорияПакета + """"
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета ЕСТЬ NULL";
	Иначе
		ПодстрокаЗамены = "ОтправленныеДокументы.ВидПакета = &ВидПакетаID_" + ВидПакетаID
			+ " ИЛИ ОтправленныеДокументы.ВидПакета ЕСТЬ NULL";
	КонецЕсли;
	
	Если КатегорияПакета = КатегорииПакетов.СчетНаОплату Тогда
		
		ПодстрокаЗамены = ПодстрокаЗамены
			+ " ИЛИ ОтправленныеДокументы.КатегорияПакета = """ + ОсновнойПакет + """";
		
		ИспользоватьСХ2 = НЕ ОсновнойМодуль.ИспользоватьПодсистемуДиадока();
		ОснованияПоУмолчанию = Ядро_ОснованияВидовДокументов_ИспользуютсяТолькоНастройкиПоУмолчанию();
		
		Если ИспользоватьСХ2 И ОснованияПоУмолчанию Тогда
			ПодстрокаЗамены = "ИСТИНА";
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_ВременныеТаблицыДляСпискаПакетовНаОтправку()
	
	Результат = Ядро.СписокНаОтправку_ТекстЗапроса_ВременныеТаблицы();
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицей_СчетФактурыПоОтчетуКомиссионера(ТекстЗапроса)
	
	ТекстЗапросаВременныхТаблиц = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактура.Ссылка КАК Документ,
		|	СчетФактура.Проведен КАК Проведен,
		|	СчетФактура.Номер КАК НомерДокумента,
		|	СчетФактура.Дата КАК ДатаДокумента,
		|	ОтчетКомиссионера.Контрагент КАК Контрагент,
		|	СчетФактура.Организация КАК Организация,
		|	СчетФактура.СуммаДокумента КАК СуммаДокумента,
		|	СчетФактура.СводныйКомиссионный КАК Сводный
		|ПОМЕСТИТЬ ВТ_СчетФактурыПоОтчетуКомиссионера
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионера
		|		ПО СчетФактура.ДокументОснование = ОтчетКомиссионера.Ссылка
		|ГДЕ
		|	СчетФактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактура.СводныйКомиссионный
		|	И НЕ СчетФактура.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапросаВременныхТаблиц;
	
КонецПроцедуры

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПодходящиеДокументы.Документ,
	|	ВТ_ПодходящиеДокументы.ЭтоИсправление,
	|	ВТ_ПодходящиеДокументы.ЭтоКорректировка,
	|	ВТ_ПодходящиеДокументы.Документ.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Документ.Номер КАК НомерДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВТ_ПодходящиеДокументы.Документ.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Документ.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Документ.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Документ = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL"; 
	
	Возврат Результат;
			
КонецФункции

Процедура ТекстЗапроса_ДополнитьВременнойТаблицейДокументовБезНДС(ТекстЗапроса, НужнаВТДокументыБезНДС)

	Если НужнаВТДокументыБезНДС Тогда
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапроса_РазделительЗапросов() + ТекстЗапроса_ВТДокументыБезНДС();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	Запросы = Новый Массив;
	 
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииПроизводственныхУслуг", "Услуги");

	ТекстОтбораДокументов = ТекстыЗапросов_ДопУсловия_ВидОперацииКромеТоваровНаКомиссию();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Товары", ТекстОтбораДокументов);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "Услуги");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияТоваровУслуг", "АгентскиеУслуги");
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", "Услуги");
	
	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, "Истина");

	ТекстОтбораДокументов = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Товары", ТекстОтбораДокументов, , "Истина");
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "КорректировкаРеализации", "Услуги", ТекстОтбораДокументов, , "Истина");
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы);
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоРеализацииТоваровНаКомиссию(Запросы);  
	
	ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратам(Запросы);

	Результат = ОсновнойМодуль.ЭДО_Служебные_МассивВСтроку(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие = "", Исправление = "Ложь", Корректировка = "Ложь")
	
	ТЧ	= "Документ" + "." + ВидДокумента + ".ТабличнаяЧасть." + ТабличнаяЧасть;

	Если Метаданные.НайтиПоПолномуИмени(ТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|ГДЕ
	|	НЕ ТабличнаяЧасть.Ссылка.ПометкаУдаления
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
                
	Таблица = "Документ" + "." + ВидДокумента + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление); 
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	Если Запросы.Количество() = 0 Тогда
		Результат = СтрЗаменить(Результат, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		Результат = СтрЗаменить(Результат, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(Результат);
			
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат = " И ТабличнаяЧасть.Ссылка.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)";
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоРеализацииТоваровНаКомиссию(Запросы)
	
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	0 КАК ВсегоПозиций,
	|	0 КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|   И Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия)";
                	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);	
		
КонецПроцедуры    

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоВозвратам(Запросы)
	
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	1 КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
                	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);	
		
КонецПроцедуры

Функция ТекстыЗапросов_ДопУсловия_ВидОперацииКромеТоваровНаКомиссию()

	Результат = "	И ТабличнаяЧасть.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия)";
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДокументыБезСФ_ДобавитьТекстЗапросаПоОтчетуКомитентуОПродажах(Запросы)
		
	Результат =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА Док.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
                	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
			
КонецПроцедуры

Функция ФункцияДокументаДляXML(TypeNamedId, FunctionName)

	Если TypeNamedId = "Invoice" ИЛИ TypeNamedId = "InvoiceRevision" Тогда
		Результат = "СЧФ";
	ИначеЕсли TypeNamedId = "XmlTorg12" ИЛИ TypeNamedId = "XmlAcceptanceCertificate" Тогда
		Результат = "ДОП";
	ИначеЕсли TypeNamedId = "InvoiceCorrection" ИЛИ TypeNamedId = "InvoiceCorrectionRevision" Тогда
		Результат = "КСЧФ";
	Иначе
		Результат = ОсновнойМодуль.ФункцияДокументаДляXML(TypeNamedId, FunctionName);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция СформироватьВнешнююПечатнуюФорму(Документ, ВнешняяПечатнаяФорма, ИдентификаторКомандыПечатнойФормы = Неопределено, ДопПараметры = Неопределено)
	
	Попытка
		
		ТабличныйДокумент = НапечататьВнешнююФормуЛок(Документ, ВнешняяПечатнаяФорма);
		
	Исключение
		
		ОшибкаИнфо = ИнформацияОбОшибке();
		// BSLLS:NestedFunctionInParameters-off
		КомментарийЖР = СтрШаблонЛок(
			"Не удалось сформировать внешнюю печатную форму (%1) по причине:
			|%2",
			ВнешняяПечатнаяФорма,
			ПодробноеПредставлениеОшибки(ОшибкаИнфо)
		);
		// BSLLS:NestedFunctionInParameters-on
		
		ЗаписьЖурналаРегистрации(
			"Диадок.ПодготовитьЭлектронныйДокумент",
			УровеньЖурналаРегистрации.Ошибка,
			Документ.Метаданные(),
			Документ,
			КомментарийЖР
		);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	// BSLLS:NestedFunctionInParameters-off
	ИмяФайла = СтрШаблонЛок(
		"%1 № 2 от 3.pdf",
		ВнешняяПечатнаяФорма.Наименование,
		Документ.Номер,
		Формат(Документ.Дата, "ДФ=dd.MM.yyyy")
	);
	// BSLLS:NestedFunctionInParameters-on
	
	ИмяФайла = ЗаменитьНедопустимыеСимволы(ИмяФайла);
	
	// BSLLS:MissingTemporaryFileDeletion-off
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
	// BSLLS:MissingTemporaryFileDeletion-on
	
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Возврат Новый Структура("ИмяВременногоФайла, ИмяФайла", ИмяВременногоФайла, ИмяФайла);
	
КонецФункции

// Аналог функции УниверсальныеМеханизмы.НапечататьВнешнююФорму
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, по которому нужно сформировать печатную форму
//  ВнешняяПФ - СправочникСсылка.ВнешниеОбработки - внешняя печатная форма
// 
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма
//
Функция НапечататьВнешнююФормуЛок(Ссылка, ВнешняяПФ)
	
	ИндексПринадлежности = 0;
	ДвоичныеДанные = ВнешняяПФ.Принадлежность[ИндексПринадлежности].ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанные = ВнешняяПФ.ХранилищеВнешнейОбработки.Получить();
	КонецЕсли;
	ДополнительныеПараметры = ВнешняяПФ.Принадлежность[ИндексПринадлежности].ДополнительныеПараметрыОбработки.Получить();
	
	Если ДвоичныеДанные = Неопределено Тогда
		Ошибка = СтрШаблонЛок("Не удалось получить файл внешней печатной формы (%1)", ВнешняяПФ);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные.Записать(ИмяФайла);
	// BSLLS:UsingExternalCodeTools-off
	Обработка = ВнешниеОбработки.Создать(ИмяФайла);
	// BSLLS:UsingExternalCodeTools-on
	Обработка.СсылкаНаОбъект = Ссылка;
	
	// Передать внешней обработке дополнительные параметры
	Если ДополнительныеПараметры <> Неопределено Тогда
		// Если у внешней обработки есть реквизит для дополнительных параметров, присвоить ему значение
		Если НЕ Обработка.Метаданные().Реквизиты.Найти("ДополнительныеПараметры") = Неопределено Тогда
			Обработка.ДополнительныеПараметры = ДополнительныеПараметры;
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент = Обработка.Печать();
	
	// BSLLS:UsingSynchronousCalls-off
	УдалитьФайлы(ИмяФайла);
	// BSLLS:UsingSynchronousCalls-on
	
	Если ТипЗнч(ТабДокумент) = Тип("ТабличныйДокумент") И (ПустаяСтрока(ТабДокумент.ИмяПараметровПечати)) Тогда
		Попытка
			
			ИдентификаторОбработки = Строка(ВнешняяПФ.УникальныйИдентификатор());
			ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + СтрЗаменить(ИдентификаторОбработки, "-", "_");
			ТабДокумент.ИмяПараметровПечати = ТабДокумент.ИмяПараметровПечати + "_" + Ссылка.Метаданные().Имя;
			
		Исключение
			
			ОшибкаИнфо = ИнформацияОбОшибке();
			// BSLLS:NestedFunctionInParameters-off
			КомментарийЖР = СтрШаблонЛок(
				"Не удалось установить имя параметров печати (%1) по причине:
				|%2",
				ВнешняяПФ,
				ПодробноеПредставлениеОшибки(ОшибкаИнфо)
			);
			// BSLLS:NestedFunctionInParameters-on
			
			// BSLLS:UsageWriteLogEvent-off
			ЗаписьЖурналаРегистрации(
				"Диадок.ПодготовитьЭлектронныйДокумент",
				УровеньЖурналаРегистрации.Предупреждение,
				Ссылка.Метаданные(),
				Ссылка,
				КомментарийЖР
			);
			// BSLLS:UsageWriteLogEvent-on
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(СтрокаОбработки)
	
	НедопустимыеЗнаки = "\/:*?""<>|";
	
	Пока СтрДлина(НедопустимыеЗнаки) > 0 Цикл
		
		ТекСимвол = Лев(НедопустимыеЗнаки, 1);
		Если Найти(СтрокаОбработки, ТекСимвол) <> 0 Тогда
			СтрокаОбработки = СтрЗаменить(СтрокаОбработки, ТекСимвол, "_");
		КонецЕсли;
		НедопустимыеЗнаки = Сред(НедопустимыеЗнаки, 2);
		
	КонецЦикла;
	
	Возврат СтрокаОбработки;
	
КонецФункции

Функция УчетнаяЗапись()
	
	// Логин и пароль служебной учетки для выполнения регламентных действий
	Результат = Новый Структура;
	Результат.Вставить("Логин",		ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьЛогин);
	Результат.Вставить("Пароль",	ОсновнойМодуль.ЭДО_Модуль_ОбщиеНастройки().СлужебнаяУчетнаяЗаписьПароль);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначенийСКолонками(Колонки, ОписаниеТипов = Неопределено)

	Результат = Новый ТаблицаЗначений;
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьКолонкиВТаблицуЗначений(Результат, Колонки, ОписаниеТипов);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуТЗ(Таблица, Значение0 = Неопределено, 
									Значение1 = Неопределено, 
									Значение2 = Неопределено, 
									Значение3 = Неопределено, 
									Значение4 = Неопределено,
									Значение5 = Неопределено)
	
	ОсновнойМодуль.ЭДО_Служебные_ДобавитьСтрокуВТаблицуЗначений(Таблица, Значение0, Значение1, Значение2, Значение3, Значение4, Значение5);
	
КонецПроцедуры

Процедура ДобавитьЗначениеВСписок(Список, Значение, Представление)
	
	Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
		Список.Добавить(Значение, Представление);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

// Возвращает номер документа учета без префикса информационной базы,
// префикса конфигурации и лидирующих нолей
//
// Параметры:
//  Документ - ДокументСсылка - Докумена учета информационной базы
//
// Возвращаемое значение:
//   Строка - Номер без префиксов и лидирующих нолей
//
Функция ПредставлениеНомера(Документ)
	
	Результат = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеИННКПП(Наименование, ИНН, КПП)
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Результат = СтрШаблонЛок("%1, ИНН/КПП %2/%3", Наименование, ИНН, КПП);
	Иначе
		Результат = СтрШаблонЛок("%1, ИНН %2", Наименование, ИНН);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеНомераДляСФ(Документ, ПодразделениеОрганизации)
	
	Результат = ПредставлениеНомера(Документ);
	
	ДобавитьИндексОбособленногоПодразделения(Результат, Документ, ПодразделениеОрганизации);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИндексОбособленногоПодразделения(НомерДокумента, Документ, ПодразделениеОрганизации)
	
	Если ЭтоКонфигурацияБП() Тогда
		
		ПодразделениеОрганизацииНаОбщемБалансе = ЗначениеЗаполнено(ПодразделениеОрганизации)
			И ЕстьРеквизитОбъектаЛок("ОбособленноеПодразделение", Метаданные.Справочники.ПодразделенияОрганизаций)
			И ПодразделениеОрганизации.ОбособленноеПодразделение;
		
	Иначе
		
		ПодразделениеОрганизацииНаОбщемБалансе = ЗначениеЗаполнено(ПодразделениеОрганизации)
			И ЗначениеЗаполнено(ПодразделениеОрганизации.КодПоОКТМО);
		
	КонецЕсли;
	
	ИмяРеквизитаЦифровогоИндекса = "ЦифровойИндексОбособленногоПодразделения";
	
	Если ПодразделениеОрганизацииНаОбщемБалансе Тогда
		
		Если НЕ ПодразделениеОрганизации.метаданные().реквизиты.найти(ИмяРеквизитаЦифровогоИндекса) = Неопределено Тогда
			ИндексОбособленногоПодразделения = ЗначениеРеквизитаОбъектаЛок(
				ПодразделениеОрганизации,
				ИмяРеквизитаЦифровогоИндекса);
		КонецЕсли;
		
	ИначеЕсли ЕстьРеквизитОбъектаЛок(ИмяРеквизитаЦифровогоИндекса, Метаданные.Справочники.Организации) Тогда
		
		Организация = ЗначениеРеквизитаОбъектаЛок(Документ, "Организация");
		
		ИндексОбособленногоПодразделения = ЗначениеРеквизитаОбъектаЛок(
			Организация,
			ИмяРеквизитаЦифровогоИндекса);
		
	Иначе
		ИндексОбособленногоПодразделения = "";
	КонецЕсли;
	
	ЧастиНомера = Новый Массив;
	ЧастиНомера.Добавить(НомерДокумента);
	ЧастиНомера.Добавить(ИндексОбособленногоПодразделения);
	
	НомерДокумента = Общее_СоединитьСтроку(ЧастиНомера, "/");
	
КонецПроцедуры

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа СчетНаОплату
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_СчетНаОплату()
	
	Возврат "СчетНаОплату";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документа ЗаказПокупателя
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ЗаказПокупателя()
	
	Возврат "ЗаказПокупателя";
	
КонецФункции

// Возвращает строковое представление значения основания
// при формирования счета на оплату на основании документов продажи
//
// Возвращаемое значение:
//	Строка
Функция ТипОснованияСчетаНаОплату_ДокументПродажи()
	
	Возврат "ДокументПродажи";
	
КонецФункции

Функция ТипКонтентаUtd970()

	Возврат "utd970";
	
КонецФункции

Функция ФункцияДокументаУПД_СЧФДОП()
	Возврат ГенерацияXML_ФункцииУПД().СЧФДОП;
КонецФункции

Функция ФункцияДокументаУПД_СЧФ()
	Возврат ГенерацияXML_ФункцииУПД().СЧФ;
КонецФункции

Функция ФункцияДокументаУПД_ДОП()
	Возврат ГенерацияXML_ФункцииУПД().ДОП;
КонецФункции

Функция ГенерацияXML_ФункцииУПД()
	Результат = ГенерацияXML.Перечисление_ФункцииУПД();
	Возврат Результат;	
КонецФункции

Функция ГенерацияXML_Перечисление_ВидыЮрФизЛиц()
	
	Результат = ГенерацияXML.Перечисление_ВидыЮрФизЛиц();
	Возврат Результат;
	
КонецФункции

Функция Новый_ЭлементПротоКонтента(ИмяКонтента)
	
	СоздатьВсеСвойства = Ложь;
	ПреобразовыватьСпискиВМассивы = Истина;
	
	НовыйОбъектXDTO = ГенерацияXML.НовыйProtoОбъектXDTO(
		ИмяКонтента,
		СоздатьВсеСвойства
	);
	
	Результат = ГенерацияXML.ОбъектXDTOВСтруктуру(
		НовыйОбъектXDTO,
		ПреобразовыватьСпискиВМассивы
	);
	
	Возврат Результат;
	
КонецФункции

// Описывает значения псевдоперечисления ВидыКонтактнойИнформации.
// 
// Возвращаемое значение:
//  Структура - значения и представления значений перечисления.
//
Функция Перечисление_ВидыКонтактнойИнформации() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЮридическийАдрес", "ЮридическийАдрес");
	Результат.Вставить("ФактическийАдрес", "ФактическийАдрес");
	Результат.Вставить("ПочтовыйАдрес", "ПочтовыйАдрес");
	Результат.Вставить("Телефон", "Телефон");
	Результат.Вставить("Факс", "Факс");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораНаКомиссионнуюТорговлю(ВидДоговора)
	
	Результат = Ложь;

	Если ВидДоговора <> Неопределено Тогда
		
		Если ЭтоКонфигурацияБП() Тогда
			ЭтоВидДоговораСКомитентом = ЭтоВидДоговораСКомитентом_БП20(ВидДоговора);
			ЭтоВидДоговораСКомиссионером = ЭтоВидДоговораСКомиссионером_БП20(ВидДоговора);
		Иначе
			ЭтоВидДоговораСКомитентом = ЭтоВидДоговораСКомитентом(ВидДоговора);
			ЭтоВидДоговораСКомиссионером = ЭтоВидДоговораСКомиссионером(ВидДоговора);
		КонецЕсли;
		
		Результат = ЭтоВидДоговораСКомитентом Или ЭтоВидДоговораСКомиссионером;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомитентом(ВидДоговора)
	
	Результат = Ложь;
	
	Если ВидДоговора <> Неопределено Тогда
		
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомитентом_БП20(ВидДоговора)
	
	Результат = Ложь;
	
	Если ВидДоговора <> Неопределено Тогда
		
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		
		Если Не Результат Тогда
			Результат = (ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку"));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомиссионером(ВидДоговора)
	
	Результат = Ложь;
	
	Если ВидДоговора <> Неопределено Тогда
		
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидДоговораСКомиссионером_БП20(ВидДоговора)
	
	Результат = Ложь;
	
	Если ВидДоговора <> Неопределено Тогда
		
		Результат = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		
		Если Не Результат Тогда
			
			ЗначениеПеречисления = "Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку";
			
			Результат = (ВидДоговора = ПредопределенноеЗначение(ЗначениеПеречисления));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом()
	
	Возврат "ИсчНалАг";
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентомПредставление()
	
	Возврат "НДС исчисляется налоговым агентом";
	
КонецФункции

Функция ПредставлениеСтавкиБезНДС()
	
	Возврат "без НДС";
	
КонецФункции

Функция ЭтоИсправлениеРеализации(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ВидОперации = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ВидОперации");
		Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПередачаОС(ДокументСсылка)

	Результат = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПередачаОС") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОказаниеУслуг_БП20(ДокументСсылка)
	
	Результат = Ложь;
	
	Если ЭтоКонфигурацияБП()
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Функция ЭтоСчетФактураОтИмениПродавца_БП20(СсылкаНаОбъект)
	
	Если ЭтоКонфигурацияУПП() Или ЭтоКонфигурацияКА() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЭтоСчетФактураВыданный(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	ТребуемыеРеквизитыСФ = Новый Структура;
	ТребуемыеРеквизитыСФ.Вставить("Продавец");
	ТребуемыеРеквизитыСФ.Вставить("ДокументОснование");
	ЗначенияРеквизитовСФ = ЗначенияРеквизитовОбъектаЛок(СсылкаНаОбъект, ТребуемыеРеквизитыСФ);
			
	Если ТипЗнч(ЗначенияРеквизитовСФ.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		И ЗначениеЗаполнено(ЗначенияРеквизитовСФ.Продавец) Тогда
		
		ТребуемыеРеквизитыДок = Новый Структура;
		ТребуемыеРеквизитыДок.Вставить("ВидОперации", "ВидОперации");
		ЗначенияРеквизитовДок = ЗначенияРеквизитовОбъектаЛок(ЗначенияРеквизитовСФ.ДокументОснование, ТребуемыеРеквизитыДок);
		
		Если ЗначенияРеквизитовДок.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
			
			Результат = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураВыданный(ДокументСсылка)

	Результат = (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетФактураВыданный"));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСчетФактураНаАванс(ДокументСсылка)

	Результат = Ложь;
	
	Если ЭтоСчетФактураВыданный(ДокументСсылка) Тогда
		
		ВидСчетаФактуры = ЗначениеРеквизитаОбъектаЛок(ДокументСсылка, "ВидСчетаФактуры");
		
		Результат = (ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
					Или ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
		
		МетаданныеВидСчетаФактуры = Метаданные.Перечисления.ВидСчетаФактурыПолученного;
		Если МетаданныеВидСчетаФактуры.ЗначенияПеречисления.Найти("КорректировочныйНаАванс") <> Неопределено Тогда
			// отсутствует в КА 1.1.77 и ниже
			
			ИмяПредопределенногоЗначения = "Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс";
			
			Результат = Результат Или ВидСчетаФактуры = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазрешеноЧтениеТаблицы(ОбъектМетаданных)
	
	Результат = ПравоДоступа("Чтение", ОбъектМетаданных);
	Возврат Результат;
	
КонецФункции

Функция ЭтоКонфигурацияУПП()
	Результат = (Не _ЭтоБухгалтерияПредприятия И Не _ЭтоКомплекснаяАвтоматизация);
	Возврат Результат;
КонецФункции

Функция ЭтоКонфигурацияБП()
	Возврат _ЭтоБухгалтерияПредприятия;
КонецФункции

Функция ЭтоКонфигурацияКА()
	Возврат _ЭтоКомплекснаяАвтоматизация;
КонецФункции

//} СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



//****************************************************************************
//{		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",			 	"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", 		"Диадок (СКБ Контур): Подключаемый модуль");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Ложь);
	ПараметрыРегистрации.Вставить("Версия", 			ЭДО_ВерсияAPIПодключаемогоМодуля());
	ПараметрыРегистрации.Вставить("Информация", 		"Модуль работы с электронными первичными документами через Диадок (подключаемая часть)");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Выполнение регламентных операций подключаемого модуля Диадок", "ПМ_ВыполнитьРегламентныеДействия", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	
	Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление			= Представление;
	НоваяКоманда.Идентификатор			= Идентификатор;
	НоваяКоманда.Использование			= Использование;
	НоваяКоманда.ПоказыватьОповещение	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор			= Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если ИдентификаторКоманды = "ВыполнитьРегламентныеДействияПМ" Тогда
		ВыполнитьРегламентныеДействияПМ(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

//}		ПОДКЛЮЧЕНИЕ ВО ВНЕШНИЕ ОБРАБОТКИ

НеИспользуется_РежимУправляемыхФорм = Ложь; // Определяет версию типового модуля: ОФ / УФ
_ЭтоБухгалтерияПредприятия = (Найти(Метаданные.Имя, "БухгалтерияПредприятия")>0); // Разграничивает использование ПМ для БП от УПП и КА
_ЭтоКомплекснаяАвтоматизация = (Найти(Метаданные.Имя, "КомплекснаяАвтоматизация")>0); // Разграничивает использование ПМ для КА от УПП и БП
