////////////////////////////////////////////////////////////////////////////////
// Служебные методы для работы с файловой системой на клиенте.
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура НачатьПодключениеРасширенияРаботыСФайламиЛок(Оповещение) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры // НачатьПодключениеРасширенияРаботыСФайламиЛок

Процедура НачатьУстановкуРасширенияРаботыСФайламиЛок(Оповещение) Экспорт
	
	НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры // НачатьУстановкуРасширенияРаботыСФайламиЛок

Процедура НачатьПолучениеКаталогаВременныхФайловЛок(Оповещение) Экспорт
	
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловЛок

Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЛок(Оповещение, ИмяФайла) Экспорт
	
	НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ИмяФайла);
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаЛок

Процедура НачатьКопированиеФайлаЛок(Оповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	НачатьКопированиеФайла(Оповещение, ИмяФайлаИсточника, ИмяФайлаПриемника);
	
КонецПроцедуры // НачатьКопированиеФайлаЛок

Процедура НачатьПеремещениеФайлаЛок(Оповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	НачатьПеремещениеФайла(Оповещение, ИмяФайлаИсточника, ИмяФайлаПриемника);
	
КонецПроцедуры // НачатьПеремещениеФайлаЛок

Процедура НачатьПоискФайловЛок(Оповещение, Путь, Маска, ИскатьВПодкаталогах) Экспорт
	
	НачатьПоискФайлов(Оповещение, Путь, Маска, ИскатьВПодкаталогах);
	
КонецПроцедуры // НачатьПоискФайловЛок

Процедура НачатьСозданиеКаталогаЛок(Оповещение, ИмяКаталога) Экспорт
	
	НачатьСозданиеКаталога(Оповещение, ИмяКаталога);
	
КонецПроцедуры // НачатьСозданиеКаталогаЛок

Процедура НачатьУдалениеФайловЛок(Оповещение, Путь, Маска) Экспорт
	
	НачатьУдалениеФайлов(Оповещение, Путь, Маска);
	
КонецПроцедуры // НачатьУдалениеФайловЛок

Процедура НачатьПомещениеФайлаЛок(ОписаниеОповещенияОЗавершении,
		Адрес,
		ПомещаемыйФайл,
		Интерактивно,
		УникальныйИдентификаторФормы,
		ОписаниеОповещенияПередНачаломПомещенияФайла = Неопределено) Экспорт
	
	Если ОписаниеОповещенияПередНачаломПомещенияФайла = Неопределено Тогда
		НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении,
			Адрес,
			ПомещаемыйФайл,
			Интерактивно,
			УникальныйИдентификаторФормы);
	Иначе
		НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении,
			Адрес,
			ПомещаемыйФайл,
			Интерактивно,
			УникальныйИдентификаторФормы,
			ОписаниеОповещенияПередНачаломПомещенияФайла);
	КонецЕсли;
	
КонецПроцедуры // НачатьПомещениеФайлаЛок