////////////////////////////////////////////////////////////////////////////////
// Методы для работы с файловой системой на клиенте
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Служебные свойства
&НаКлиенте
Перем СтдКлиентЛок, СтдФССлужебныйЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// КОНСТРУКТОРЫ

// Содержит параметры диалога помещения файлов.
// Используется в качестве параметра <ПараметрыДиалога> методов
// НачатьПомещениеФайлаНаСервер и НачатьПомещениеФайловНаСервер.
//
// Параметры:
//  Заголовок - Строка - Заголовок диалога
//  МножественныйВыбор - Булево       - Значение свойства определяет, разрешен ли в диалоге выбор нескольких файлов:
//                                      Истина разрешается,
//                                      Ложь не разрешается.
//                     - Неопределено - Если значение Неопределено, то в методе
//                                      НачатьПомещениеФайлаНаСервер значение интерпретируется как Ложь,
//                                      а в методе НачатьПомещениеФайловНаСервер значение интерпретируется как Истина.
//	                                    Значению по умолчанию: Неопределено.
//
//  Фильтр - Строка	- Строка, определяющая все расширения файлов, доступные для выбора через диалог.
//  ИндексФильтра - Число - Индекс элемента в фильтре диалога, который будет выбран по умолчанию (нумерация с 0).
//
// Возвращаемое значение:
//  ПараметрыДиалогаПомещенияФайлов, Структура - ПараметрыДиалогаПомещенияФайлов
//
&НаКлиенте
Функция ПараметрыДиалогаПомещенияФайлов(Заголовок = Неопределено,
		МножественныйВыбор = Ложь, Фильтр = Неопределено, ИндексФильтра = 0) Экспорт
	
	Возврат СтдФССлужебный().ПараметрыДиалогаПомещенияФайлов(Заголовок, МножественныйВыбор, Фильтр, ИндексФильтра);
	
КонецФункции // ПараметрыДиалогаПомещенияФайлов

// Содержит настройки диалога получения файлов
//
// Параметры:
//  Заголовок - Строка, Неопределено - Заголовок диалога
//  ВыборКаталога - Булево - Определяет, будет ли открыт диалог для выбора каталога
//  Каталог - Строка - Содержит значение текущего каталога при открытии диалога
//
// Возвращаемое значение:
//  ПараметрыДиалогаПолученияФайлов - Содержит настройки диалога получения файлов
//
&НаКлиенте
Функция ПараметрыДиалогаПолученияФайлов(Заголовок = Неопределено,
		ВыборКаталога = Неопределено, Каталог = Неопределено) Экспорт
	
	Возврат СтдФССлужебный().ПараметрыДиалогаПолученияФайлов(Заголовок, ВыборКаталога, Каталог);
	
КонецФункции // ПараметрыДиалогаПолученияФайлов

// Содержит описание помещенного во временное хранилище файла
//
// Параметры:
//  Адрес - Строка, Неопределено - Адрес файла во временном хранилище
//  ПомещениеФайлаОтменено - Тип - Содержит признак отказа от помещения во временное хранилище файла
//  СсылкаНаФайл - СсылкаНаФайл - Ссылка на помещенный файл на диске
//
// Возвращаемое значение:
//  ОписаниеПомещенногоФайла - Описание помещенного во временное хранилище файла
//
&НаКлиенте
Функция ОписаниеПомещенногоФайла(Адрес, ПомещениеФайлаОтменено, СсылкаНаФайл) Экспорт
	
	Возврат СтдФССлужебный().ОписаниеПомещенногоФайла(Адрес, ПомещениеФайлаОтменено, СсылкаНаФайл);
	
КонецФункции // ОписаниеПомещенногоФайла

// Содержит описание местоположения файла на клиенте и на сервере
//
// Параметры:
//  ПутьКФайлу - Строка - Содержит полное имя файла
//  Адрес - Строка - Содержит положение файла на сервере
//
// Возвращаемое значение:
//  ОписаниеПереданногоФайла - Содержит описание местоположения файла на клиенте и на сервере
//
&НаКлиенте
Функция ОписаниеПереданногоФайла(ПутьКФайлу, Адрес) Экспорт
	
	Возврат СтдФССлужебный().ОписаниеПереданногоФайла(ПутьКФайлу, Адрес);
	
КонецФункции // ОписаниеПереданногоФайла

// Представляет собой указатель файла на диске
//
// Параметры:
//  Файл - Файл - Файл на диске
//
// Возвращаемое значение:
//  Тип - Представляет собой указатель файла на диске
//
&НаКлиенте
Функция СсылкаНаФайл(Файл) Экспорт
	
	Возврат СтдФССлужебный().СсылкаНаФайл(Файл);
	
КонецФункции // СсылкаНаФайл

// РАБОТА С ФАЙЛОВОЙ СИСТЕМОЙ

// Начинает получение имени каталога, который используется программой для размещения временных файлов.
// При необходимости подключает и устанавливает расширение работы с файлами
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ИмяКаталогаВременныхФайлов Строка
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеКаталогаВременныхФайловЛок(ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеКаталогаВременныхФайловЛок

// Начинает получение имени временного файла.
// Метод нужен, т.к. в веб клиенте нет возможности получить временный файл, поэтому
// его нужно будет удалить самостоятельно после использования.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ИмяВременногоФайла Строка
//                                            > ДополнительныеПараметры
//  Расширение - Строка - указывает желаемое расширение имени временного файла
//
&НаКлиенте
Процедура НачатьПолучениеИмениВременногоФайла(ИсходноеОповещение, Расширение = Неопределено) Экспорт
	
	СтдФССлужебный().НачатьПолучениеИмениВременногоФайлаЛок(ИсходноеОповещение, Расширение);
	
КонецПроцедуры // НачатьПолучениеИмениВременногоФайла

// Начинает создание двоичных данных из файла
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДвоичныеДанные
//                                            > ДополнительныеПараметры
//  ИмяФайла - Строка - имя файла, из которого нужно создать двоичные данные
//
&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЛок(ИсходноеОповещение, ИмяФайла) Экспорт
	
	СтдФССлужебный().НачатьСозданиеДвоичныхДанныхИзФайлаЛок(ИсходноеОповещение, ИмяФайла);
	
КонецПроцедуры // НачатьСозданиеДвоичныхДанныхИзФайлаЛок

// Начинает копирование файла-источника в файл-приемник. Допускается перезапись файла-приемника.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > СкопированныйФайл Строка
//                                            > ДополнительныеПараметры
//  ИмяФайлаИсточника - Строка - полное имя файла-источника
//  ИмяФайлаПриемника - Строка - полное имя файла-приемника
//
&НаКлиенте
Процедура НачатьКопированиеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	СтдФССлужебный().НачатьКопированиеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника);
	
КонецПроцедуры // НачатьКопированиеФайлаЛок

// Начинает перемещение (переименование) указанного файла.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ПеремещаемыйФайл Строка
//                                            > ДополнительныеПараметры
//  ИмяФайлаИсточника - Строка - полное имя файла-источника
//  ИмяФайлаПриемника - Строка - полное имя файла-приемника
//
&НаКлиенте
Процедура НачатьПеремещениеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	
	СтдФССлужебный().НачатьПеремещениеФайлаЛок(ИсходноеОповещение, ИмяФайлаИсточника, ИмяФайлаПриемника);
	
КонецПроцедуры // НачатьПеремещениеФайлаЛок

// Начинает поиск по заданной маске файлов и каталогов, расположенных в заданном каталоге.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > НайденныеФайлы Массив из Файл
//                                            > ДополнительныеПараметры
//  Путь - Строка - путь к каталогу, в котором производится поиск
//  Маска - Строка - маска выбора файлов.
//  ИскатьВПодкаталогах - Булево - будет произведен обход вложенных каталогов или нет
//
&НаКлиенте
Процедура НачатьПоискФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено, ИскатьВПодкаталогах = Ложь) Экспорт
	
	СтдФССлужебный().НачатьПоискФайловЛок(ИсходноеОповещение, Путь, Маска, ИскатьВПодкаталогах);
	
КонецПроцедуры // НачатьПоискФайловЛок

// Начинает создание нового каталога файлов.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ИмяКаталога Строка
//                                            > ДополнительныеПараметры
//  ИмяКаталога - Строка - полное имя создаваемого каталога.
//
&НаКлиенте
Процедура НачатьСозданиеКаталогаЛок(ИсходноеОповещение, ИмяКаталога) Экспорт
	
	СтдФССлужебный().НачатьСозданиеКаталогаЛок(ИсходноеОповещение, ИмяКаталога);
	
КонецПроцедуры // НачатьСозданиеКаталогаЛок

// Начинает удаление указанных файлов.
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДополнительныеПараметры
//  Путь - Строка - путь к удаляемым файлам.
//  Маска - Строка - маска для выбора удаляемых файлов.
//
&НаКлиенте
Процедура НачатьУдалениеФайловЛок(ИсходноеОповещение, Путь, Маска = Неопределено) Экспорт
	
	СтдФССлужебный().НачатьУдалениеФайловЛок(ИсходноеОповещение, Путь, Маска);
	
КонецПроцедуры // НачатьУдалениеФайловЛок

// Начинает помещение файла из локальной файловой системы во временное хранилище.
// Файл может быть задан разными способами: через путь к файлу и через параметры диалога.
//
// В зависимости от версии платформы, вызывает соответствующие методы
//   8.2.19.130
//     ПоместитьФайл(<Адрес>, <НачальноеИмяФайла>, <ВыбранноеИмяФайла>, <Интерактивно>, <УникальныйИдентификаторФормы>)
//
//   8.3.6.2524
//     НачатьПомещениеФайла(<ОписаниеОповещенияОЗавершении>,
//                          <Адрес>, <НачальноеИмяФайла>, <Интерактивно>, <УникальныйИдентификаторФормы>)
//
//   8.3.14.2095, 8.3.13.1644
//     НачатьПомещениеФайла(<ОписаниеОповещенияОЗавершении>,
//                          <Адрес>, <ПомещаемыйФайл>, <Интерактивно>, <УникальныйИдентификаторФормы>,
//                          <ОписаниеОповещенияПередНачаломПомещенияФайла>)
//     ПомещаемыйФайл Тип: Строка, ДиалогВыбораФайла, СсылкаНаФайл
//
//   8.3.23.2040
//     НачатьПомещениеФайлаНаСервер(<ОписаниеОповещенияОЗавершении>,
//                                  <ОписаниеОповещенияОХодеВыполнения>,
//                                  <ОписаниеОповещенияПередНачалом>,
//                                  <Адрес>, <ПутьКФайлу>, <УникальныйИдентификаторФормы>)
//     По ссылке на файл - не поддерживается TODO
//     НачатьПомещениеФайлаНаСервер(<ОписаниеОповещенияОЗавершении>,
//                                  <ОписаниеОповещенияОХодеВыполнения>,
//                                  <ОписаниеОповещенияПередНачалом>,
//                                  <Адрес>, <СсылкаНаФайл>, <УникальныйИдентификаторФормы>)
//     С диалогом выбора файла
//     НачатьПомещениеФайлаНаСервер(<ОписаниеОповещенияОЗавершении>,
//                                  <ОписаниеОповещенияОХодеВыполнения>,
//                                  <ОписаниеОповещенияПередНачалом>,
//                                  <Адрес>, <ПараметрыДиалога>, <УникальныйИдентификаторФормы>)
//
// Параметры:
//  ОписаниеОповещенияОЗавершении - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                                       вызвана после завершения со следующими параметрами
//                                                       > ОписаниеПомещенногоФайла  ОписаниеПомещенногоФайла
//                                                       > ДополнительныеПараметры
//  ОписаниеОповещенияОХодеВыполнения - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                                           вызвана несколько раз по мере помещения файла
//                                                           со следующими параметрами
//                                                           > ПомещаемыйФайл СсылкаНаФайл
//                                                           > Помещено Число
//                                                           > ОтказОтПомещенияФайла Булево
//                                                           > ДополнительныеПараметры
//  ОписаниеОповещенияПередНачалом - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                                        вызвана перед началом помещения файла
//                                                        со следующими параметрами
//                                                        > ПомещаемыйФайл  СсылкаНаФайл
//                                                        > ОтказОтПомещенияФайла  Булево
//                                                        > ДополнительныеПараметры
//  Адрес - Строка - адрес файла во временном хранилище, по которому должен быть помещен файл
//  ПутьКФайлуПараметрыДиалога - Строка - путь к файлу на диске
//                             - ПараметрыДиалогаПомещенияФайлов - структура с параметрами диалога
//  УникальныйИдентификаторФормы - УникальныйИдентификатор - для хранения помещенного значения
//                                                           на время жизни формы
//
&НаКлиенте
Процедура НачатьПомещениеФайлаНаСерверЛок(ОписаниеОповещенияОЗавершении = Неопределено, // BSLLS:OrderOfParams-off
		ОписаниеОповещенияОХодеВыполнения = Неопределено, // Соответствует оригинальной сигнатуре
		ОписаниеОповещенияПередНачалом = Неопределено,
		Адрес = Неопределено,
		Знач ПутьКФайлуПараметрыДиалога,
		УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	СтдФССлужебный().НачатьПомещениеФайлаНаСерверЛок(ОписаниеОповещенияОЗавершении,
		ОписаниеОповещенияОХодеВыполнения,
		ОписаниеОповещенияПередНачалом,
		Адрес,
		ПутьКФайлуПараметрыДиалога,
		УникальныйИдентификаторФормы);
	
КонецПроцедуры // НачатьПомещениеФайлаНаСерверЛок

// Начинает получение файла и сохраняет его в локальную файловую систему пользователя,
// предлагая пользователю выбрать месторасположение получаемого файла.
//
// Параметры:
//  Адрес - Строка - расположение данных во временном хранилище или в информационной базе.
//  ИмяФайла - Строка - имя файла, которое будет предложено пользователю для сохранения файла.
//  ПараметрыДиалога - ПараметрыДиалогаПолученияФайлов - структура, содержащая параметры диалога.
//
&НаКлиенте
Процедура НачатьПолучениеФайлаССервераСДиалогом(Адрес, ИмяФайла = Неопределено, ПараметрыДиалога = Неопределено) Экспорт
	
	СтдФССлужебный().НачатьПолучениеФайлаССервераСДиалогомЛок(Адрес, ИмяФайла, ПараметрыДиалога);
	
КонецПроцедуры // НачатьПолучениеФайлаССервераСДиалогом

// Начинает получение файла и сохраняет его в локальную файловую систему пользователя по указанному пути.
//
// Параметры:
//  ОписаниеОповещенияОЗавершении - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                                       вызвана после завершения со следующими параметрами
//                                                       > ПолученныйФайл ОписаниеПереданногоФайла
//                                                       > ДополнительныеПараметры
//  Адрес - Строка - расположение данных во временном хранилище или в информационной базе.
//  ПутьКФайлу - Строка - имя файла, которое будет предложено пользователю для сохранения файла.
//
&НаКлиенте
Процедура НачатьПолучениеФайлаССервераБезДиалога(// Соответствует оригинальной сигнатуре
		ОписаниеОповещенияОЗавершении = Неопределено, Адрес, ПутьКФайлу) Экспорт // BSLLS:OrderOfParams-off
	
	СтдФССлужебный().НачатьПолучениеФайлаССервераБезДиалогаЛок(ОписаниеОповещенияОЗавершении, Адрес, ПутьКФайлу);
	
КонецПроцедуры // НачатьПолучениеФайлаССервераБезДиалога

// Инициирует получение у пользователя разрешения на несколько операций с файлами
//
// Параметры:
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > РазрешенияПолучены Булево
//                                            > ДополнительныеПараметры
//  Вызовы - Массив из ОписаниеОповещения - массив с описаниями вызовов
//
&НаКлиенте
Процедура НачатьЗапросРазрешенияПользователяЛок(ИсходноеОповещение, Вызовы) Экспорт
	
	СтдФССлужебный().НачатьЗапросРазрешенияПользователяЛок(ИсходноеОповещение, Вызовы);
	
КонецПроцедуры // НачатьЗапросРазрешенияПользователяЛок

// МЕТОДЫ ДВОИЧНЫХ ДАННЫХ

// Начинает запись двоичных данных в файл
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - данные, которые нужно записать
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДополнительныеПараметры
//  ИмяФайла - Строка - имя файла, в которые требуется записать двоичные данные
//
&НаКлиенте
Процедура НачатьЗаписьДвоичныхДанных(ДвоичныеДанные, ИсходноеОповещение, ИмяФайла) Экспорт
	
	СтдФССлужебный().НачатьЗаписьДвоичныхДанныхЛок(ДвоичныеДанные, ИсходноеОповещение, ИмяФайла);
	
КонецПроцедуры // НачатьЗаписьДвоичныхДанных

// МЕТОДЫ ФАЙЛА

// Начинает получение времени последнего изменения файла
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ВремяИзменения  Дата
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеВремениИзмененияФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеВремениИзмененияФайла

// Начинает получение атрибута файла "Скрытый"
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > Невидимый Булево
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеНевидимостиФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеНевидимостиФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеНевидимостиФайла

// Начинает получение размера файла
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > Размер Число
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеРазмераФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеРазмераФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеРазмераФайла

// Начинает получение значение атрибута файла "Только чтение"
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ТолькоЧтение Булево
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеТолькоЧтенияФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеТолькоЧтенияФайла

// Начинает получение универсального времени последнего изменения файла.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ВремяИзменения Дата
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПолучениеУниверсальногоВремениИзмененияФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПолучениеУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПолучениеУниверсальногоВремениИзмененияФайла

// Начинает проверку существования файла.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > Существует Булево
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПроверкуСуществованияФайла(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПроверкуСуществованияФайлаЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПроверкуСуществованияФайла

// Начинает определение, соответствует ли файловый объект каталогу или файлу.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ЭтоКаталог Файл
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПроверкуЭтоКаталогФайл(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПроверкуЭтоКаталогФайлЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПроверкуЭтоКаталогФайл

// Начинает определение, соответствует ли файловый объект файлу или каталогу.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ЭтоФайл Файл
//                                            > ДополнительныеПараметры
//
&НаКлиенте
Процедура НачатьПроверкуЭтоФайлФайл(Файл, ИсходноеОповещение) Экспорт
	
	СтдФССлужебный().НачатьПроверкуЭтоФайлФайлЛок(Файл, ИсходноеОповещение);
	
КонецПроцедуры // НачатьПроверкуЭтоФайлФайл

// Начинает установку времени изменения.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами:
//                                            > ДополнительныеПараметры
//  ВремяИзменения - Дата
//
&НаКлиенте
Процедура НачатьУстановкуВремениИзмененияФайла(Файл, ИсходноеОповещение = Неопределено, // BSLLS:OrderOfParams-off
		ВремяИзменения) Экспорт // Соответствует оригинальной сигнатуре
	
	СтдФССлужебный().НачатьУстановкуВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения);
	
КонецПроцедуры // НачатьУстановкуВремениИзмененияФайла

// Начинает установку значения атрибута файла "Скрытый"
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДополнительныеПараметры
//  Невидимость - Булево
//
&НаКлиенте
Процедура НачатьУстановкуНевидимостиФайла(Файл, ИсходноеОповещение = Неопределено, // BSLLS:OrderOfParams-off
		Невидимость) Экспорт // Соответствует оригинальной сигнатуре
	
	СтдФССлужебный().НачатьУстановкуНевидимостиФайлаЛок(Файл, ИсходноеОповещение, Невидимость);
	
КонецПроцедуры // НачатьУстановкуНевидимостиФайла

// Начинает установку атрибута файла "Только чтение"
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДополнительныеПараметры
//  ТолькоЧтение - Булево
//
&НаКлиенте
Процедура НачатьУстановкуТолькоЧтенияФайла(Файл, ИсходноеОповещение = Неопределено, // BSLLS:OrderOfParams-off
		ТолькоЧтение) Экспорт // Соответствует оригинальной сигнатуре
	
	СтдФССлужебный().НачатьУстановкуТолькоЧтенияФайлаЛок(Файл, ИсходноеОповещение, ТолькоЧтение);
	
КонецПроцедуры // НачатьУстановкуТолькоЧтенияФайла

// Начинает установку времени последнего изменения файла.
//
// Параметры:
//  Файл - Файл - файл, для которого будет вызван метод
//  ИсходноеОповещение - ОписаниеОповещения - содержит описание процедуры, которая будет
//                                            вызвана после завершения со следующими параметрами
//                                            > ДополнительныеПараметры
//  ВремяИзменения - Дата
//
&НаКлиенте
Процедура НачатьУстановкуУниверсальногоВремениИзмененияФайла(Файл, // BSLLS:OrderOfParams-off
		ИсходноеОповещение = Неопределено, ВремяИзменения) Экспорт // Соответствует оригинальной сигнатуре
	
	СтдФССлужебный().НачатьУстановкуУниверсальногоВремениИзмененияФайлаЛок(Файл, ИсходноеОповещение, ВремяИзменения);
	
КонецПроцедуры // НачатьУстановкуУниверсальногоВремениИзмененияФайла

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Функция Инит(СтдКлиент) Экспорт
	
	СтдКлиентЛок = СтдКлиент;
	
	Возврат ЭтаФорма;
	
КонецФункции // Инит

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция СтдФССлужебный()
	
	Если СтдФССлужебныйЛок = Неопределено Тогда
		СтдФССлужебныйЛок = ПолучитьФорму(ИмяФормы + "Служебный");
		СтдФССлужебныйЛок.Инит(СтдКлиентЛок);
	КонецЕсли;
	
	Возврат СтдФССлужебныйЛок;
	
КонецФункции // СтдФССлужебный