////////////////////////////////////////////////////////////////////////////////
// Методы для работы с Аутентификацией 
//
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Свойства
Перем
ЭтоВнешняяОбработкаКэш;

// Служебные зависимости
Перем
HttpЛок,
СтдСтрЛок,
КонфигурацияПриложения,
КонфигурацияПровайдера,
ХранилищеСессий,
ОтборСессий;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает текущую сессию из хранилища и проверяет её валидность.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Данные валидной сессии.
//                          См. МодельОтветТокен.
//  Неопределено - Если сессия отсутствует или невалидна.
//
Функция ПолучитьСессию() Экспорт
	
	Выборка = ХранилищеСессий().ВыбратьСессии(ОтборСессий);	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сессия = МодельОтветТокен();
	ЗаполнитьЗначенияСвойств(Сессия, Выборка);
	
	Сессия = Новый ФиксированнаяСтруктура(Сессия);	
	Возврат ВалидацияСессии(Сессия);
		
КонецФункции

// Обновляет сессию и сохраняет её в хранилище, если она валидна.
//
// Параметры:
//  Сессия - ФиксированнаяСтруктура - Данные сессии для обновления.
//                                    См. МодельОтветТокен.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Обновлённые данные сессии, если обновление успешно.
//                          См. МодельОтветТокен.
//
Функция ОбновитьСессию(Сессия) Экспорт
	
	Если Не СессияВалидна(Сессия) Тогда
		ВызватьИсключение "Не удалось обновить сессию: сессия не валидна";
	КонецЕсли;
	
	Попытка
		Результат = _ОбновитьСессию(Сессия);
	Исключение
		Результат = Неопределено;
		ХранилищеСессий().УдалитьСессию(ОтборСессий);
	КонецПопытки;
	
	Если СессияВалидна(Результат) Тогда
		СохранитьСессию(Результат);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Сохраняет данные сессии в хранилище.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Данные сессии для сохранения.
//                                     См. МодельОтветТокен.
//
Процедура СохранитьСессию(Значение) Экспорт 
	
	Модель = МодельОтветТокен();
	
	ЗаполнитьЗначенияСвойств(Модель, Значение);
	          
	Сессия = Новый ФиксированнаяСтруктура(Модель);
	ХранилищеСессий().СохранитьСессию(ОтборСессий, Сессия);
	
КонецПроцедуры

// Отправляет запрос провайдеру на отзыв токена.
//
Процедура ЗавершитьСессию() Экспорт
	
	Попытка
		Сессия = ПолучитьСессию();
	Исключение
		Возврат;
	КонецПопытки;
	
	Если Сессия = Неопределено Тогда
		ВызватьИсключение "Не удалось найти сессию";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сессия.ПортальныйИд) Тогда
		Выйти(Сессия);
	Иначе
		ОтозватьТокен(Сессия);	
	КонецЕсли;
	
	ХранилищеСессий().УдалитьСессию(ОтборСессий);
	
КонецПроцедуры

// Возвращает интерфейс для работы с хранилищем сессий.
//
// Возвращаемое значение:
//	Произвольный - Зависит от конкретной реализации хранилища.
//
Функция ХранилищеСессий() Экспорт
	
	Если ХранилищеСессий = Неопределено Тогда
		ВызватьИсключение "Хранилище сессий не определенно";
	КонецЕсли;
	
	Возврат ХранилищеСессий;
	
КонецФункции

// Устанавливает свойство формы для использования указанной конфигурации приложения.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация приложения.
//                                     См. МодельКонфигурацияПриложения.
//
Процедура УстановитьКонфигурациюПриложения(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации приложения: ожидалась структура или фиксированная структура";
	КонецЕсли;
	
	ПроверитьКонфигурациюПриложения(Значение);
	
	КонфигурацияПриложения = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации провайдера.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация провайдера.
//                                     См. МодельКонфигурацияПровайдера.
//
Процедура УстановитьКонфигурациюПровайдера(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации провайдера: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	ПроверитьКонфигурациюПровайдера(Значение);
	
	КонфигурацияПровайдера = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанного объекта метаданных в качестве хранилища сессий.
//
// Параметры:
//  Значение - Строка - Имя объекта метаданных, используемого как хранилище сессий.
//                     Допустимые значения: "Обработка", "Справочник", "РегистрСведений", "ОбщийМодуль".
//
Процедура УстановитьХранилищеСессий(Значение = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		ХранилищеСессий = ХранилищеПоУмолчанию();
	Иначе
		Если ХранилищеЭтоОбработка(Значение) Тогда
			ХранилищеСессий = Новый(Значение);
		ИначеЕсли ХранилищеЭтоСправочник(Значение) Тогда
			ХранилищеСессий = Справочники[Значение];
		ИначеЕсли ХранилищеЭтоРегистрСведений(Значение) Тогда
			ХранилищеСессий = РегистрыСведений[Значение];
		ИначеЕсли ХранилищеЭтоОбщийМодуль(Значение) Тогда
			ХранилищеСессий = Вычислить(Значение);			
		Иначе
			ВызватьИсключение "Неопределенный тип хранилища сессией";
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Устанавливает свойство формы для использования отбора сессий. Устанавливать отбор необходимо после установки 
//	конфигурации приложения и провайдера, так как на основании этих данных собирается ключ объекта
//
// Параметры:
//  Значение - Структура, ФиксированнаяСтруктура - Модель зависит от реализации хранилища.
//							Аутентификатор добавит поле КлючОбъекта, если такое поле уже имеется, оно будет перезаписано
//
Процедура УстановитьОтборСессий(Знач Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Пустое значение отбора сессией";	
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);
	КонецЕсли;

	ОтборСессий = Значение; 
	
КонецПроцедуры

// Возвращает контракт конифгурации приложения
//
// Возвращаемое значение:
//	- Структура: 
//		Имя - Строка - Имя приложения у провайдера
//		Ключ - Строка - Ключ приложения у провайдера
//		Разрешения - Строка - Набор запрашиваемых доступов
//		ПроверятьАктуальностьТокена - Булево - опция определения валидности токенна у провайдера
//      Опции - Структура - Контракт необязательных параметров. см. МодельОпции
//
Функция МодельКонфигурацияПриложения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("Ключ");
	Результат.Вставить("Разрешения");
	Результат.Вставить("ПроверятьАктуальностьТокена", Ложь);
	Результат.Вставить("Опции", МодельОпции());
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт конифгурации провайдера
//
// Возвращаемое значение:
//	- Структура: 
//		Хост - Строка - Сервер провайдера
//		Тип - Строка - Тип получаемого токена: "urn:ietf:params:oauth:grant-type:device_code", "client_credentials"
//
Функция МодельКонфигурацияПровайдера() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Тип");
	
	Возврат Результат;
	
КонецФункции

// Собирает ключ объекта аутентификатора по конифгурации приложения и конфигурации провайдера.
//
// Возвращаемое значение:
//	Строка - ключ объекта аутентификатора.
//
Функция СобратьКлючОбъекта() Экспорт
	
	Если ТипЗнч(КонфигурацияПриложения) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Не установлена конфигурация приложения";
	КонецЕсли;
	
	Если ТипЗнч(КонфигурацияПровайдера) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Не установлена конфигурация провайдера";
	КонецЕсли;
	
	Разрешения = СортироватьРазрешения(КонфигурацияПриложения.Разрешения);
	Ключ = СтдСтр().СтрШаблонЛок("%1%2%3", КонфигурацияПриложения.Имя, НРег(КонфигурацияПровайдера.Хост), Разрешения);
	Ключ = СтдСтр().СтрШаблонЛок("%1%2%3", КонфигурацияПриложения.Имя, НРег(КонфигурацияПровайдера.Хост), Разрешения);
	Ключ = Base64Строка(СтрокаКакДвоичныеДанные(Ключ));
	
	Результат = СтрЗаменить(Ключ, Символ(КодСимвола(Символы.ПС)), "");
	Результат = СтрЗаменить(Результат, Символ(КодСимвола(Символы.ВК)), "");
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция _НовыйКодУстройства() Экспорт
	
	Возврат КодУстройства();

КонецФункции

Функция _НоваяСессия(КодУстройства = Неопределено) Экспорт
	
	Если КодУстройства = Неопределено И КонфигурацияПровайдера.Тип <> ТипАутентификацииКлиентУчетныеДанные() Тогда
		ВызватьИсключение "Для данного типа аутентификации требуется код устройства";
	КонецЕсли;
	
	Результат = Токен(КодУстройства);	
	Если СессияВалидна(Результат) Тогда
		СохранитьСессию(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция _КонфигурацияПровайдераПоУмолчанию() Экспорт

	Результат = МодельКонфигурацияПровайдера();
	Результат.Хост = "https://identity.kontur.ru";
	Результат.Тип  = "urn:ietf:params:oauth:grant-type:device_code";
	
	Возврат Результат;
	
КонецФункции

// Возвращает Истина, если объект внешняя обработка, Иначе Ложь
//
// Возвращаемое значение:
//	- Булево
//
Функция _ЭтоВнешняяОбработка() Экспорт
	
	Если ЭтоВнешняяОбработкаКэш = Неопределено Тогда
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
		Если ПараметрыПроверки.ИспользуемоеИмяФайла = Неопределено Тогда
			ЭтоВнешняяОбработкаКэш = Ложь;
		Иначе
			ЭтоВнешняяОбработкаКэш = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭтоВнешняяОбработкаКэш;
	
КонецФункции

// Возвращает данные компоненты
//
// Возвращаемое значение:
// - ДвоичныеДанные
//
Функция _ДанныеКомпонентыГенератораQr() Экспорт
	
	Если Не _КомпонентаГенератораQrЕсть() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьМакет(ИмяКомпонентыГенератораQr());
	
КонецФункции

// Если есть макет с компонентой для генерации Qr-кода, возвращает истина
//
// Возвращаемое значение:
// - Булево
//
Функция _КомпонентаГенератораQrЕсть() Экспорт

	Возврат Метаданные().Макеты.Найти(ИмяКомпонентыГенератораQr()) <> Неопределено;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// ЗАПРОСЫ

Функция ЗапросКодУстройства(ПараметрыЗапроса)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = "/connect/deviceauthorization";
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	Результат.Параметры = ПараметрыЗапроса;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросТокен(ПараметрыЗапроса)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = "/connect/token";
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	Результат.Параметры = ПараметрыЗапроса;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросОтозватьТокен(ПараметрыЗапроса)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization", АвторизацияБазовая());
	
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = "/connect/revocation";
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	Результат.Параметры = ПараметрыЗапроса;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросДанныеТокена(ПараметрыЗапроса)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization", АвторизацияБазовая());
		
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = "/connect/introspect";
	Результат.Метод = "GET";
	Результат.Заголовки = Заголовки;
	Результат.Параметры = ПараметрыЗапроса;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросВыйти(Сессия)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Kontur-Apikey", КонфигурацияПриложения.Ключ);
		
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = СтдСтр().СтрШаблонЛок("/grants/%1|%2/revoke", КонфигурацияПриложения.Имя, Сессия.ПортальныйИд);
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	
	Возврат Результат;
	
КонецФункции

// ОПРЕДЕЛЕНИЯ

Функция МодельЗапрос()
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Ресурс");
	Результат.Вставить("Метод");
	Результат.Вставить("Параметры");
	
	Результат.Вставить("Заголовки");
	
	Возврат Результат;
	
КонецФункции

Функция МодельОтветКодУстройства()
	
	Результат = Новый Структура;
	Результат.Вставить("Код");
	Результат.Вставить("КодПользователя");
	Результат.Вставить("Ссылка");
	Результат.Вставить("СсылкаАвторизации");
	Результат.Вставить("Интервал");
	Результат.Вставить("ВремяЖизни", 0);
	Результат.Вставить("УниверсальнаяДатаОкончания", Дата(1, 1, 1));
	Результат.Вставить("УниверсальнаяДатаОкончанияМС", 0);

	Возврат Результат;
	
КонецФункции

Функция МодельОтветТокен()
	
	Результат = Новый Структура;
	Результат.Вставить("ТокенДоступа");
	Результат.Вставить("ТокенОбновления");
	Результат.Вставить("ВремяЖизни", 0);
	Результат.Вставить("УниверсальнаяДатаОкончания", Дата(1, 1, 1));
	Результат.Вставить("УниверсальнаяДатаОкончанияМС", 0);
	Результат.Вставить("Тип");
	Результат.Вставить("ПортальныйИд");
	Результат.Вставить("Имя");
	Результат.Вставить("Фамилия");
	Результат.Вставить("Отчество");
	Результат.Вставить("ФИО");
	Результат.Вставить("Телефон");
	Результат.Вставить("Почта");
	
	Возврат Результат;
	
КонецФункции

Функция МодельОтветДанныеТокена()

	Результат = Новый Структура;
	Результат.Вставить("Активный");
	Результат.Вставить("ПортальныйИд");
	Результат.Вставить("Разрешения");
	Результат.Вставить("УниверсальнаяДатаСоздания");
	Результат.Вставить("УниверсальнаяДатаВыдачи");
	Результат.Вставить("УниверсальнаяДатаОкончания");
	Результат.Вставить("ИмяПриложения");
	Результат.Вставить("Провайдер");	
	Результат.Вставить("Ресурсы");
	
	Возврат Результат;
	
КонецФункции

Функция МодельОтветДанныеПользователя()
	
	Результат = Новый Структура;
	Результат.Вставить("ПортальныйИд");
	Результат.Вставить("Имя");
	Результат.Вставить("Почта");
	
	Возврат Результат;
	
КонецФункции

Функция МодельОшибка()

	Результат = Новый Структура;
	Результат.Вставить("Описание");
	Результат.Вставить("След");
	
	Возврат Результат;
	
КонецФункции

// КОД УСТРОЙСТВА

Функция КодУстройства() Экспорт
	
	ПараметрыЗапроса = ДевайКодСформироватьПараметры();
	Запрос = ЗапросКодУстройства(ПараметрыЗапроса);
	Результат = Коннектор().Post(СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс), Запрос.Параметры);
	Ответ = Коннектор().КакJson(Результат);
	
	Если Ответ.Получить("error") <> Неопределено Тогда
		ВызватьИсключение СтдСтр().СтрШаблонЛок("error: %1, TraceId: %2", Ответ.Получить("error"), 
			Результат.Заголовки.Получить("X-Kontur-Trace-Id"));
	КонецЕсли;
	
	Результат = РазобратьОтветКодУстройства(Ответ);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция ДевайКодСформироватьПараметры() 
	
	Результат = Новый Соответствие;
	Результат.Вставить("client_id", КонфигурацияПриложения.Имя);
	Результат.Вставить("client_secret", КонфигурацияПриложения.Ключ);
	Результат.Вставить("scope", КонфигурацияПриложения.Разрешения);
	
	Возврат Результат;
	
КонецФункции

Функция РазобратьОтветКодУстройства(Ответ)
	
	Результат = МодельОтветКодУстройства();
	
	Результат.Код = Ответ.Получить("device_code");
	Результат.КодПользователя = Ответ.Получить("user_code");
	Результат.Ссылка = Ответ.Получить("verification_uri");
	Результат.СсылкаАвторизации = Ответ.Получить("verification_uri_complete");
	Результат.Интервал = Ответ.Получить("interval");
	Результат.ВремяЖизни = Ответ.Получить("expires_in");
	
	ВМиллисекундах = 1000;	
	Если ЗначениеЗаполнено(Результат.ВремяЖизни) Тогда
		Результат.УниверсальнаяДатаОкончания = ТекущаяУниверсальнаяДата() + Число(Результат.ВремяЖизни);
		Результат.УниверсальнаяДатаОкончанияМС = (Дата(1, 1, 1) - Результат.УниверсальнаяДатаОкончания) 
			* ВМиллисекундах * -1; 
	Иначе
		Результат.УниверсальнаяДатаОкончания = Дата(1, 1, 1);
		Результат.УниверсальнаяДатаОкончанияМС = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ТОКЕН ДОСТУПА

Функция Токен(КодУстройства)
	
	ПараметрыЗапроса = ТокенСформироватьПараметры(КодУстройства); 
	Запрос = ЗапросТокен(ПараметрыЗапроса);
	
	Результат = Коннектор().Post(СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс), Запрос.Параметры);
	Ответ = Неопределено;
	Если Результат.КодСостояния >= Коннектор().КодыСостоянияHTTP().НеверныйЗапрос_400 Тогда
		След = Результат.Заголовки.Получить("X-Kontur-Trace-Id");
		Попытка
			Ответ = Коннектор().КакJson(Результат);
		Исключение
			ВызватьИсключение СтдСтр().СтрШаблонЛок("error: %1, TraceId: %2", "Неизвестная ошибка", След);	
		КонецПопытки;
		Если ОтветСОшибкой(Ответ) Тогда
			ВызватьИсключение СтдСтр().СтрШаблонЛок("error: %1, TraceId: %2", Ответ.Получить("error"), След);
		КонецЕсли;
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		Ответ = Коннектор().КакJson(Результат);
	КонецЕсли;
	Результат = ТокенРазобратьОтвет(Ответ);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция ТокенСформироватьПараметры(КодУстройства)
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("grant_type", КонфигурацияПровайдера.Тип);
	Результат.Вставить("client_id", КонфигурацияПриложения.Имя);
	Результат.Вставить("client_secret", КонфигурацияПриложения.Ключ);
	Результат.Вставить("scope", КонфигурацияПриложения.Разрешения);
	Результат.Вставить("device_code", КодУстройства);
	
	УдалитьПустыеЛок(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТокенРазобратьОтвет(Ответ)
	
	Результат = МодельОтветТокен();
	
	ДанныеТокена = КакJwt(Ответ.Получить("id_token"));
	
	Результат.ТокенДоступа = Ответ.Получить("access_token");
	Результат.ТокенОбновления = Ответ.Получить("refresh_token");
	Результат.ВремяЖизни = Ответ.Получить("expires_in");
	Результат.Тип = Ответ.Получить("token_type");
	Результат.ПортальныйИд = ДанныеТокена.Тело.Получить("sub");
	Результат.Имя = ДанныеТокена.Тело.Получить("given_name");
	Результат.Фамилия = ДанныеТокена.Тело.Получить("family_name");
	Результат.Отчество = ДанныеТокена.Тело.Получить("middle_name");
	Результат.ФИО = ДанныеТокена.Тело.Получить("name");
	Результат.Телефон = ДанныеТокена.Тело.Получить("phone_number");
	Результат.Почта = ДанныеТокена.Тело.Получить("email");
	
	ВМиллисекундах = 1000;	
	Если ЗначениеЗаполнено(Результат.ВремяЖизни) Тогда
		Результат.УниверсальнаяДатаОкончания = ТекущаяУниверсальнаяДата() + Число(Результат.ВремяЖизни);
		Результат.УниверсальнаяДатаОкончанияМС = (Дата(1, 1, 1) - Результат.УниверсальнаяДатаОкончания) 
			* ВМиллисекундах * -1; 
	Иначе
		Результат.УниверсальнаяДатаОкончания = Дата(1, 1, 1);
		Результат.УниверсальнаяДатаОкончанияМС = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ВалидацияСессии(Знач Сессия)
	
	Если ТипЗнч(Сессия) = Тип("Структура") Тогда
		Сессия = Новый ФиксированнаяСтруктура(Сессия);
	КонецЕсли;

	Если СессияВалидна(Сессия) = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Если ТребуетсяОбновитьСессию(Сессия) Тогда
		Результат = ОбновитьСессию(Сессия);
	ИначеЕсли СессияЗавершена(Сессия) Или ТокенОтозван(Сессия.ТокенДоступа) Тогда
		Результат = Неопределено;
	Иначе
		Результат = Сессия;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ТребуетсяОбновитьСессию(Сессия)
	
	ОбновитьСессию = СессияЗавершена(Сессия) И ЗначениеЗаполнено(Сессия.ТокенОбновления);
	
	Если КонфигурацияПриложения.ПроверятьАктуальностьТокена Тогда
		ТокенОтозван = ТокенОтозван(Сессия.ТокенДоступа);
	Иначе
		ТокенОтозван = Ложь;
	КонецЕсли;
	
	Возврат ОбновитьСессию И Не ТокенОтозван;
	
КонецФункции

Функция СессияЗавершена(Сессия)

	Возврат  ТекущаяУниверсальнаяДата() >= Сессия.УниверсальнаяДатаОкончания;
	
КонецФункции

// ТОКЕН ОБНОВЛЕНИЯ

Функция _ОбновитьСессию(Сессия)
	
	ПараметрыЗапроса = ОбновитьСессиюСформироватьПараметры(Сессия.ТокенОбновления);
	Запрос = ЗапросТокен(ПараметрыЗапроса);
	
	Результат = Коннектор().Post(СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс), Запрос.Параметры);
	Ответ = Коннектор().КакJson(Результат);
	
	Если ОтветСОшибкой(Ответ) Тогда
		ВызватьИсключение СтдСтр().СтрШаблонЛок("error: %1, TraceId: %2", Ответ.Получить("error"), 
			Результат.Заголовки.Получить("X-Kontur-Trace-Id"));
	КонецЕсли;
	
	Результат = ТокенРазобратьОтвет(Ответ);
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция ОбновитьСессиюСформироватьПараметры(ТокенОбновления)
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("grant_type", "refresh_token");
	Результат.Вставить("client_id", КонфигурацияПриложения.Имя);
	Результат.Вставить("client_secret", КонфигурацияПриложения.Ключ);	
	Результат.Вставить("refresh_token", ТокенОбновления);
	
	Возврат Результат;
	
КонецФункции

// ПРОВЕРИТЬ ТОКЕН

Функция ТокенОтозван(Токен)
	
	Если КонфигурацияПровайдера.Тип = ТипАутентификацииКодУстройства() Тогда
		Результат = ЗначениеЗаполнено(ДанныеПользователя(Токен).ПортальныйИд) = Ложь;
	ИначеЕсли КонфигурацияПровайдера.Тип = ТипАутентификацииКлиентУчетныеДанные() Тогда
		Попытка
			Результат = Не ДанныеТокена(Токен).Активный;	
		Исключение
			Результат = Истина;
		КонецПопытки;
	Иначе
		ВызватьИсключение СтдСтр().СтрШаблонЛок("Не ожидаемый тип конфигурации провайдера: %1", КонфигурацияПровайдера.Тип);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ДАННЫЕ ПОЛЬЗОВАТЕЛЯ

Функция ДанныеПользователя(Токен)

	Запрос = ЗапросДанныеПользователя(Токен);	
	
	URL = СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс);
	ДополнительныеПараметры = Новый Структура("Заголовки", Запрос.Заголовки);
	
	Результат = Коннектор().Post(URL, Запрос.Параметры, ДополнительныеПараметры);
	Если Результат.КодСостояния >= Коннектор().КодыСостоянияHTTP().НеверныйЗапрос_400 Тогда
		Возврат МодельОтветДанныеПользователя();
	КонецЕсли;
	
	Ответ = Коннектор().КакJson(Результат);
	
	Возврат ДанныеПользователяРазобратьОтвет(Ответ);
	
КонецФункции

Функция ЗапросДанныеПользователя(ТокенДоступа)
	
	Результат = МодельЗапрос();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization", СтдСтр().СтрШаблонЛок("Bearer %1", ТокенДоступа));
		
	Результат.Хост = КонфигурацияПровайдера.Хост;
	Результат.Ресурс = "/connect/userinfo";
	Результат.Метод = "GET";
	Результат.Заголовки = Заголовки;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПользователяРазобратьОтвет(Ответ)
	
	Результат = МодельОтветДанныеПользователя();
	Результат.ПортальныйИд = Ответ.Получить("sub");
	Результат.Имя = Ответ.Получить("name");
	Результат.Почта = Ответ.Получить("email");
	
	Возврат Результат;
	
КонецФункции

// АНАЛИЗ ТОКЕНА

Функция ДанныеТокена(Токен)

	ПараметрыЗапроса = ДанныеТокенаСформироватьПараметры(Токен);
	Запрос = ЗапросДанныеТокена(ПараметрыЗапроса);	
	
	URL = СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс);
	ДополнительныеПараметры = Новый Структура("Заголовки", Запрос.Заголовки);
	
	Результат = Коннектор().Post(URL, Запрос.Параметры, ДополнительныеПараметры);
	Если Результат.КодСостояния > Коннектор().КодыСостоянияHTTP().НеАвторизован_401 Тогда
		Возврат "Не удалось получить данные о токене";
	КонецЕсли;
	
	Ответ = Коннектор().КакJson(Результат);
	
	Возврат ДанныеТокенаРазобратьОтвет(Ответ);
	
КонецФункции

Функция ДанныеТокенаСформироватьПараметры(Токен)

	Результат = Новый Соответствие;
		
	Результат.Вставить("token", Токен);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТокенаРазобратьОтвет(Ответ)
	
	Результат = МодельОтветДанныеТокена();
	
	Результат.Активный = Ответ.Получить("active");
	Результат.ПортальныйИд = Ответ.Получить("sub");
	Результат.Ресурсы = Ответ.Получить("aud");
	Результат.Разрешения = Ответ.Получить("scope");
	Результат.ИмяПриложения = Ответ.Получить("client_id");
	Результат.Провайдер = Ответ.Получить("iss");
	
	Год = 1970;
	
	Если Ответ.Получить("auth_time") <> Неопределено Тогда
		Результат.УниверсальнаяДатаСоздания = Дата(Год, 1, 1, 1, 0, 0) + Ответ.Получить("auth_time");
	КонецЕсли;
	Если Ответ.Получить("nbf") <> Неопределено Тогда
		Результат.УниверсальнаяДатаВыдачи = Дата(Год, 1, 1, 1, 0, 0) + Ответ.Получить("nbf");
	КонецЕсли;
	Если Ответ.Получить("exp") <> Неопределено Тогда
		Результат.УниверсальнаяДатаОкончания = Дата(Год, 1, 1, 1, 0, 0) + Ответ.Получить("exp");
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// ОТОЗВАТЬ ТОКЕН

Процедура ОтозватьТокен(Сессия)
		
	// Токен доступа
	
	ПараметрыЗапроса = ОтозватьТокенСформироватьПараметры(Сессия.ТокенДоступа, "access_token");
	Запрос = ЗапросОтозватьТокен(ПараметрыЗапроса);
	
	URL = СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс);
	ДополнительныеПараметры = Новый Структура("Заголовки", Запрос.Заголовки);
	
	Результат = Коннектор().Post(URL, Запрос.Параметры, ДополнительныеПараметры);
	
	// Токен обновления
	
	Если ЗначениеЗаполнено(Сессия.ТокенОбновления) Тогда
		
		ПараметрыЗапроса = ОтозватьТокенСформироватьПараметры(Сессия.ТокенОбновления, "refresh_token");
		Запрос = ЗапросОтозватьТокен(ПараметрыЗапроса);
		
		URL = СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс);
		ДополнительныеПараметры = Новый Структура("Заголовки", Запрос.Заголовки);
		
		Результат = Коннектор().Post(URL, Запрос.Параметры, ДополнительныеПараметры);
		
	КонецЕсли;

КонецПроцедуры

Функция ОтозватьТокенСформироватьПараметры(Токен, Тип)

	Результат = Новый Соответствие;
	
	Результат.Вставить("token_type_hint", Тип);	
	Результат.Вставить("token", Токен);
	
	Возврат Результат;
	
КонецФункции

// ВЫХОД

Функция Выйти(Сессия)
	
	Если Не ЗначениеЗаполнено(Сессия.ПортальныйИд) Тогда
		ВызватьИсключение "Для отзыва всех токенов необходим портальный идентификатор пользователя";
	КонецЕсли;
	
	Запрос = ЗапросВыйти(Сессия);	
	
	URL = СтдСтр().СтрШаблонЛок("%1%2", Запрос.Хост, Запрос.Ресурс);
	ДополнительныеПараметры = Новый Структура("Заголовки", Запрос.Заголовки);
	
	Результат = Коннектор().Post(URL,, ДополнительныеПараметры);
	Успех = Результат.КодСостояния < Коннектор().КодыСостоянияHTTP().НеверныйЗапрос_400;
	
	Если Успех Тогда
		ХранилищеСессий().УдалитьСессию(ОтборСессий);
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

// ДРУГОЕ

Функция КакJwt(Знач Токен)  

	Токен = СтрЗаменить(Токен, "-", "+");
	Токен = СтрЗаменить(Токен, "_", "/");

	МассивДанных = СтдСтр().СтрРазделитьЛок(Токен, ".");
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", Новый Соответствие);
	Результат.Вставить("Тело", Новый Соответствие);
	
	КоличествоЭлементовТокена = 3;
	
	Если МассивДанных.Количество() <> КоличествоЭлементовТокена Тогда
		Возврат Результат;
	КонецЕсли;
		
	Результат.Заголовок = Коннектор().JsonВОбъект(Base64Значение(МассивДанных[0] + Base64Постфикс(МассивДанных[0]))); 
	Результат.Тело = Коннектор().JsonВОбъект(Base64Значение(МассивДанных[1] + Base64Постфикс(МассивДанных[1])));
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКакДвоичныеДанные(Строка, КодировкаТекста_ = "UTF-8") Экспорт
	
	Если ВерсияСовместимостиБольшеРавно("8.3.10") Тогда
		
		ДвоичныеДанные = Вычислить("ПолучитьДвоичныеДанныеИзСтроки(Строка, КодировкаТекста_, Ложь)");
		
	Иначе
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_,, Истина);
		ЗаписьТекста.Записать(Строка);
		ЗаписьТекста.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция Base64Постфикс(СтрокаBase64)
	
	Результат = "";
	КоличествоСимволов = 4;
	КоличествоДополнительныхСимволов = КоличествоСимволов - (СтрДлина(СтрокаBase64) % КоличествоСимволов);

	Пока КоличествоДополнительныхСимволов > 0 Цикл
		
		Результат = Результат + "=";
		КоличествоДополнительныхСимволов = КоличествоДополнительныхСимволов - 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтветСОшибкой(Ответ)
	
	Возврат Ответ.Получить("error") <> Неопределено И Ответ.Получить("error") <> "authorization_pending";
	
КонецФункции

Процедура ПроверитьКонфигурациюПриложения(Значение)
		
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПриложения(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = СтдСтр().СтрСоединитьЛок(Результат, ", ");
		Сообщение = СтдСтр().СтрШаблонЛок("При проверке конфигурации приложения обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКонфигурациюПровайдера(Значение)
	
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПровайдера(), Значение);
	
	Если Результат.Количество() Тогда
		Ошибки = СтдСтр().СтрСоединитьЛок(Результат, ", ");
		Сообщение = СтдСтр().СтрШаблонЛок("При проверке конфигурации провайдера обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьКоллекцию(Модель, Коллекция)
	
	Ошибки = Новый Массив;
	Для Каждого Элемент Из Модель Цикл
		Если Элемент.Ключ = "Опции" Тогда
			Продолжить;
		КонецЕсли;
		Если Коллекция.Свойство(Элемент.Ключ) = Ложь Тогда
				Ошибки.Добавить(СтдСтр().СтрШаблонЛок("Не найден ключ: %1", Элемент.Ключ));
				Продолжить;
		КонецЕсли;
		Если ЗначениеКоллекцииЗаполнено(Коллекция[Элемент.Ключ]) = Ложь Тогда
				Ошибки.Добавить(СтдСтр().СтрШаблонЛок("Пустое значение ключа: %1", Элемент.Ключ));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

Функция ЗначениеКоллекцииЗаполнено(Значение)
	
	ТипЗнч = ТипЗнч(Значение);
	
	Если ТипЗнч = Тип("Строка") Тогда
		Результат = Значение <> "";
	ИначеЕсли ТипЗнч = Тип("Массив") Тогда
		Результат = Значение.Количество() > 0;
	ИначеЕсли Значение = Неопределено Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗнч = Тип("Булево") Или ТипЗнч = Тип("Число") Тогда
		Результат = Истина;
	Иначе
		ВызватьИсключение "Неопределенный ключ конфигурации";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает контракт опций конифгурации приложения
//
// Возвращаемое значение:
//	- Структура:
// Ссылка - Строка - Наименование опциональной гиперссылки на основной форме. Необязательный
// ПредставлениеСсылки - Строка - Адрес перехода по опциональной ссылке на форме. Необязательный
//
Функция МодельОпции()

	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("ПредставлениеСсылки");
	
	Возврат Результат;
	
КонецФункции

Функция СтдСтр()
	
	Если СтдСтрЛок = Неопределено Тогда
		Если _ЭтоВнешняяОбработка() Тогда
			СтдСтрЛок = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		Иначе
			СтдСтрЛок = Новый("DataProcessorObject.КонтурДиадокСтдСтр");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтдСтрЛок;
	
КонецФункции

Функция Коннектор()
	
	Если HttpЛок = Неопределено Тогда
		Если _ЭтоВнешняяОбработка() Тогда
			HttpЛок = Новый("ExternalDataProcessorObject.КонтурДиадокКоннекторHTTP");
		Иначе
			HttpЛок = Новый("DataProcessorObject.КонтурДиадокКоннекторHTTP");
		КонецЕсли;
	КонецЕсли;
	
	Возврат HttpЛок;
	
КонецФункции

Функция ХранилищеПоУмолчанию() Экспорт

	Если _ЭтоВнешняяОбработка() Тогда
		Результат = Новый("ExternalDataProcessorObject.КонтурДиадокАутентификаторХранилище");
	Иначе
		Результат = Новый("DataProcessorObject.КонтурДиадокАутентификаторХранилище");
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция УдалитьПустыеЛок(Коллекция)

	Пустые = Новый Массив;
	Для Каждого Элемент Из Коллекция Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			Пустые.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;    
	
	Для Каждого Элемент Из Пустые Цикл
		Коллекция.Удалить(Элемент);
	КонецЦикла; 
	
	Возврат Коллекция;
	
КонецФункции

Функция ХранилищеЭтоОбработка(Значение)
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоЭлементов = 2;
	МассивЗначений = СтдСтр().СтрРазделитьЛок(Значение, ".");
	Если МассивЗначений.Количество() <> КоличествоЭлементов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат МассивЗначений[0] = "DataProcessorObject" 
		Или МассивЗначений[0] = "ExternalDataProcessorObject"
		Или МассивЗначений[0] = "DataProcessorManager";
		
КонецФункции

Функция ХранилищеЭтоСправочник(Значение)

	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Метаданные.Справочники.Найти(Значение) <> Неопределено;
	
КонецФункции

Функция ХранилищеЭтоРегистрСведений(Значение)

	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Метаданные.РегистрыСведений.Найти(Значение) <> Неопределено;
	
КонецФункции

Функция ХранилищеЭтоОбщийМодуль(Значение)
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтдСтр().СтрНайтиЛок(Значение, ".") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Метаданные.ОбщиеМодули.Найти(Значение) <> Неопределено;
		
КонецФункции

Функция Авторизация(Тип, Значение)

	Возврат  СтдСтр().СтрШаблонЛок("%1 %2", Тип, Значение);
	
КонецФункции

Функция АвторизацияБазовая()
	
	Ключ = СтдСтр().СтрШаблонЛок("%1:%2", КонфигурацияПриложения.Имя, КонфигурацияПриложения.Ключ);
	Значение = Base64Строка(СтрокаКакДвоичныеДанные(Ключ));
	Значение = СтрЗаменить(Значение, Символы.ПС, "");
	Значение = СтрЗаменить(Значение, Символы.ВК, "");
	
	Возврат Авторизация("Basic", Значение);
	
КонецФункции

Функция СессияВалидна(Сессия)
	
	Возврат ТипЗнч(Сессия) = Тип("ФиксированнаяСтруктура")
		И Сессия.Свойство("ТокенДоступа")
		И Не ПустаяСтрока(Сессия.ТокенДоступа)
		И Сессия.Свойство("Тип")
		И ЗначениеЗаполнено(Сессия.Тип);
		
КонецФункции

Функция СортироватьРазрешения(Разрешения)
	
	Массив = СтдСтр().СтрРазделитьЛок(Разрешения, " ");
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Возврат СтдСтр().СтрСоединитьЛок(Список.ВыгрузитьЗначения(), " "); 
	
КонецФункции

Функция ВерсияСовместимостиБольшеРавно(ВерсияСтрокой) Экспорт
	
		ВерсияСовместимостиБольшеРавно = Истина;
		Если Метаданные.РежимСовместимости = Неопределено Или Метаданные.РежимСовместимости
			= Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Результат = СтдСтр().СравнитьВерсииЛок(СистемнаяИнфо.ВерсияПриложения, ВерсияСтрокой) >= 0;
		Иначе
			РежимСовместимости = Строка(Метаданные.РежимСовместимости);
			РежимСовместимости = СтрЗаменить(РежимСовместимости, "Версия", "");
			РежимСовместимости = СтрЗаменить(РежимСовместимости, "Version", "");
			РежимСовместимости = СтрЗаменить(РежимСовместимости, "_", ".");
			Результат = СтдСтр().СравнитьВерсииЛок(РежимСовместимости, ВерсияСтрокой) >= 0;
		КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ТипАутентификацииКодУстройства()

	Возврат "urn:ietf:params:oauth:grant-type:device_code";
	
КонецФункции

Функция ТипАутентификацииКлиентУчетныеДанные()

	Возврат "client_credentials";
	
КонецФункции

Функция ИмяКомпонентыГенератораQr()
	
	Возврат "QrLib";
	
КонецФункции